[
  {
    "input": "Twilight Sparkle: Ommmmm... Ohhhhhhh mmmmy goodness, I can't handle this! Ooh! Nothing is working! I just have to get it together! Just go in there! And ask! This is your Friendship Festival! Everypony's happiness rests in your hooves. Ohhhh!",
    "output": "Spike: Okay, Twilight. Got all your charts and graphs."
  },
  {
    "input": "Twilight Sparkle: Oh, thank goodness you're here, Spike! I'm just so nervous about this meeting!",
    "output": "Spike: Whachoo talkin' 'bout?"
  },
  {
    "input": "Twilight Sparkle: I'm about to ask the three most royal princesses of Equestria for a huge favor! What if they reject me?",
    "output": "Spike: It'll be fine. Just remember the most important thing."
  },
  {
    "input": "Twilight Sparkle: Smile?!",
    "output": "Spike: Eh... no. You're a Princess, too."
  },
  {
    "input": "Twilight Sparkle: Right! Good morning, Princesses. Thank you all for seeing me. I have an idea that I think will make our Friendship Festival the most wonderful celebration Equestria has ever seen!",
    "output": "Princess Celestia: Yes, Twilight! We are very excited!"
  },
  {
    "input": "Twilight Sparkle: Songbird Serenade's performance is not scheduled to start until after you begin the sunset. And based on my precise calculation, to get the very best lighting for the stage, Princess Celestia, I was hoping you could make sure the sun stays about 28.1º to the south, and, Princess Luna, if you could raise the moon 62º to the north at the same time, it would reflect the sunlight on the other side and really frame the entire stage perfectly!",
    "output": "Princess Luna: I..."
  },
  {
    "input": "Twilight Sparkle: But wait! There's more! Cadance, if you could use your crystal magic to create an aurora above the stage, the sun and the moon will shine through it and create a truly amazing light show!",
    "output": "Spike: Presenting Songbird Serenade!"
  },
  {
    "input": "Twilight Sparkle: Well, I'd do it myself, except I don't have your magic.",
    "output": "Princess Celestia: Twilight, each of us uses our powers to serve Equestria in our own way. You are the Princess of Friendship. You already have all the magic you need."
  },
  {
    "input": "Twilight Sparkle: So... that'd be a no?",
    "output": "Rainbow Dash: Yes!"
  },
  {
    "input": "Twilight Sparkle: Okay, just two hundred and eighteen things left to do and we're ready.",
    "output": "Rainbow Dash''', '''Applejack''', '''Fluttershy''' and '''Pinkie Pie: Hey, Twilight!"
  },
  {
    "input": "Twilight Sparkle: Not exactly. They think I can make today perfect without their magic.",
    "output": "Rarity: And they are absolutely right, darling. This festival is your brilliant idea and we know you're up to the task!"
  },
  {
    "input": "Twilight Sparkle: But what if I'm not?! What if Songbird Serenade hates the stage?! Or nopony makes a new friend?! And if I fail at the festival, then who am I?!",
    "output": "Pinkie Pie: Twilight, look at me! This will be the biggest celebration Equestria has ever seen! As the Princess of Friendship, you cannot fail! This day will define who you are! The pressure is intense! It's almost too much for any single pony to handle!"
  },
  {
    "input": "Twilight Sparkle: Pinkie!",
    "output": "Pinkie Pie: Oopsie! Guess my easy bake confetti cake cannon needs a little bit more fine tuning!"
  },
  {
    "input": "Twilight Sparkle: Hmmm...",
    "output": "Code Red: Songbird Serenade? Is it really her? It is, it is!"
  },
  {
    "input": "Twilight Sparkle: Ms. Songbird Serenade? Um, I was just going to check on you. I'm Princess Twilight, and sorry about the mess. I'm usually not so...",
    "output": "Female pony: Oh! How embarrassing!"
  },
  {
    "input": "Twilight Sparkle: Heh heh.",
    "output": "Vinny: You have visual on buttercream?"
  },
  {
    "input": "Twilight Sparkle: Storm clouds? I ordered perfect weather! Rainbow Dash?!",
    "output": "Rainbow Dash: Uh... I... don't think those are storm clouds."
  },
  {
    "input": "Twilight Sparkle: Is that a... unicorn?",
    "output": "Spike: I think so, but what happened to her horn?"
  },
  {
    "input": "Twilight Sparkle: Hi there. Princess of Friendship. Not exactly sure what's going on, but I know we can talk things out.",
    "output": "Tempest Shadow: Oh, goody. All four Princesses. Here's the deal, ladies. I need your magic. Give it up nicely, please, or we make it difficult for everyone!"
  },
  {
    "input": "Twilight Sparkle: Luna!",
    "output": "Rainbow Dash: Twilight!"
  },
  {
    "input": "Twilight Sparkle: Come on!",
    "output": "Grubber: Which one of you guyth ith goin' down there?"
  },
  {
    "input": "Twilight Sparkle: The Queen.",
    "output": "Pinkie Pie: Yeah, the Queen! Uh, what queen?"
  },
  {
    "input": "Twilight Sparkle: Celestia told Luna to find the Queen of the... \"Hippos\". Luna can't, so I have to.",
    "output": "Rainbow Dash: Uh, hippos? Seriously?"
  },
  {
    "input": "Twilight Sparkle: They're somewhere south, past the Badlands.",
    "output": "Fluttershy: That means we'll have to... leave Equestria. Oh!"
  },
  {
    "input": "Twilight Sparkle: I understand you're scared, and nopony else has to go. But I have to find this queen. She might be our only hope.",
    "output": "Rainbow Dash: Well, you're not getting all the glory. We're in this together."
  },
  {
    "input": "Twilight Sparkle: Hmm? A road? Where there's a road, there's a...",
    "output": "Spike: Whoa!"
  },
  {
    "input": "Twilight Sparkle: Hi there! Ooh, I'm sorry. Here. Lemme help you with that.",
    "output": "Pushkin: Hey! No magic around my merchandise!"
  },
  {
    "input": "Twilight Sparkle: Okay. We just gotta stick together. Be careful who you talk to. And try to blend in.",
    "output": "Pinkie Pie: Can I have your attention please?!"
  },
  {
    "input": "Twilight Sparkle: Pinkie, you can't just take off! And you don't need to announce to every...",
    "output": "Pinkie Pie: Relax, Twilight! I totally got this!"
  },
  {
    "input": "Twilight Sparkle: Uh, Spike isn't for sale.",
    "output": "Vera: I want that fancy purple hair! I'll give ya two storm bucks for it!"
  },
  {
    "input": "Twilight Sparkle: Heh?",
    "output": "Deer Creature: Gimme that pink one!"
  },
  {
    "input": "Twilight Sparkle: I don't know if we should trust him.",
    "output": "Pinkie Pie: We could definitely use a friend out here!"
  },
  {
    "input": "Twilight Sparkle: Huh?",
    "output": "Toothy Klugetowner: Please! Please! I don't know anything!"
  },
  {
    "input": "Twilight Sparkle: Guys! We've been looking for the wrong queen! We don't need the Queen of the Hippos! We need the Queen of the Hippogriffs! Part pony, part eagle!",
    "output": "Capper: Oh! Oh, the Hippogriffs! Now, the trouble with that is... no one knows... where they are..."
  },
  {
    "input": "Twilight Sparkle: Says here they're on the top of Mount Aris!",
    "output": "Pinkie Pie: You mean the mountain right outside the window?"
  },
  {
    "input": "Twilight Sparkle: Let's go, everypony.",
    "output": "Capper: Wait! You can't—you can't make it by y'allselves. You need an airship! And lucky for you, I can get you a ride."
  },
  {
    "input": "Twilight Sparkle: I think we can get there on our own.",
    "output": "Verko: Here's Verko!"
  },
  {
    "input": "Twilight Sparkle: I knew it! We gotta get outta here!",
    "output": "Tempest Shadow: Silly little ponies."
  },
  {
    "input": "Twilight Sparkle: Tempest!",
    "output": "Tempest Shadow: Trusting strangers? Big mistake. Big..."
  },
  {
    "input": "Twilight Sparkle: Go! Go!",
    "output": "Tempest Shadow: Get her now!"
  },
  {
    "input": "Twilight Sparkle: We have to get there! To the docks! Hurry!",
    "output": "Applejack: That's it."
  },
  {
    "input": "Twilight Sparkle: Pinkie!",
    "output": "Pinkie Pie: Best... escape... plan... ever!"
  },
  {
    "input": "Twilight Sparkle: WHAT?! Thwa!",
    "output": "Spike: Shh!"
  },
  {
    "input": "Twilight Sparkle: Last time we trusted somepony, he tried to sell us!",
    "output": "Boyle: Hey, guys! Come check this out!"
  },
  {
    "input": "Twilight Sparkle: What?",
    "output": "Rainbow Dash: Whoa, whoa, whoa! So you were about to toss us overboard and you stopped for a lunch break?"
  },
  {
    "input": "Twilight Sparkle: Then can you deliver us to Mount Aris?",
    "output": "Captain Celaeno: Sorry. We do what the Storm King orders or we suffer his wrath."
  },
  {
    "input": "Twilight Sparkle: Right. Still going overboard.",
    "output": "Lix Spittle: Eh, it's nothing personal. Pudding?"
  },
  {
    "input": "Twilight Sparkle: —song.",
    "output": "Captain Celaeno: Come on! Let's show these little ponies how it's done!"
  },
  {
    "input": "Twilight Sparkle: No no no no no! No!",
    "output": "Rainbow Dash: Aw, yeah!"
  },
  {
    "input": "Twilight Sparkle: Ohhh!",
    "output": "Grubber: Huh? Huh? Looka that rainbow! Looka that rainbow! Whoa, that'th so cool!"
  },
  {
    "input": "Twilight Sparkle: Tempest!",
    "output": "Captain Celaeno: Secure the rigging! Lock down the cargo! Everyone, prepare to be boarded!"
  },
  {
    "input": "Twilight Sparkle: Are you kidding me?!",
    "output": "Spike: Whoa!"
  },
  {
    "input": "Twilight Sparkle: We have to get off this ship before they tell Tempest we're here!",
    "output": "Rainbow Dash: We helped them get their mojo back! They're not gonna give us up!"
  },
  {
    "input": "Twilight Sparkle: I've got this!",
    "output": "Tempest Shadow: Now, I'm gonna count to three, and if you don't tell me where they are, your ship is going down. One..."
  },
  {
    "input": "Twilight Sparkle: Hold this!",
    "output": "Rainbow Dash: What are you doing?!"
  },
  {
    "input": "Twilight Sparkle: Yahoo! Ha ha!",
    "output": "Pinkie Pie: That was fun! Can we do it again?"
  },
  {
    "input": "Twilight Sparkle: We're home free!",
    "output": "Grubber: There'th no ponieth. But I found thith. It'th a... kind of a cupcake... with thprinkleth... Oh, yeah, and I found thith, too."
  },
  {
    "input": "Twilight Sparkle: This is it!",
    "output": "Pinkie Pie: Ooh!"
  },
  {
    "input": "Twilight Sparkle: But... Celestia... The map. They have to be here.",
    "output": "Spike: Something bad happened here. Something that turned this whole place into a ghost town."
  },
  {
    "input": "Twilight Sparkle: It's coming from over there!",
    "output": "Princess Skystar: What was that?!"
  },
  {
    "input": "Twilight Sparkle: Pinkie!",
    "output": "Pinkie Pie: She's gone!"
  },
  {
    "input": "Twilight Sparkle: Now what?",
    "output": "Pinkie Pie: Huh?"
  },
  {
    "input": "Twilight Sparkle: I didn't make these bubbles!",
    "output": "Fluttershy: Then who did?"
  },
  {
    "input": "Twilight Sparkle: Hello? We're looking for the Hippogriffs.",
    "output": "Princess Skystar: How do I know I can trust you?"
  },
  {
    "input": "Twilight Sparkle: Please. The Storm King invaded our land. And we need their help.",
    "output": "Princess Skystar: The Storm King?! I'm so glad I saved you guys! I'm totally taking you to my mom!"
  },
  {
    "input": "Twilight Sparkle: Does your mother know where they are?",
    "output": "Princess Skystar: Oho! She might have an idea!"
  },
  {
    "input": "Twilight Sparkle: Hoo-hoo!",
    "output": "Princess Skystar: We're almost there!"
  },
  {
    "input": "Twilight Sparkle: We need to find the Hippogriffs. Do you know what happened to them?",
    "output": "Queen Novo: Well, of course I know. I'm the queen. I know everything."
  },
  {
    "input": "Twilight Sparkle: But... how?",
    "output": "Princess Skystar: Oh! Can we show them? Huh? These are the first guests we've had in, like, foreveeerrr! Can we, can we, can we, can we, can we, can we, can we, can we, can we?"
  },
  {
    "input": "Twilight Sparkle: Oh!",
    "output": "Fluttershy: Ooh! Oh!"
  },
  {
    "input": "Twilight Sparkle: This is amazing! With this, we could transform everypony at home into something powerful enough to face the Storm King's army!",
    "output": "Queen Novo: Or it could end up in his greedy claws!"
  },
  {
    "input": "Twilight Sparkle: But...",
    "output": "Queen Novo: Honey, I'm sorry about your home. I truly am. But my responsibility is to protect my subjects. The pearl... is not going anywhere."
  },
  {
    "input": "Twilight Sparkle: But we've come all this way. And you can't just hide down here! Trapped forever! There's so much you're missing!",
    "output": "Queen Novo: We are one hundred percent okay with that!"
  },
  {
    "input": "Twilight Sparkle: Oh, no. No no. Pinkie's right.",
    "output": "Rainbow Dash: Say what now?"
  },
  {
    "input": "Twilight Sparkle: So, go ahead and show Skystar the best time ever!",
    "output": "Pinkie Pie: I won't let you down!"
  },
  {
    "input": "Twilight Sparkle: I'm counting on it.",
    "output": "Princess Skystar: It's probably for the best."
  },
  {
    "input": "Twilight Sparkle: No! Please!",
    "output": "Queen Novo: All of this so you could sneak in and take the pearl?!"
  },
  {
    "input": "Twilight Sparkle: It was the only way to save Equestria.",
    "output": "Pinkie Pie: 'Cept it wasn't! The Queen was going to say yes! We did what you told us and that's what made her realize we were ponies worth saving! Unless... You didn't really want us to show her the best time ever! You just wanted us to distract her!"
  },
  {
    "input": "Twilight Sparkle: I never would have done it, but this isn't Equestria! We can't just dance around with con artists, make rainbooms in the sky and expect everything to work out! It's not enough! We are not enough!",
    "output": "Pinkie Pie: No, Twilight! We stuck together! We were gonna get the help we needed! The only thing that stopped us... was you!"
  },
  {
    "input": "Twilight Sparkle: Well, I'm doing the best I can! It's all on me. I'm the one Tempest wants. I'm the last Princess!",
    "output": "Pinkie Pie: You're also the only one who doesn't trust her friends!"
  },
  {
    "input": "Twilight Sparkle: Pinkie, I-",
    "output": "Pinkie Pie: I just can't talk to you right now."
  },
  {
    "input": "Twilight Sparkle: No! I can't. I ruined everything! There's no chance to save Equestria now. It's all my fault! Spike?",
    "output": "Spike: Twilight, look out!"
  },
  {
    "input": "Twilight Sparkle: No, no, no, no, no! Noooooo!",
    "output": "Spike: Twilight, help me!"
  },
  {
    "input": "Twilight Sparkle: Spiiiiiike!!!",
    "output": "Spike: Twiliiiiiight!!!"
  },
  {
    "input": "Twilight Sparkle: Why are you doing this? You're a pony! Just like me.",
    "output": "Tempest Shadow: I'm nothing like you! I'm more than you'll ever be!"
  },
  {
    "input": "Twilight Sparkle: I'm so sorry you felt so alone.",
    "output": "Tempest Shadow: I saw the truth. My \"friends\" abandoned me when times got tough. Looks like I'm not the only one. Face it, Princess. Friendship has failed you, too."
  },
  {
    "input": "Twilight Sparkle: Friendship didn't fail me. I failed friendship.",
    "output": "Fluttershy: This whole journey was such a mistake. All we wanted was somepony to help us."
  },
  {
    "input": "Twilight Sparkle: Tempest, don't do this. Don't give the Storm King—",
    "output": "Tempest Shadow: Your magic? Did you think you'd keep it all to yourself? Time to share. I'd love for everybody out there to know what I can really do."
  },
  {
    "input": "Twilight Sparkle: I'm the Princess of Friendship!",
    "output": "The Storm King: Oh. That's nice. Why is this one still moving?"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "The Storm King: Check out the light show! Wow! Wow!"
  },
  {
    "input": "Twilight Sparkle: It's... It's the Magic of...",
    "output": "The Storm King: Yeah, yeah! Friendship, and flowers, and ponies, and bleh! I'm so totally over the cute pony thing. This... ends... now!"
  },
  {
    "input": "Twilight Sparkle: Hold on!",
    "output": "Tempest Shadow: Why are you saving me?"
  },
  {
    "input": "Twilight Sparkle: Because this is what friends do.",
    "output": "The Storm King: Awwww! Isn't that just so sweet! Yeah. See ya!"
  },
  {
    "input": "Twilight Sparkle: Pinkie! You all came back! I'm so sorry! I was wrong to—",
    "output": "Pinkie Pie: I'm sorry, too. Friends mess up sometimes, but we never should've—"
  },
  {
    "input": "Twilight Sparkle: I've gotta get control of it!",
    "output": "Pinkie Pie: Go! You've got this, Twilight!"
  },
  {
    "input": "Twilight Sparkle: No. We've got this. Together.",
    "output": "Pinkie Pie: Whee!"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "Pinkie Pie: Twilight! Nooooooooooo!!!"
  },
  {
    "input": "Twilight Sparkle: I can.",
    "output": "Fluttershy: Now what?"
  },
  {
    "input": "Twilight Sparkle: Princesses! Oh!",
    "output": "Spike: Fillies and gentlecolts, get ready for a little..."
  },
  {
    "input": "Twilight Sparkle: Well, I hope you'll stay. More friends are definitely merrier.",
    "output": "Tempest Shadow: But, um... my horn."
  },
  {
    "input": "Twilight Sparkle: You know, your horn is pretty powerful, just like the pony it belongs to.",
    "output": "Tempest Shadow: I did tell you I wanted to show everypony in Equestria what I could do, right?"
  },
  {
    "input": "Twilight Sparkle: So everypony got an urgent summons to the castle with no explanation?",
    "output": "Pinkie Pie: Yup! I just love a good mysterious summons. What's it about? Do you think it's a surprise party? Hey! Why are we running?"
  },
  {
    "input": "Twilight Sparkle: Because something could be terribly wrong! Somepony turned bad? Another evil creature back for revenge?!",
    "output": "Applejack: Don't you think you're bein' a little paranoid?"
  },
  {
    "input": "Twilight Sparkle: Why else would the Princesses send scrolls in such a hurry?",
    "output": "Rarity: Good point. They know better than to make us worry."
  },
  {
    "input": "Twilight Sparkle: What's wrong?! What can we do?!",
    "output": "Princess Luna: That's just it. Nothing's wrong! Everything's perfect!"
  },
  {
    "input": "Twilight Sparkle: Thank you!",
    "output": "Princess Luna: Because of your efforts, there's been less and less for us to do."
  },
  {
    "input": "Twilight Sparkle: You're retiring?!",
    "output": "Spike: Princesses can retire?"
  },
  {
    "input": "Twilight Sparkle: And you want me to take your place?!",
    "output": "Princess Celestia''' and '''Princess Luna: Mm-hmm!"
  },
  {
    "input": "Twilight Sparkle: Thank you, but that doesn't mean that I'm— that we're ready to do what you do!",
    "output": "Princess Celestia: Oh, of course you are. I realize this is a lot to take in, but—"
  },
  {
    "input": "Twilight Sparkle: You can't be ready to step into their horseshoes just like that!",
    "output": "Applejack: Well, if the princesses think it's time to retire, we're not a bad choice. We always have Equestria's best interests at heart."
  },
  {
    "input": "Twilight Sparkle: That's a fair point... which should be taken into consideration when we have a round table discussion—",
    "output": "Rarity: Well, I'm in! Darlings, we'll all need a complete wardrobe update! And I would love to pick your brain about mane maintenance when you have a moment."
  },
  {
    "input": "Twilight Sparkle: If you're all on board, I guess I am, too.",
    "output": "Mane Six''' and '''Spike: Protectors of Equestria!"
  },
  {
    "input": "Twilight Sparkle: It'll be a bit of an adjustment, but I imagine the transfer of power will be a lengthy process, which will—",
    "output": "Princess Celestia: Actually, we just need a few days to put together a little ceremony."
  },
  {
    "input": "Twilight Sparkle: But that's so soon! Shouldn't there be some sort of training program that lasts weeks? No, months? If not years?!",
    "output": "Princess Celestia: Everything you've gone through over the years has been a training program."
  },
  {
    "input": "Twilight Sparkle: Okay, but there's gotta be a guide or a rulebook!",
    "output": "Discord: Yes, I have it right here. \"How to Rule Equestria\", by Nopony McPretendsmith."
  },
  {
    "input": "Twilight Sparkle: I am not confident about this at all!",
    "output": "Discord: Well, that's what I thought. I was being sarcastic before."
  },
  {
    "input": "Twilight Sparkle: It's just... I know I said yes, but then they said \"in a few days\", and there's still so much to figure out! It's all happening so fast! I think I need some— Okay! I'll feel much better—",
    "output": "Rarity: —once you make a plan?"
  },
  {
    "input": "Twilight Sparkle: Oh, wow. It's like you—",
    "output": "Spike: —knew you were going to react this way? We did."
  },
  {
    "input": "Twilight Sparkle: \"Twilight-ing\"? You... You made me a verb?",
    "output": "Applejack: It's not a bad thing. We just know you have a... process."
  },
  {
    "input": "Twilight Sparkle: You're all acting so calm! But this is a big deal! What do we do if something big happens and the princesses aren't there to help?!",
    "output": "Rainbow Dash: Um, if you think about it, they literally almost never help."
  },
  {
    "input": "Twilight Sparkle: Phew!",
    "output": "Queen Chrysalis: One day, you'll see! I will defeat Twilight Sparkle and her friends! And they will pay for stealing my kingdom!"
  },
  {
    "input": "Twilight Sparkle: So much to do, not enough time! No! I already did that! Wait, no, I didn't! Uggggh, not enough time!",
    "output": "Spike: Help! She's spiraling! We're at the \"my plan needs a plan\" stage of a total Twilight meltdown!"
  },
  {
    "input": "Twilight Sparkle: Did I write down \"eliminate redundant lists\" on my School of Friendship to-do list or my personal to-do list?",
    "output": "Starlight Glimmer: Twilight!"
  },
  {
    "input": "Twilight Sparkle: Gah! Starlight! Oh, good, you're here! I need to talk to you.",
    "output": "Starlight Glimmer: Okay..."
  },
  {
    "input": "Twilight Sparkle: Hang on, I had \"talk to Starlight\" written down on one of these. Just let me find it so I can cross it off!",
    "output": "Starlight Glimmer: Wow, you are \"Twilight-ing\" hard."
  },
  {
    "input": "Twilight Sparkle: You say \"Twilight-ing\", too? Well excuuuuse me! This is the first time I've ever been asked to run a whole kingdom!",
    "output": "Starlight Glimmer: Uh, you're right, you're right. So, what did you want to talk to me about?"
  },
  {
    "input": "Twilight Sparkle: Ah, here it is! I wrote it down. Starlight, you have blossomed into one of the strongest, smartest, most caring ponies I know, and I can't think of anypony better to leave in charge of my castle and the School of Friendship! So what do you think?",
    "output": "Starlight Glimmer: What?! You want me to take care of the castle and run the school?!"
  },
  {
    "input": "Twilight Sparkle: Yes?",
    "output": "Starlight Glimmer: Uh... I can't! I'm not ready! Remember what happened the last time you left me in charge?! And now you want me to do it permanently?! What if I don't do the right things?! What if—?!"
  },
  {
    "input": "Twilight Sparkle: Starlight, get a hold of yourself! You've risen to every challenge you've ever faced. You can do anything you put your mind to. You've got this.",
    "output": "Starlight Glimmer: Hah! And so do you. See what I did there? You just said everything you need to hear."
  },
  {
    "input": "Twilight Sparkle: Nice try. But running a school and running a country are two very different things. Now, if you don't mind I have seven thousand, four hundred, and thirty-two things to take care of before I become the new ruler of Equestria!",
    "output": "Spike: It was a valiant effort."
  },
  {
    "input": "Twilight Sparkle: Thanks for coming so quickly—",
    "output": "Discord: Sure thing. But if you're gonna be the ruler of Equestria, you may want to work on your penmanship. This looks like it says, \"Cadance sent an emergency message. Sombra's back, and he's taking over the Crystal Empire.\""
  },
  {
    "input": "Twilight Sparkle: That's exactly what it says!",
    "output": "Rarity: But... But how is that possible?! I thought the Crystal Heart had dispelled him into the ether!"
  },
  {
    "input": "Twilight Sparkle: I have no idea! But he's back, and it's up to us to save the Empire and my family!",
    "output": "Fluttershy: Shouldn't somepony tell Celestia and Luna?"
  },
  {
    "input": "Twilight Sparkle: No. If we're going to run Equestria, we'll need to handle things like this on our own.",
    "output": "Discord: Oh, Twilight! Could this mean that you finally have the confidence to ascend to the throne like the princesses believe you can?"
  },
  {
    "input": "Twilight Sparkle: Maybe? Unless you'd consider taking care of Sombra for us?",
    "output": "Discord: Oh, no-no-no-no! You're absolutely right! You need to learn how to handle these things on your own. Ta-ta!"
  },
  {
    "input": "Twilight Sparkle: With the Elements of Harmony! With those, we can defeat anypony! Even Sombra!",
    "output": "Discord: Ah, no-no-no. You didn't need the Elements the last time you defeated Sombra. And I'm not sure that using them still counts as \"handling things on your own\"."
  },
  {
    "input": "Twilight Sparkle: My family is in danger. I'm not taking any chances.",
    "output": "Rainbow Dash: She's got a point."
  },
  {
    "input": "Twilight Sparkle: Starlight, can you stay here and-",
    "output": "Starlight Glimmer: -take care of the school? I've got you covered."
  },
  {
    "input": "Twilight Sparkle: Oh...",
    "output": "Princess Celestia: Oh, Twilight. How disappointing."
  },
  {
    "input": "Twilight Sparkle: We didn't need to defeat them. We just needed to face them long enough to distract you!",
    "output": "King Sombra: Nooooo!"
  },
  {
    "input": "Twilight Sparkle: We did handle this pretty well. On our own.",
    "output": "Spike: Does this mean...?"
  },
  {
    "input": "Twilight Sparkle: I still don't feel like I'm one hundred percent ready, but will I ever?",
    "output": "Applejack: Knowing you? Nope."
  },
  {
    "input": "Twilight Sparkle: Once again, Equestria is safe.",
    "output": "Fluttershy: What should we do to celebrate?"
  },
  {
    "input": "Twilight Sparkle: I don't know!",
    "output": "Princess Celestia: It is time for us... to retire!"
  },
  {
    "input": "Twilight Sparkle: And you want me to take your place?!",
    "output": "Princess Celestia: With the help of your friends, of course."
  },
  {
    "input": "Twilight Sparkle: With the Elements of Harmony! With those, we can defeat anypony!",
    "output": "Rainbow Dash: What. Just. Happened?!"
  },
  {
    "input": "Twilight Sparkle: It can't be!",
    "output": "King Sombra: But it is! You thought you defeated me, but you led me right to the source of your power. Now that it's destroyed, nothing can stop me!"
  },
  {
    "input": "Twilight Sparkle: He's right... With the Elements gone, I don't know how we can defeat him!",
    "output": "Rainbow Dash: Then we'll just have to beat him the old-fashioned way!"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "King Sombra: Oh, yes. And I think I know exactly where I'll start."
  },
  {
    "input": "Twilight Sparkle: I don't know! The Tree of Harmony grew the Elements! It kept the Everfree Forest under control! And now it's gone. Sombra will take over Equestria, and it's all my fault! I knew I wasn't ready to take the princesses' place, but I never thought I'd mess up this badly!",
    "output": "Pinkie Pie: What are you looking at me for?"
  },
  {
    "input": "Twilight Sparkle: We can't just stay here. I don't have a plan, and I don't know what I'm gonna do once we get out. But we can't sit here and let Sombra make slaves of everypony we love!",
    "output": "Rainbow Dash: Let me help! I'm faster!"
  },
  {
    "input": "Twilight Sparkle: I... I can't! Without the Elements, my magic isn't strong enough to stop Sombra's! Spike! Spike, where are you going? Starlight?",
    "output": "Starlight Glimmer: We must lay siege to Canterlot."
  },
  {
    "input": "Twilight Sparkle: No! Snap out of it, you two! You're stronger than his magic!",
    "output": "Rarity: Sweetie Belle, please stop! I can't get her to stop! I can't get her—!"
  },
  {
    "input": "Twilight Sparkle: None of us can. We can't reach them!",
    "output": "Pinkie Pie: He made them bake a black licorice fruitcake that says \"Congratulations to Our Favorite Supreme Emperor King Sombra\" in green frosting! It's the ugliest cake I've ever seen!"
  },
  {
    "input": "Twilight Sparkle: I don't know what to do! I don't know how to free them, but I don't know how to stop Sombra! Everypony was so sure I'd do such a great job! Well, this is exactly what I was afraid of! Could anything else possibly go wrong?!",
    "output": "Pinkie Pie: Well... With the Tree of Harmony gone, the Everfree Forest could grow out of control and threaten the town!"
  },
  {
    "input": "Twilight Sparkle: Even if we figure out how to defeat Sombra and bring everypony back to Ponyville, if we don't stop the forest, there won't be a Ponyville to come back to!",
    "output": "Rainbow Dash: Ahem."
  },
  {
    "input": "Twilight Sparkle: For Equestria!",
    "output": "Mane Six: Equestria!"
  },
  {
    "input": "Twilight Sparkle: We have to keep trying!",
    "output": "Applejack: I know we're supposed to be able to handle things on our own, but I've never been happier to see two ponies in my whole life!"
  },
  {
    "input": "Twilight Sparkle: Star Swirl! The Tree of Harmony, it's—!",
    "output": "Star Swirl: I know. I alerted the princesses as soon as I could. I felt it when it happened. Like part of my essence just ceased to be."
  },
  {
    "input": "Twilight Sparkle: I know what you mean. I'm sorry.",
    "output": "Star Swirl: Don't be. I've more than enough magic in me to keep the Everfree Forest under control."
  },
  {
    "input": "Twilight Sparkle: You can do that?",
    "output": "Star Swirl: The Pillars and I planted the Tree of Harmony. Who do you think kept the Forest under control before it did?"
  },
  {
    "input": "Twilight Sparkle: Sombra's back, and he's taken control of all of our friends!",
    "output": "Princess Luna: We've left Canterlot defenseless!"
  },
  {
    "input": "Twilight Sparkle: I don't know! I'm not prepared to fight against the citizens of Equestria! I guess that's one more thing I'm not ready to do...",
    "output": "Applejack: Well, we'd better figure out somethin' quick, because none of them seem to have a problem with it!"
  },
  {
    "input": "Twilight Sparkle: I'm sorry we couldn't help our friends, but I didn't know what else to do.",
    "output": "Applejack: At least we're inside."
  },
  {
    "input": "Twilight Sparkle: I... We...",
    "output": "Discord: Oh, my. No Elements? No princesses? Seems like you're in a bit of a pickle! Or are you in... ...more of a jam? Mmm!"
  },
  {
    "input": "Twilight Sparkle: Discord! What are you doing here?!",
    "output": "Discord: Well, I was going to hang these up all over the castle to celebrate your coronation, but apparently it's a bit premature."
  },
  {
    "input": "Twilight Sparkle: I'm so glad to see you! We could really use some all-powerful Lord of Chaos help right now!",
    "output": "Discord: Moi? Oh, I couldn't possibly."
  },
  {
    "input": "Twilight Sparkle: Discord, please!",
    "output": "Discord: Oh, fine. Just to be clear, I was really rooting for you to do this on your own and parlay that confidence boost into being the best protectors of Equestria you can be."
  },
  {
    "input": "Twilight Sparkle: I don't know what we'd do without you!",
    "output": "Rainbow Dash: Okay, \"King\" Sombra! Time to give up the crown!"
  },
  {
    "input": "Twilight Sparkle: We need you!",
    "output": "Fluttershy: Oh, please wake up, please wake up... Discord!"
  },
  {
    "input": "Twilight Sparkle: I'm so glad you're okay! We can't beat him without you!",
    "output": "King Sombra: You couldn't beat me with him, either!"
  },
  {
    "input": "Twilight Sparkle: Discord's right. We've proven time and time again that the real magic is the six of us working together! With these girls by my side, I'm not afraid of you! I'm not afraid of what you can do or how much power you have!",
    "output": "King Sombra: You should be."
  },
  {
    "input": "Twilight Sparkle: And again! As long as we're together, we will never stop trying to defeat you!",
    "output": "Fluttershy: For our friends!"
  },
  {
    "input": "Twilight Sparkle: For Equestria!",
    "output": "King Sombra: No! This can't be possible! Your magic can't defeat mine! I destroyed the source of your power!"
  },
  {
    "input": "Twilight Sparkle: You can't destroy our friendship, Sombra!",
    "output": "Rainbow Dash: And we keep telling bad guys."
  },
  {
    "input": "Twilight Sparkle: Celestia! Luna! I know what you're going to say. I should have called on you as soon as I knew how dangerous it was. A good leader knows when to ask for help, and I didn't. And because of me, the Tree of Harmony was destroyed. Equestria deserves somepony much better than me as its leader.",
    "output": "Princess Celestia: You're right."
  },
  {
    "input": "Twilight Sparkle: Will be?",
    "output": "Princess Celestia: Luna and I have decided it may have been a bit unfair to thrust this upon you without giving you the time you need to prepare."
  },
  {
    "input": "Twilight Sparkle: Thank goodness! I really wasn't ready!",
    "output": "Discord: Not ready?! So, Twilight's not taking over?! This was all for nothing?! I pretended to be very hurt and gave one of the most convincing speeches of my—?!"
  },
  {
    "input": "Twilight Sparkle: We definitely got this.",
    "output": "Rest of Mane Six: Awww!"
  },
  {
    "input": "Twilight Sparkle: Spike! I have horrible news!",
    "output": "Spike: What's wrong? Is the Crystal Empire under attack again?!"
  },
  {
    "input": "Twilight Sparkle: What? No! We only have twenty highlighters! And they're all orange! How will everycreature color-code their notes?!",
    "output": "Spike: I'm pretty sure you're the only one that does that."
  },
  {
    "input": "Twilight Sparkle: Still, twenty isn't enough for the new school year!",
    "output": "Spike: We got plenty of time to order more. The friendship students won't be back until—"
  },
  {
    "input": "Twilight Sparkle: Well, this is a surprise. Why are you all here so early? Did I send out the wrong back-to-school date?!",
    "output": "Smolder: Oh, we're not here for school."
  },
  {
    "input": "Twilight Sparkle: But the Tree couldn't have called you. It's gone! Sombra destroyed it!",
    "output": "Spike: Mmmmaybe next time, ease in with those truth bombs."
  },
  {
    "input": "Twilight Sparkle: Those are gone, too.",
    "output": "Ocellus: But doesn't that mean the Everfree Forest will take over Equestria?!"
  },
  {
    "input": "Twilight Sparkle: As long as you promise to stick together. The Castle of the Two Sisters isn't the safest place, as you may remember.",
    "output": "Yona: Yona not scared of puckwudgies anymore! Friends save whole school from evil Pegasus!"
  },
  {
    "input": "Twilight Sparkle: Well, as long as you get permission from your kingdoms, I suppose it's all right.",
    "output": "Gallus: You want that permission in triplicate, or is one enough?"
  },
  {
    "input": "Twilight Sparkle: I felt a burst of magic all the way over at the school! Is everycreature okay?",
    "output": "Silverstream: A little confused, but definitely okay!"
  },
  {
    "input": "Twilight Sparkle: Where did this come from?",
    "output": "Smolder: We were kinda gonna ask you the same thing."
  },
  {
    "input": "Twilight Sparkle: The Tree has always been good at surprises. When Star Swirl planted the Tree's seed, he didn't even know what it would grow into. I guess the Tree is still alive, changing and adapting to be whatever Equestria needs.",
    "output": "Gallus: A cool place to hang out?"
  },
  {
    "input": "Twilight Sparkle: Something tells me this is more than that. It seems the Elements of Harmony may still be with us in their own way.",
    "output": "Spike: That's actually really reassuring."
  },
  {
    "input": "Twilight Sparkle: I'm not sure. If I had to guess, I'd say your friendship is more powerful than you know.",
    "output": "Yona: Oh, Yona know. Yona just need to remind friends."
  },
  {
    "input": "Twilight Sparkle: Why don't we all go in together?",
    "output": "Spike: Twilight! Look at this scroll I just got!"
  },
  {
    "input": "Twilight Sparkle: Do you know what this means?",
    "output": "Spike: Uh-huh!"
  },
  {
    "input": "Twilight Sparkle: To keep it friendly, our parents gave us gold stars every time we did something special. Sharing... getting good grades... even telling a really funny joke. And at the end of each week, we'd add up the stars. The sibling with the most would win the Crown of the Sibling Supreme — and bragging rights — 'til next time.",
    "output": "Starlight Glimmer: Guess that explains your love of charts and so much else."
  },
  {
    "input": "Twilight Sparkle: You're wearing it?!",
    "output": "Shining Armor: Look, I know you've always held a grudge because I left home with this."
  },
  {
    "input": "Twilight Sparkle: Grudge? What grudge? Just because you've had it for way longer than you should have and I never got a chance to win it back!",
    "output": "Princess Celestia: With the return of Sombra, Princess Luna and I felt it was time to reinforce the castle's defenses."
  },
  {
    "input": "Twilight Sparkle: You want me to break into Celestia's castle?",
    "output": "Shining Armor: If you can get past my defenses, steal the crown, and get out, you'll be Sibling Supreme forever!"
  },
  {
    "input": "Twilight Sparkle: For-ev-er...",
    "output": "Shining Armor: But! If you fail, I keep the crown."
  },
  {
    "input": "Twilight Sparkle: Deal! Wait. Are you sure this counts? Mom and Dad aren't giving us any stars.",
    "output": "Princess Celestia: I will represent their authority. And thank you, Twilight. Your help will reveal if there are any holes in our security."
  },
  {
    "input": "Twilight Sparkle: So that's what we're up against.",
    "output": "Applejack: Whew. That's a barrel and a half of obstacles. Plus a bushel and a peck of impenetrability."
  },
  {
    "input": "Twilight Sparkle: It's more than that! Okay, it's exactly that. And to protect Celestia's castle!",
    "output": "Fluttershy: If it means that much to you, Twilight, we're in."
  },
  {
    "input": "Twilight Sparkle: We play to our strengths and defeat all of the security measures. That way, if one of us fails, the others will still have a shot at getting the crown. Pinkie, you'll distract the guards with a surprise party.",
    "output": "Pinkie Pie: Yes, sir, Twilight, sir!"
  },
  {
    "input": "Twilight Sparkle: Applejack, you'll buck your way into the sealed tunnels. Rainbow Dash, if anypony can outfly those wind turbines, it's you. Rarity, you'll sew us guard costumes so we can sneak past security. Then Fluttershy will disable the throne room alarm by charming the geese.",
    "output": "Spike: It's from Shining Armor. \"Dear Twily, hope your idea isn't just...\" Tunnels? He guessed your whole plan!"
  },
  {
    "input": "Twilight Sparkle: What?! Pinkie party, Rarity costumes... \"Signed, the future Sibling Supreme\"?! Oh, come on!",
    "output": "Rarity: Twilight, darling, nopony knows you better than your own brother."
  },
  {
    "input": "Twilight Sparkle: So you're saying I should give up?",
    "output": "Rarity: I'm saying your brother will win. No matter how brilliant your plan is, no matter how many variations you try, it will be something your brother expects, and he'll always win! Unless... when the perfect chance comes along, you do something he can't expect. Then you'll win."
  },
  {
    "input": "Twilight Sparkle: I didn't know you had an alter ego. And why would she be giving a farewell performance?",
    "output": "Applejack: Well, it's a long story."
  },
  {
    "input": "Twilight Sparkle: Mm-mm. I guess I'm the only one left that still needs a plan.",
    "output": "Rarity: Oh, no, darling. That is the plan. You shall do nothing!"
  },
  {
    "input": "Twilight Sparkle: Nope. Just looking at the flowers.",
    "output": "Shining Armor: Right."
  },
  {
    "input": "Twilight Sparkle: Ooh! Maybe Rarity's plan will work!",
    "output": "Pinkie Pie: Canterlot! We have a problem!"
  },
  {
    "input": "Twilight Sparkle: Where's Spike and Fluttershy? Did they make it into the castle?",
    "output": "Pinkie Pie: They jumped out right before the balloon went but that's all I could see without being in space, where I didn't get to go!"
  },
  {
    "input": "Twilight Sparkle: Let's hope Rarity and Rainbow Dash had better luck.",
    "output": "Rarity: What's this? Closed?!"
  },
  {
    "input": "Twilight Sparkle: We should have heard by now! Something must have gone wrong!",
    "output": "Pinkie Pie: Probably several somethings."
  },
  {
    "input": "Twilight Sparkle: No lookout, no distraction, and no word from the ponies inside! I'm starting to think this whole operation might be a giant flop!",
    "output": "Fluttershy: Oh, no!"
  },
  {
    "input": "Twilight Sparkle: What are you all doing out here?",
    "output": "Rarity: In retrospect, our plan might have been too unexpected."
  },
  {
    "input": "Twilight Sparkle: Every part of it failed?! Oh, now I'll never get the crown!",
    "output": "Spike: Maybe we should go back to doing things the Twilight way."
  },
  {
    "input": "Twilight Sparkle: You mean the totally expected way?",
    "output": "Spike: It may not be a surprise, but you have a pretty good record for planning things."
  },
  {
    "input": "Twilight Sparkle: Then I guess it's worth a try. Thanks, Spike.",
    "output": "Spike: What are little brothers for?"
  },
  {
    "input": "Twilight Sparkle: Okay! You all know what to do!",
    "output": "Rarity: At least one part of our expected plan worked unexpectedly."
  },
  {
    "input": "Twilight Sparkle: That's why I brought a specialist.",
    "output": "Rarity: Next shift. You're on break."
  },
  {
    "input": "Twilight Sparkle: All I have to do now is fly over and take the crown, and I'll be Sibling Supreme forever!",
    "output": "Shining Armor: Not exactly."
  },
  {
    "input": "Twilight Sparkle: Oh, come on!",
    "output": "Shining Armor: Gotta admit, it was unexpected for you to do everything exactly how I thought you would. But you should know by now there's no way to beat the true Sibling Surpreme!"
  },
  {
    "input": "Twilight Sparkle: Spike?!",
    "output": "Shining Armor: How in Equestria did you do it?!"
  },
  {
    "input": "Twilight Sparkle: The true Sibling Supreme. Spike.",
    "output": "Spike: Huh?"
  },
  {
    "input": "Twilight Sparkle: Are you all right?",
    "output": "Derpy: We just had a really heavy delivery today."
  },
  {
    "input": "Twilight Sparkle: Thank you.",
    "output": "Derpy: You're welcome!"
  },
  {
    "input": "Twilight Sparkle: Huh. It's from Princess Celestia.",
    "output": "Spike: So is this. Really? She couldn't have put it into the box?"
  },
  {
    "input": "Twilight Sparkle: \"My dearest Twilight, I have been conducting a thorough cleaning of the castle, and I came across a few items of yours in your old room. I thought you might want them back.\" I didn't even know I'd left anything! Awww, look! Remember this? It's the macaroni picture frame Cadance helped me make when I was a filly!",
    "output": "Spike: Who could forget a masterpiece like that?"
  },
  {
    "input": "Twilight Sparkle: My G1 Star Swirl figure! And some of my favorite school scrolls! And here's my extra extra credit report on \"The Impediments of Using Magic in Everyday Chores\"! Ha! Still so true!",
    "output": "Spike: Is my Smash Fortune comic in there? I've been looking for that for years. Whoa, whoa!"
  },
  {
    "input": "Twilight Sparkle: Oh, no! Oh, no! Oh, no!",
    "output": "Spike: What's wrong? It just looks like an old library book."
  },
  {
    "input": "Twilight Sparkle: You don't understand, Spike! I have a perfect library book return record!",
    "output": "Spike: Had a perfect record."
  },
  {
    "input": "Twilight Sparkle: I've never turned in a book even a minute late! And this one has been overdue since I left for Ponyville!",
    "output": "Dusty Pages: Make sure you bring this one back on time. We've got a long waiting list of ponies who can't wait to read it."
  },
  {
    "input": "Twilight Sparkle: I promise I won't let you down!",
    "output": "Dusty Pages: Oh, of course, you won't, dear. If there's anypony I can trust to take care of a book, it's you, Twilight Sparkle. After all, you still hold the \"Best Book Borrower\" title."
  },
  {
    "input": "Twilight Sparkle: Spi-ike! Quick, find me that old copy of Predictions and Prophecies. What's that for?",
    "output": "Spike: Well, it was a gift for Moon Dancer, but..."
  },
  {
    "input": "Twilight Sparkle: And then Celestia sent me to Ponyville, and I forgot all about this! Dusty Pages prided herself that no books were damaged or lost on her watch, and I failed her! I failed myself!",
    "output": "Spike: I take it we're going to Canterlot?"
  },
  {
    "input": "Twilight Sparkle: Yes. But what if somepony sees me in there? I'm the Princess of Friendship. Everywhere I go, ponies recognize me. I'll stick out like a sore hoof.",
    "output": "Spike: Princess Twilight Sparkle in a library? Stop the presses!"
  },
  {
    "input": "Twilight Sparkle: A late book is a big deal, Spike. What if Dusty Pages revokes my library card? Or bans me from ever entering the building again?!",
    "output": "Spike: Don't you already have most of those books in your collection at home?"
  },
  {
    "input": "Twilight Sparkle: Yes, but the ones in there have a special Canterlot Library-y smell!",
    "output": "Spike: You sniff books?"
  },
  {
    "input": "Twilight Sparkle: You don't? I used to live in a library. If I'm not a good example of proper book borrowing behavior, then what kind of princess am I?",
    "output": "Spike: One that makes mistakes like everypony else. Trust me. Once you return that book, you'll feel way better."
  },
  {
    "input": "Twilight Sparkle: I have a book to return.",
    "output": "Librarian Pony: Princess Twilight! So good to see you!"
  },
  {
    "input": "Twilight Sparkle: But I do need to speak with Dusty Pages about a... sensitive matter.",
    "output": "Librarian Pony: Dusty who?"
  },
  {
    "input": "Twilight Sparkle: Dusty Pages? The head librarian? She's worked here forever.",
    "output": "Librarian Pony: I'm sorry, princess. I don't know her. Now, was there some other way I can help the library's Best Book Borrower?"
  },
  {
    "input": "Twilight Sparkle: Not to me it doesn't! Fine. Fine! Oh, no! I didn't even think about the late fine! A book out this long will probably cost a thousand bits!",
    "output": "Spike: She— I mean, we have an overdue book."
  },
  {
    "input": "Twilight Sparkle: Don't pull any punches with those names, do you?",
    "output": "Spike: And that office would be...?"
  },
  {
    "input": "Twilight Sparkle: Nopony except undependable rule-breakers who deserve all the horrors this hallway holds!",
    "output": "Spike: And faithful dragon companions. Uh... hey! It looks like First Folio left a note on the door!"
  },
  {
    "input": "Twilight Sparkle: \"Abandon hope, all ye who enter\"?",
    "output": "Spike: \"Out to lunch on Restaurant Row.\" Guess we'll have to try back later!"
  },
  {
    "input": "Twilight Sparkle: No! I can't wait another minute to return this book! In the time it took us to get there, I racked up another... seventeen bits in late fees! We're going to lunch!",
    "output": "Spike: Good, 'cause I'm starving!"
  },
  {
    "input": "Twilight Sparkle: Tell me if you see any librarian-type ponies.",
    "output": "Spike: Twilight, we tried this at three other restaurants already!"
  },
  {
    "input": "Twilight Sparkle: And my late fines are already up another twenty-six more bits!",
    "output": "Pretzel: Waiter, we're ready to order."
  },
  {
    "input": "Twilight Sparkle: Moon Dancer! How've you been? I'm just visiting. No real reason. Heh.",
    "output": "Moon Dancer: Well, it's good to see you! I'm just meeting my friend, First Folio, for lunch. Do you want to join us?"
  },
  {
    "input": "Twilight Sparkle: First Folio?! Yes! I mean, thank you.",
    "output": "First Folio: Princess Twilight, good to meet you! Did you know your picture is still up in our library as the Best Book Borrower?"
  },
  {
    "input": "Twilight Sparkle: Yeah... I was hoping I could talk to Dusty Pages about that.",
    "output": "Moon Dancer: Oh, Dusty Pages left the library moons ago. Didn't you know?"
  },
  {
    "input": "Twilight Sparkle: Mm-mm.",
    "output": "First Folio: Oh, I heard she was forced to leave. It's so sad. She loved the library."
  },
  {
    "input": "Twilight Sparkle: Wait. Forced to leave?",
    "output": "First Folio: Yuh-huh, uh-huh, yeah. She had a perfect librarian record. Until one careless pony didn't return a book, ruined it all."
  },
  {
    "input": "Twilight Sparkle: Uh-huh. Would, uh, you excuse me?",
    "output": "Spike: That's why you only order spicy if you can take it. Twilight, what's wrong?"
  },
  {
    "input": "Twilight Sparkle: Dusty Pages isn't working at the library any more because I didn't return this book! Spike, I think I got her fired!",
    "output": "Spike: Twilight, the library is that way!"
  },
  {
    "input": "Twilight Sparkle: Change of plans. We're going to Dusty's house. She used to invite me over for tea all the time.",
    "output": "Spike: But what about your late fees?"
  },
  {
    "input": "Twilight Sparkle: They're not as important as making things right.",
    "output": "Spike: Wait. So you're not going to return the book?"
  },
  {
    "input": "Twilight Sparkle: No. Dusty Pages is. It's my fault she lost her job. So if I give her the book, she can get her old job back. It'll fix everything!",
    "output": "Meathead Pony: Didn't you see the sign? No salesponies!"
  },
  {
    "input": "Twilight Sparkle: Oh, I'm not selling anything.",
    "output": "Meathead Pony: No carolers either. No surveys, no petitions, no free literature..."
  },
  {
    "input": "Twilight Sparkle: No problem. I'm just looking for somepony who used to live here. I'm pretty sure this was her house.",
    "output": "Meathead Pony: Dusty Pages?"
  },
  {
    "input": "Twilight Sparkle: Yes!",
    "output": "Meathead Pony: Hold on. She moved to... Silver somethin'. Shoals, Seas, Surfer, whatever. When you find her, give her this."
  },
  {
    "input": "Twilight Sparkle: \"Silver Stable Community: For the best golden years.\" This has to be it!",
    "output": "Spike: I hope so. It's the last \"Silver\" spot on the map we haven't looked."
  },
  {
    "input": "Twilight Sparkle: Poor Dusty... Excuse me!",
    "output": "\"Teddie Safari\": Yes, how may I help you?"
  },
  {
    "input": "Twilight Sparkle: Do you have a resident named Dusty Pages?",
    "output": "\"Teddie Safari\": Oh, yes. Her apartment is in the next complex, ground floor."
  },
  {
    "input": "Twilight Sparkle: I can't believe that my carelessness sent her here, when she could be happily surrounded by millions of wonderful-smelling books!",
    "output": "Spike: You realize that might just be a you thing, right?"
  },
  {
    "input": "Twilight Sparkle: There she is! Here we go.",
    "output": "Spike: She's bound to be back soon. Maybe we should just wait here."
  },
  {
    "input": "Twilight Sparkle: Sorry to interrupt your plein air painting, but we're looking for Dusty Pages. Have you seen her?",
    "output": "Apple Rose: Sure have!"
  },
  {
    "input": "Twilight Sparkle: And...?",
    "output": "Apple Rose: She had to leave early to get to her fengbi de ti session."
  },
  {
    "input": "Twilight Sparkle: Thank you!",
    "output": "Spike: Wow. Dusty sounds like one busy pony."
  },
  {
    "input": "Twilight Sparkle: Dusty Pages, finally! Come on, Spike!",
    "output": "Spike: Wait. She looks pretty happy up there."
  },
  {
    "input": "Twilight Sparkle: Care to take five, everypony?",
    "output": "Dusty Pages: Ah! Twilight Sparkle?! My stars! It's so wonderful to see you! What are you doing here?"
  },
  {
    "input": "Twilight Sparkle: I need to tell you something.",
    "output": "Dusty Pages: Well, you brought my mail! Oh, thank you!"
  },
  {
    "input": "Twilight Sparkle: No. I mean, yes, we did, but that's not why we're here. I let you down, and I can't forgive myself until I set things right.",
    "output": "Dusty Pages: I don't remember you doing anything wrong."
  },
  {
    "input": "Twilight Sparkle: You told me to take care of a special book I checked out from the Canterlot Library, and I never brought it back!",
    "output": "Dusty Pages: It was you that had that book out? The one that broke my perfect record?"
  },
  {
    "input": "Twilight Sparkle: But now you can bring it to Canterlot Library and get your job back!",
    "output": "Dusty Pages: No, thank you! I don't ever need to see that library again! Now, if you'll excuse me, I have somewhere to be."
  },
  {
    "input": "Twilight Sparkle: I don't understand. If Dusty Pages won't go back to Canterlot Library and explain everything, then she won't be able to get her job back. Even worse, her record will remain imperfect!",
    "output": "Spike: And yours will, too?"
  },
  {
    "input": "Twilight Sparkle: Well, yeah! But that doesn't matter any more!",
    "output": "Spike: Really?"
  },
  {
    "input": "Twilight Sparkle: Well, maybe a little bit. Oh, no, bits! The late fines! How much do I owe now?!",
    "output": "Spike: Uhhh... you don't wanna know."
  },
  {
    "input": "Twilight Sparkle: It would've been worth all the bits in Equestria if I had made things right with Dusty! I wish I knew why she won't go back!",
    "output": "Spike: Why don't you ask her?"
  },
  {
    "input": "Twilight Sparkle: She didn't seem to want to talk.",
    "output": "Spike: You surprised her, and she probably had something else on her schedule. That thing is packed! Come on. What have you got to lose?"
  },
  {
    "input": "Twilight Sparkle: A squishy fruit food-fight tournament?!",
    "output": "Spike: Hey, everypony! We come in—"
  },
  {
    "input": "Twilight Sparkle: Stop! We just want to talk to Dusty Pages for a moment! Please?",
    "output": "Dusty Pages: Time out! Next time, you should rent gear."
  },
  {
    "input": "Twilight Sparkle: I was hoping you'd give me another chance to talk to you about the library book.",
    "output": "Dusty Pages: This really means a lot to you, doesn't it?"
  },
  {
    "input": "Twilight Sparkle: Mm-hmm. I know I ruined your life by not returning my book on time, and I will do anything I can to make it up to you. Even promise to never take a book out of a library again, if that's what it takes.",
    "output": "Spike: That is not the reaction we expected."
  },
  {
    "input": "Twilight Sparkle: You're not?",
    "output": "Dusty Pages: No! If I'm mad at anypony, it's me."
  },
  {
    "input": "Twilight Sparkle: What was it?",
    "output": "Dusty Pages: Freedom."
  },
  {
    "input": "Twilight Sparkle: You mean you weren't fired? You left the library because you wanted to?",
    "output": "Dusty Pages: Twilight, your late book was the best thing that ever happened to me. Now I'm not afraid to try things I might fail at. In fact, sometimes messing up teaches me more than getting it right!"
  },
  {
    "input": "Twilight Sparkle: You're sure you don't want to return it and get that perfect record back?",
    "output": "Dusty Pages: Ah, good. It was a yellow one. You can still see the words."
  },
  {
    "input": "Twilight Sparkle: But it'll have a stain!",
    "output": "Dusty Pages: That doesn't change the truth inside it. Wait. Did you even read that thing?"
  },
  {
    "input": "Twilight Sparkle: \"Perfection\".",
    "output": "Dusty Pages: And the next part?"
  },
  {
    "input": "Twilight Sparkle: Oh. That might've been useful to look at earlier.",
    "output": "First Folio: Uh-huh... Your total late fees come to..."
  },
  {
    "input": "Twilight Sparkle: However much it is, I'll cover it. Uh, do you have a monthly payment plan?",
    "output": "First Folio: Twenty-eight bits."
  },
  {
    "input": "Twilight Sparkle: Okay. Letting the perfection go. You want me to reshelve this for you?",
    "output": "First Folio: No, it's an old edition. We've already replaced it with a new copy."
  },
  {
    "input": "Twilight Sparkle: That's what makes it perfect.",
    "output": "Announcer: Highlights in the world of sports! Buckball fever has swept Equestria! What started as a backyard hobby for fruit farmers and the like has blossomed into a literal phenomenon, with something for everypony. Unicorns, Pegasi, and Earth ponies alike can't get enough of this breakthrough sport."
  },
  {
    "input": "Twilight Sparkle: I won't keep you in suspense any longer. We're bringing one of Ponyville's oldest traditions to our school – the Fetlock Fete.",
    "output": "Smolder: The what-lock what?"
  },
  {
    "input": "Twilight Sparkle: You don't need to do that, Ocellus. This year, the event's at school and open to everycreature. We're calling our dance the Amity Ball.",
    "output": "Ocellus: Even better!"
  },
  {
    "input": "Twilight Sparkle: And we'll have all the old Fetlock Fete traditions – the Pony Pal Contest, the lucky pot dinner. You'll love it! So, like this says, \"get your pony pal and come along.\"",
    "output": "Smolder: Want to go? I've got nothing better to do."
  },
  {
    "input": "Twilight Sparkle: Now, who wants to help me hang more posters?",
    "output": "Silverstream: Me!"
  },
  {
    "input": "Twilight Sparkle: So, Spike...",
    "output": "Spike: Uh, Scales-n-Tail?"
  },
  {
    "input": "Twilight Sparkle: Uh, right. Scales-n-Tail. Let's get this party started!",
    "output": "Spike: Oh, yeah, party ponies! It's time to raise the roof and stomp your hoof for the traditional first dance of the night, the Pony Cotillion!"
  },
  {
    "input": "Twilight Sparkle: And that's why we're giving you this.",
    "output": "Sandbar''' and '''Yona: Huh?"
  },
  {
    "input": "Twilight Sparkle: From now on, it's the annual Amity Ball Award for Friendship!",
    "output": "Applejack: No pony-ness required."
  },
  {
    "input": "Twilight Sparkle: Congratulations, you two!",
    "output": "Spike: Yona! I'm glad you're back! Everypony wants to learn that crazy dance you did!"
  },
  {
    "input": "Twilight Sparkle: Mm-hmm. You can make it up tomorrow.",
    "output": "Smolder: Actually, I'll be gone for a week."
  },
  {
    "input": "Twilight Sparkle: A week?! In the middle of the semester?",
    "output": "Fluttershy: Oh, is everything all right, Smolder?"
  },
  {
    "input": "Twilight Sparkle: I'm sorry to hear about your brother, Smolder. But the Dragon Lands are really far for you to go by yourself. And I'm not sure about you missing so much class.",
    "output": "Spike: Hey! What if she got a school credit for it? Kind of like a... a kindness field trip? I'll go with her."
  },
  {
    "input": "Twilight Sparkle: Fine. But I'm gonna expect a full report when you get back.",
    "output": "Smolder: How many pages?"
  },
  {
    "input": "Twilight Sparkle: I was talking to Fluttershy. Hatching season sounds fascinating!",
    "output": "Spike: Okay, I made a list of what cheers me up when I'm down, so if your brother's like me, he's gonna love it! What should we do first? The Smile Song? The sharing circle? Or friendship bracelet weaving?"
  },
  {
    "input": "Twilight Sparkle: Remind me how this happened again!",
    "output": "Applejack: And why there's a giant turtle eatin' my family's entire summer crop!"
  },
  {
    "input": "Twilight Sparkle: Applejack and Pinkie, you distract him! Rainbow Dash, Rarity, and Fluttershy, let's save Spike!",
    "output": "Fluttershy: Mr. Tortoise-Snap, I'm only asking nicely once! Let my friend go!"
  },
  {
    "input": "Twilight Sparkle: And now, a simple teleportation spell should—",
    "output": "Princess Celestia: Halt, interloper!"
  },
  {
    "input": "Twilight Sparkle: That's just what I was about to do!",
    "output": "Princess Luna: Goodness, sister! That was fun!"
  },
  {
    "input": "Twilight Sparkle: Maybe the princesses changed their minds. Maybe they don't think we're up to the responsibility of protecting Equestria after all!",
    "output": "Spike: Or maybe this week's just a one-time thing that'll never happen again."
  },
  {
    "input": "Twilight Sparkle: Great. But is something wrong? It's just... You've been helping us an awful lot, and we know you have way more important ruler-y things to do, so...",
    "output": "Princess Luna: We've spent more than enough time in the throne room. Real life is happening out here."
  },
  {
    "input": "Twilight Sparkle: Wait. That's what this is about? You're sick of being princesses?",
    "output": "Princess Celestia: Not exactly. Battling the Everfree Forest alongside Star Swirl made us realize what we've missed out on. So, instead of spending the day ruling..."
  },
  {
    "input": "Twilight Sparkle: Don't worry. We'll cover your palace duties. It'll be a good chance for us to practice for when you retire.",
    "output": "Princess Luna: Well, if you're sure you don't mind the extra effort."
  },
  {
    "input": "Twilight Sparkle: If it's written down, I'm sure we can handle it. Have fun!",
    "output": "Princess Luna: One more thing. We're leaving you in charge of raising the sun and moon while we're gone."
  },
  {
    "input": "Twilight Sparkle: We won't let you down, princesses. Please tell me that scroll says what the the Royal Swanifying is.",
    "output": "Spike: Apparently it's a celebration of all the swans in the royal lake. We round them up, parade them through the streets, and finish with a party in the castle."
  },
  {
    "input": "Twilight Sparkle: It doesn't matter. This is our chance to show Celestia and Luna we'll do whatever the job requires. If they can take care of all this themselves, then I know we can. Together.",
    "output": "Fluttershy: Um... hmm."
  },
  {
    "input": "Twilight Sparkle: Thank you, but we have it all covered.",
    "output": "Fancy Pants: Reeeeeally? Well, good luck with that."
  },
  {
    "input": "Twilight Sparkle: If we ask for help, it's just like admitting we're not as good at the job as Luna and Celestia are. Besides, how hard can throwing a swan party be?",
    "output": "Pinkie Pie: Yeah! All we have left to do is polish the armor, bubble the punch, glitter the carpet, puff the pastry, float the floats, and carpet every road in Canterlot! Should I keep reading?"
  },
  {
    "input": "Twilight Sparkle: There's not enough in the castle kitchens to—",
    "output": "Fancy Pants: Don't tell me. Tell him."
  },
  {
    "input": "Twilight Sparkle: Thank you for your constructive criticism. But we really don't have time to chat, so...",
    "output": "Princess Celestia: Well, I hope you're enjoying yourself on your super-relaxing picnic, sister."
  },
  {
    "input": "Twilight Sparkle: How does Celestia and Luna rule a kingdom and get all this done by themselves every year?!",
    "output": "Fancy Pants: Oh, how droll."
  },
  {
    "input": "Twilight Sparkle: They don't?",
    "output": "Fancy Pants: Oh, goodness, no. That's what the gala planning committees are for. Nopony could handle all this. Are those... sequins?"
  },
  {
    "input": "Twilight Sparkle: Ooh! New plan, everypony! We're going to delegate!",
    "output": "Rainbow Dash: You! You're on food duty!"
  },
  {
    "input": "Twilight Sparkle: So this is how you rule Equestria!",
    "output": "Princess Luna: Things are so much more relaxing without my bossy sister."
  },
  {
    "input": "Twilight Sparkle: Does anypony have some tape?!",
    "output": "Rainbow Dash: I thought Pinkie Pie said to get here right away."
  },
  {
    "input": "Twilight Sparkle: Uh, Pinkie? You said you had something important to tell us.",
    "output": "Pinkie Pie: Not telling so much as showing. In fact, what you're about to see may shake the very foundations of your perception for all time!"
  },
  {
    "input": "Twilight Sparkle: I think Applejack's asking about the part about Cheese Sandwich and your life's purpose.",
    "output": "Pinkie Pie: Oh, that. Yeah. It's just... All of you have found your thing. You're gonna rule all of Equestria, Rainbow Dash is a Wonderbolt, Fluttershy has her animal sanctuary, Rarity has her boutiques, Applejack has the hat... And the farm! So that's like... two things! I don't even have one. When I first got Cheese's invite, I was a little jealous. It felt like even he was moving on to bigger and better things. And everypony was leaving me behind. But then I realized Cheese Sandwich is a party pony just like me. If he figured out his purpose, he can help me figure out mine."
  },
  {
    "input": "Twilight Sparkle: I think talking to Cheese Sandwich is a great idea. But the only pony who can really find your life's purpose is you.",
    "output": "Pinkie Pie: I know, silly. That's why I'm going to visit Cheese Sandwich's factory so I can ask him to help me."
  },
  {
    "input": "Twilight Sparkle: Well, that sounds like quite a trip!",
    "output": "Fluttershy: And Cheese Sandwich just left his own factory?"
  },
  {
    "input": "Twilight Sparkle: I have to admit I was a little shocked when Princess Celestia told me she wanted to start a scholastic buckball league. But I was even more surprised that she wanted the first game to be between her school and ours! Apparently, she's a huge sports fan.",
    "output": "Pinkie Pie: Always thought Celestia was kind of a jock, just with really wavy hair."
  },
  {
    "input": "Twilight Sparkle: I know how you feel. Young athletes ready to take the field. Ooh, you could almost breathe in the excitement!",
    "output": "Snails: I don't think you should breathe it in so hard."
  },
  {
    "input": "Twilight Sparkle: Relax. You're gonna do just fine.",
    "output": "Fluttershy: Um, what makes you so sure?"
  },
  {
    "input": "Twilight Sparkle: Because I have faith in my friends, who also happen to be the best buckball players in Equestria!",
    "output": "Pinkie Pie: Oh, yeah!"
  },
  {
    "input": "Twilight Sparkle: I asked Rainbow Dash to help, too. But I'm not sure when she—",
    "output": "Rainbow Dash: Sorry I'm late! But when Twilight said she needed my help with the buckball team, I figured I'd better grab every piece of coaching equipment I could find! So what should I focus on? Offense? Defense? Trick plays?"
  },
  {
    "input": "Twilight Sparkle: I was thinking of something even more important.",
    "output": "Rainbow Dash: Awesome! Lay it on me. Whatever it is, I'll give it a hundred and twenty percent!"
  },
  {
    "input": "Twilight Sparkle: I knew I could count on your enthusiasm! That's why I want you to coach the cheer squad!",
    "output": "Rainbow Dash: Cheerleading?!"
  },
  {
    "input": "Twilight Sparkle: The cheer squad is important.",
    "output": "Rainbow Dash: Oh. Well, sure, cheer squad is totally important to somepony who isn't me. But I'm more about ponies playing in the game, not cheering for it."
  },
  {
    "input": "Twilight Sparkle: Hmmm. Well, maybe this will be a good opportunity for you to find out.",
    "output": "Rainbow Dash: Of course I've seen cheer squads before – on the sidelines – but I'm not even a hundred percent sure what they do. I'll probably just mess it up."
  },
  {
    "input": "Twilight Sparkle: I think you might be surprised. In fact, I'm more sure than ever that you're the perfect choice.",
    "output": "Snips: I'm actually one hundred and twenty percent sure. And it's a good thing, too. The cheer squad really needs you."
  },
  {
    "input": "Twilight Sparkle: Yahoo!",
    "output": "Princess Celestia: I realize the game of buckball traditionally requires an Earth pony, a Pegasus, and a unicorn, but I appreciate you allowing my students to compete."
  },
  {
    "input": "Twilight Sparkle: Of course, and the wings and magical-dampening ring you made seem to be working really well.",
    "output": "Princess Celestia: Indeed, though not as well as your team. COME ON, SCHOOL OF MAGIC!"
  },
  {
    "input": "Twilight Sparkle: Wow, Rainbow Dash! It's almost like you were the perfect pony to coach cheer squad after all!",
    "output": "Rainbow Dash: Wait a second. Was this one of those things where you knew the lesson I needed to learn before I learnt it?"
  },
  {
    "input": "Twilight Sparkle: You mean like how you don't have to care about a thing other ponies like as long as you care about the ponies who like it? Nope. Don't know what you're talking about.",
    "output": "Rainbow Dash: Ugh!"
  },
  {
    "input": "Twilight Sparkle: ...going to bed! Brains need eight hours of sleep to perform at optimum levels!",
    "output": "Spike: Oh. Cool. I thought I'd have to force you to go to bed since tomorrow is your chance to be the first pony to win Ponyville Trivia three times in a row. That is tomorrow, right?"
  },
  {
    "input": "Twilight Sparkle: ...yes! Ask me another one.",
    "output": "Spike: Another what?"
  },
  {
    "input": "Twilight Sparkle: Another question! I want to stay in the zone. That way, I can sleep in the zone! Wake up in the zone! And be totally in the zone tomorrow!",
    "output": "Spike: Uh, this is a whole new level of \"Twilight-ing\", isn't it? Heh."
  },
  {
    "input": "Twilight Sparkle: ...yes!",
    "output": "Spike: Are you okay?"
  },
  {
    "input": "Twilight Sparkle: ...yes!",
    "output": "Spike: Well, good night, Twilight. Good luck with your brain sleep and getting that third win."
  },
  {
    "input": "Twilight Sparkle: ...good night! And yes!",
    "output": "Spike: That wasn't a question."
  },
  {
    "input": "Twilight Sparkle: I'm glad you decided to come watch your first Trivia Trot, Spike. I hope the rules aren't too confusing.",
    "output": "Spike: Rules? Isn't trivia just asking questions and answering them?"
  },
  {
    "input": "Twilight Sparkle: \"...participating in Trivia Trot.\" And that wraps up rule forty-one point six. Of course, the exception to that – rule forty-one point six A – is interesting itself because—",
    "output": "Spike: Oh, look! We're here!"
  },
  {
    "input": "Twilight Sparkle: Ooh! I can't wait to see who my partner's gonna be!",
    "output": "Spike: You don't get to pick your own team?"
  },
  {
    "input": "Twilight Sparkle: Rule twenty point one six B, Spike. To keep things fair, the teams are randomly selected.",
    "output": "Spike: Twenty point one six B. How could I forget?"
  },
  {
    "input": "Twilight Sparkle: And based on the regular attendees, I've charted every potential teammate's strengths and weaknesses, plus my percentage of winning with each one!",
    "output": "Spike: Ha! I knew there'd be a chart! Glad I'm just watching. I don't think I could handle being your teammate. What if I let you down?"
  },
  {
    "input": "Twilight Sparkle: You could never let me down, Spike. But I'm glad you're watching, too. I'm going to need all the support I can get for win number three!",
    "output": "Applejack: Well, well, well, if it ain't our reignin' champ. Think you can win again this week, Twilight?"
  },
  {
    "input": "Twilight Sparkle: Everypony here has a different area of expertise, so it really is anypony's game. But yes!",
    "output": "Rainbow Dash: Then you better hope you get paired with me, because I am gonna rule this game!"
  },
  {
    "input": "Twilight Sparkle: Rule thirty-seven point two C. No back-to-back categories. But I think Fluttershy was joking.",
    "output": "Pinkie Pie: Sure sounded like a joke to me! Woo-hoo!"
  },
  {
    "input": "Twilight Sparkle: Pinkie Pie?!",
    "output": "Pinkie Pie: Present!"
  },
  {
    "input": "Twilight Sparkle: I hadn't anticipated Pinkie Pie as a potential player! She's never played before! My chart is completely off! I have no way to predict what'll happen, and unpredictable is not good for a Trivia Trot three-peat!",
    "output": "Spike: Do I have to do that thing where I list all your successes as Princess of Friendship to put things into perspective and remind you this is just a game?"
  },
  {
    "input": "Twilight Sparkle: Spike! This has nothing to do with being the Princess of Friendship! And this is not just a game! This! Is! Trivia Trot!",
    "output": "Granny Smith: Okay, settle down, everypony. I'm fixin' to pick these here teams."
  },
  {
    "input": "Twilight Sparkle: It's starting! I have to reevaluate my chart! Spike, I need you to find the part on matchups! Can you look outside?",
    "output": "Spike: What'd I miss?"
  },
  {
    "input": "Twilight Sparkle: Granny's about to call out the fifth team. Sunburst gave me the highest chance of winning, but he's been paired with Cranky Doodle!",
    "output": "Cranky Doodle Donkey: What? Who's that?"
  },
  {
    "input": "Twilight Sparkle: And apart they'll spend all their energy trying to one-up each other, so that only helps my chances.",
    "output": "Bulk Biceps: Let's do this! Yeah!"
  },
  {
    "input": "Twilight Sparkle: Eh, not every team is a threat, but there aren't many ponies left.",
    "output": "Granny Smith: All righty, hold on to your horseshoes, 'cause the next pair of players is... Maud and Mudbriar!"
  },
  {
    "input": "Twilight Sparkle: Oh, no! According to my calculations, the only pony who could really threaten my winning streak is...!",
    "output": "Granny Smith: And our final pair of contestants for this week's Trivia Trot is... Twilight and Pinkie Pie!"
  },
  {
    "input": "Twilight Sparkle: Yeah. Great.",
    "output": "Spike: So, I'm guessing the one pony who could mess up your winning streak is Pinkie?"
  },
  {
    "input": "Twilight Sparkle: Pinkie, I'm glad you're excited, but tonight's game is special. I could be the first pony ever to win three consecutive Trots in a row. And I'm really hoping I do.",
    "output": "Pinkie Pie: You don't have anything to worry about. I'll do everything I can to be the bestest and most funnest teammate ever."
  },
  {
    "input": "Twilight Sparkle: I know I can. Pinkie might not be the partner I expected, but I can coach her along. And besides, I'm pretty good at this game. If she misses a few, I'm sure I can pick up the slack.",
    "output": "Pinkie Pie: Let's get this party started!"
  },
  {
    "input": "Twilight Sparkle: Ooh! A category about books! We're off to a great start!",
    "output": "Granny Smith: Who is the pony that despises the holiday season in the old classic A Hearth's Warmin' Tale?"
  },
  {
    "input": "Twilight Sparkle: It's fine, Pinkie. But maybe it'll help our chances if I coach you as we go. Tip one – try sitting still.",
    "output": "Pinkie Pie: Can do, Coach Twilight—"
  },
  {
    "input": "Twilight Sparkle: And don't get distracted. Or be distracting. Oh, and remember to listen carefully. Also, it's best to keep quiet between questions.",
    "output": "Pinkie Pie: Got it."
  },
  {
    "input": "Twilight Sparkle: Pinkie!",
    "output": "Pinkie Pie: What?!"
  },
  {
    "input": "Twilight Sparkle: Okay, Pinkie. Remember, the category is \"Apples\". Keep your mind on apples.",
    "output": "Pinkie Pie: Apples, apples, apples, apples... Ooh, and oranges. And grapes! And strawberries. Strawberry cupcakes! I'm hungry."
  },
  {
    "input": "Twilight Sparkle: Come on, Pinkie, you know this one. Mysterious apples? Only around for five days?",
    "output": "Pinkie Pie: Quiet down there. Pretty sure there's a rule against tummies ringing in."
  },
  {
    "input": "Twilight Sparkle: Spike! I don't think I can coach Pinkie well enough for us to get my three-peat! I don't want her to feel bad! She's trying so hard, but I might have to start answering everything myself!",
    "output": "Pinkie Pie: Look, Twilight! No more belly growl interruptions for Team Twi-Pie!"
  },
  {
    "input": "Twilight Sparkle: Or... I should look at how everypony else is playing.",
    "output": "Granny Smith: Hope you're all in your seats 'cause the break is over, and it is time for more questions. Let me see, uh... How do you say \"reward\" in Olde Ponish?"
  },
  {
    "input": "Twilight Sparkle: Sunburst's partner is sleeping. And according to rule fifty-seven point six, sleeping on the table is subject to dis-qual-i-fi-ca-tion!",
    "output": "Granny Smith: Oh, looky here. That's an actual rule. Cranky is disqualified. I'm sorry, Sunburst. Without your teammate, you can't play neither."
  },
  {
    "input": "Twilight Sparkle: Don't worry, Pinkie. We're not out of this game yet.",
    "output": "Fluttershy: Is the answer carrots?"
  },
  {
    "input": "Twilight Sparkle: Ah! Rule thirteen point two! No help from pets!",
    "output": "Applejack: Nyah!"
  },
  {
    "input": "Twilight Sparkle: Motion to establish new rule! No expressionless contestants!",
    "output": "Granny Smith: Nice try."
  },
  {
    "input": "Twilight Sparkle: Fine.",
    "output": "Granny Smith: The next category is... \"Cupcakes\"!"
  },
  {
    "input": "Twilight Sparkle: Suuuure! Just when we're finally back in the game! Why, that sounds perfect, Pinkie, but... Ooh! Isn't that a confetti appreciation parade I see?",
    "output": "Pinkie Pie: Where?!"
  },
  {
    "input": "Twilight Sparkle: Double midnight chocolate fudge with chili pepper frosting!",
    "output": "Granny Smith: Correct!"
  },
  {
    "input": "Twilight Sparkle: Sorry, Pinkie. But you were looking at the parade, and I didn't want our team to miss out on the point.",
    "output": "Pinkie Pie: I guess that makes sense, but which way did that confetti parade go anyway?"
  },
  {
    "input": "Twilight Sparkle: Bananaaaaas!",
    "output": "Granny Smith: The category is \"Sticks and Stones\"."
  },
  {
    "input": "Twilight Sparkle: I don't know anything about those! That's not any kind of category!",
    "output": "Mudbriar: Technically, it's a kind of category where we know the answers and you don't."
  },
  {
    "input": "Twilight Sparkle: Gee, Pinkie! I forgot the name of that famous rock in Griffonstone. Could you ask Maud?",
    "output": "Pinkie Pie: You got it! Hey, Maud! What's the name of the famous rock in Griffonstone?"
  },
  {
    "input": "Twilight Sparkle: I'm sorry, Pinkie. Guess I forgot about that rule.",
    "output": "Pinkie Pie: Oh, no! If I'm out, you don't have a partner! You won't be able to get your third win!"
  },
  {
    "input": "Twilight Sparkle: Actually, since there's another player who has also had his teammate disqualified...",
    "output": "Sunburst: Rule nineteen point seven B, whereby players whose teammates were disqualified may form a new team."
  },
  {
    "input": "Twilight Sparkle: Oh, we're gonna crush this round!",
    "output": "Sunburst: I don't know, Twilight. You seem out of the zone today. But don't worry. I can pick up the slack."
  },
  {
    "input": "Twilight Sparkle: What?! I am the reigning Trot champ! If there's any slack that needs picking, I'll be the up! I mean, wait...",
    "output": "Sunburst: I'm just saying you seem a little frazzled, and I do have a correct answer percentage to maintain."
  },
  {
    "input": "Twilight Sparkle: That would be Lord Tirek!",
    "output": "Mudbriar: Technically, that answer is incomplete. The answer is Lord Tirek and Scorpan."
  },
  {
    "input": "Twilight Sparkle: Look, Sunburst. I realize I may have been a little off earlier, but I'm really good at this game.",
    "output": "Granny Smith: How many holes are there in Daring Do's hat?"
  },
  {
    "input": "Twilight Sparkle: Well, I knew it, too. You're not the only pony to ever read a book, you know?",
    "output": "Sunburst: You're right, Twilight. I'm sorry. But now that I think about it, I'm not so sure about Dash's answer. Could you do a quick fact check?"
  },
  {
    "input": "Twilight Sparkle: Are you trying to get me disqualified?! What kind of pony would do that to their own teammate?!",
    "output": "Sunburst: You're right, Twilight. I don't know what got into me. I was so focused on my correct answers, I wasn't thinking straight. Can you forgive me?"
  },
  {
    "input": "Twilight Sparkle: It's okay, Sunburst. I understand. And I have a teammate of my own to apologize to. Lucky for you, Cranky's awake. And according to rule fifty-seven point six B...",
    "output": "Sunburst: Players previously disqualified for sleeping may rejoin the game. Provided they're well-rested."
  },
  {
    "input": "Twilight Sparkle: Pinkie, you were the best teammate I could ask for, but I let wanting to win keep me from seeing that.",
    "output": "Pinkie Pie: I knew you wanted to win, but I probably could have helped a little. And even if I couldn't..."
  },
  {
    "input": "Twilight Sparkle: ...we still could've had fun. I'm so sorry for not realizing it. I got so obsessed with one thing, I forgot what really mattered.",
    "output": "Pinkie Pie: No! That doesn't sound like you at all!"
  },
  {
    "input": "Twilight Sparkle: Well, win or lose, nothing is more important than my friend. Or my team. Twi-Pie forever?",
    "output": "Pinkie Pie: I-I don't know."
  },
  {
    "input": "Twilight Sparkle: I understand. I guess even the Princess of Friendship can mess things up with her friends.",
    "output": "Pinkie Pie: Oh, it's not that. It's just that I already changed it to Team Twi-Burst, and now I guess I should change it to Sun-Doodle?"
  },
  {
    "input": "Twilight Sparkle: According to rule thirteen point two, players can join the game at any time, provided they start from zero.",
    "output": "Pinkie Pie: Wow. These rules are really convoluted. But doesn't starting from zero mean we'll lose?"
  },
  {
    "input": "Twilight Sparkle: Well, our chances aren't good, but the odds of having fun on Team Twi-Pie are one hundred percent!",
    "output": "Granny Smith: What is the name of the Ponyville Day Spa's most popular candle?"
  },
  {
    "input": "Twilight Sparkle: That was a joke. I wanted to show you with the Summer Sun Celebration how much I've improved. So I focused on delegating and trusting others. It's been great!",
    "output": "Princess Luna: That's... actually what we came to talk to you about. This may be the last Summer Sun Celebration you'll need to plan."
  },
  {
    "input": "Twilight Sparkle: Did I do something wrong?",
    "output": "Princess Celestia: Of course not. It's just that the Celebration has always been about us. My defeat of Luna..."
  },
  {
    "input": "Twilight Sparkle: Now that you're...",
    "output": "Princess Celestia: My sister and I have decided. The time for us to retire is upon us. You and your friends have proven you are ready to lead Equestria. So let this be the last Summer Sun Celebration as Equestria leaves behind the old to embrace the new!"
  },
  {
    "input": "Twilight Sparkle: I'm actually fine. But if this is gonna be the last Summer Sun Celebration, I want to make sure it's the best Celebration ever!",
    "output": "Rainbow Dash: Please-don't-give-us-more-work... Please-don't-give-us-more-work... Please-don't-give-us-more-work..."
  },
  {
    "input": "Twilight Sparkle: So, even though everything was done, I thought of a few last-minute changes I could use your help with.",
    "output": "Rainbow Dash: I knew it!"
  },
  {
    "input": "Twilight Sparkle: I guess some draconequus isn't the know-it-all he thinks he is.",
    "output": "Rainbow Dash: This is it?"
  },
  {
    "input": "Twilight Sparkle: What?",
    "output": "Rainbow Dash: We were kinda with Discord on this one."
  },
  {
    "input": "Twilight Sparkle: No more crazy lists. No more freaking out. With your help, I know we've got this.",
    "output": "Discord: Character growth is so boring. Do I at least get my own note card?"
  },
  {
    "input": "Twilight Sparkle: There. Now, I need to go rewrite my speech. But if you all look at your cards, you'll see—",
    "output": "Discord: Can't talk now. Have so much to get done before sunrise."
  },
  {
    "input": "Twilight Sparkle: It's all coming together. I really think this is gonna be the best Summer Sun Celebration ever!",
    "output": "Rarity: You've done an outstanding job."
  },
  {
    "input": "Twilight Sparkle: We've all done an outstanding job!",
    "output": "Discord: And what about me? You'll be happy to know that I have been watching myself all night, and I have yet to do one \"Discord-y\" thing."
  },
  {
    "input": "Twilight Sparkle: That's... a good idea. Thank you all so much.",
    "output": "Applejack: I sure am proud o' her."
  },
  {
    "input": "Twilight Sparkle: Do about what?",
    "output": "Spike: What are you doing here?"
  },
  {
    "input": "Twilight Sparkle: I forgot these. You guys okay?",
    "output": "Applejack: Twilight, w-we're sorry, but—"
  },
  {
    "input": "Twilight Sparkle: I guess I was too organized. I'll try to come up with a few last-minute errands for you before sunrise.",
    "output": "Rainbow Dash: Well, that's a relief!"
  },
  {
    "input": "Twilight Sparkle: You two just enjoy the festivities. I have a few surprises in store for— Yes, Discord?",
    "output": "Discord: Oh, well, don't mind me. I'm just here for the chaos."
  },
  {
    "input": "Twilight Sparkle: Pinkie, is this soup?",
    "output": "Pinkie Pie: Yes! I... was really hungry?"
  },
  {
    "input": "Twilight Sparkle: What is?",
    "output": "Feather Flatterfly: That!"
  },
  {
    "input": "Twilight Sparkle: Applejack, what is going on?",
    "output": "Applejack: I told y'all this was a bad idea! But nopony ever listens to me!"
  },
  {
    "input": "Twilight Sparkle: I thought everything was fine! What is going on?!",
    "output": "Applejack: Everythin' was goin' fine."
  },
  {
    "input": "Twilight Sparkle: Why didn't you tell me?",
    "output": "Rainbow Dash: We didn't want you to freak out."
  },
  {
    "input": "Twilight Sparkle: And you thought not telling me everything was a total disaster would avoid a freak-out?!",
    "output": "Spike: When you say it like that, it sounds like a really bad plan."
  },
  {
    "input": "Twilight Sparkle: I know how I used to react, but I really have changed. Panicking won't solve anything. But we can handle whatever problems come our way as long as we handle them together!",
    "output": "Princess Celestia: Spoken like a true leader. How can we help?"
  },
  {
    "input": "Twilight Sparkle: Because there is something even more important to celebrate. There are two ponies who have watched over us night and day for as long as we can remember. We will no longer commemorate their battle or their reunion. Instead, we will take this day to celebrate how much they mean to all of us. From this day forward, today will be known as the Festival of the Two Sisters!",
    "output": "Princess Celestia: We don't know what to say."
  },
  {
    "input": "Twilight Sparkle: I'm just glad we pulled it off.",
    "output": "Applejack: About that... We just wanted to say we're real sorry."
  },
  {
    "input": "Twilight Sparkle: Good. Because I'm sure there's gonna be plenty of things I'll need my best friends' help with.",
    "output": "Pinkie Pie: Whee-hee!"
  },
  {
    "input": "Twilight Sparkle: Do you know what he's trying to say?",
    "output": "Spike: Nope."
  },
  {
    "input": "Twilight Sparkle: Sorry, Angel. You should probably find Fluttershy. If I see her, I'll let her know you're looking for her.",
    "output": "Zecora: Quite a day, my fuzzy friend. Did things work out for you in the end?"
  },
  {
    "input": "Twilight Sparkle: Um, hi, Rarity. What's up?",
    "output": "Rarity: Ugh! Besides my mane? Well, that is a question for Spike."
  },
  {
    "input": "Twilight Sparkle: Oh. Well, Spike isn't here. I think he's at the post office.",
    "output": "Rarity: Again?! What is it with Spike and the post office?!"
  },
  {
    "input": "Twilight Sparkle: Rarity, what's going on?",
    "output": "Rarity: Spike declined my invitation to the gem cave, and I intend to find out why."
  },
  {
    "input": "Twilight Sparkle: Hmm. That doesn't sound like Spike. Did you two have some sort of fight?",
    "output": "Rarity: A fight? Goodness, Twilight. What in Equestria would we fight about?"
  },
  {
    "input": "Twilight Sparkle: I've had arguments with friends before, and they can put a real strain on friendships.",
    "output": "Rarity: Well, certainly. But I think I'd remember if we had an argument."
  },
  {
    "input": "Twilight Sparkle: Maybe you didn't realize it? Do you think you could've done something that unintentionally hurt his feelings?",
    "output": "Rarity: Well, if I didn't realize what I did, how would I know what I have done when I did it? I wonder if that's it. It certainly would explain his behavior. I must apologize!"
  },
  {
    "input": "Twilight Sparkle: For what?",
    "output": "Rarity: Oh, pfft. That's hardly the point. Poor Spikey-Wikey! This calls for a grand gesture!"
  },
  {
    "input": "Twilight Sparkle: Okay. Good talk.",
    "output": "Gabby: Wow! That's a big crate of stuff you're mailing."
  },
  {
    "input": "Twilight Sparkle: Hi, Spike.",
    "output": "Spike: Uh-huh..."
  },
  {
    "input": "Twilight Sparkle: Hmmm. I've never seen Spike this sad before. Do you know what happened?",
    "output": "Rarity: Yes, well, perhaps he's still just tired from Power Ponypalooza."
  },
  {
    "input": "Twilight Sparkle: I don't think that's it.",
    "output": "Rarity: I... suppose... it's possible it could have something to do with... Gabby not wanting to spend time with him anymore."
  },
  {
    "input": "Twilight Sparkle: What? I thought the two of them were hanging out all the time.",
    "output": "Rarity: They were! Honestly, it took everything I had to convince him to spend any time with me at all! But between crystal gem crevasses, Power Pony conventions, and a marathon game of O&O, I managed to get some time in."
  },
  {
    "input": "Twilight Sparkle: It sounds like you made sure he didn't have any time to spend with Gabby at all.",
    "output": "Rarity: What?! Pfft! I most certainly did not!"
  },
  {
    "input": "Twilight Sparkle: Friendships change, but just because Spike made a new friend doesn't mean he stops being yours.",
    "output": "Rarity: I know, but now I have to share him! Which I suppose I'll have to get used to. Right after I fix the mess I've made!"
  },
  {
    "input": "Twilight Sparkle: Good talk.",
    "output": "Gabby: Rarity? Is all this stuff for Spike again? Wouldn't it be easier to just give it to him? And why are you even here?"
  },
  {
    "input": "Twilight Sparkle: Starlight, I have something very important to discuss with you.",
    "output": "Starlight Glimmer: If this is about leaving early yesterday, I didn't have any students on my schedule, and Trixie was having a magical emergency, which actually turned out to be nothing—"
  },
  {
    "input": "Twilight Sparkle: It's not anything like that.",
    "output": "Spike: \"Twilight Sparkle, the Princess of Friendship, in light of her impending ascension to the throne of Equestria and in anticipation of her many duties and responsibilities forthwith, does hereby intend to make good on her previous offer to you, Starlight Glimmer, of replacing her as headmare of the School of Friendship!\""
  },
  {
    "input": "Twilight Sparkle: I want you to take over the school when I move to Canterlot.",
    "output": "Starlight Glimmer: I know! It's just so... amazing! I'm a little... Do you think I'm really up for it? Of course you do. I've covered for you every time you've had to run off and save Equestria, but... I mean... Yes. Of course! Thank you!"
  },
  {
    "input": "Twilight Sparkle: You're welcome. And I can't think of anypony who'd be better for the job.",
    "output": "Starlight Glimmer: I'm a little nervous. And excited. I'm mostly just nervous."
  },
  {
    "input": "Twilight Sparkle: I understand. Of course I'll have a lot of important responsibilities as ruler of Equestria, but I'll always be available to help whenever you need.",
    "output": "Spike: Are you supposed to be at a royal etiquette lesson with Celestia and Luna right now?"
  },
  {
    "input": "Twilight Sparkle: Right! Can't underestimate the important responsibility of royal napkin placement.",
    "output": "Starlight Glimmer: Wow. I mean, no biggie. Right, Phyllis? I've totally got this."
  },
  {
    "input": "Twilight Sparkle: Getting royal place settings just right is a lot harder than it looks.",
    "output": "Starlight Glimmer: Okay... Uh, I know how busy you are, but I wanted to talk to you about running the school because, honestly, I was a bit worried about taking it over all on my own. But I just realized you never did it alone."
  },
  {
    "input": "Twilight Sparkle: Having a friend help out is pretty great.",
    "output": "Starlight Glimmer: Exactly! So, what do you think about me hiring a vice headmare to help run things?"
  },
  {
    "input": "Twilight Sparkle: I trust you to run the school any way you want. And if that means hiring a vice headmare, I think it's a great idea.",
    "output": "Starlight Glimmer: Really?"
  },
  {
    "input": "Twilight Sparkle: Like you said, I've always had ponies around to help. And don't worry. You can always call on me to—",
    "output": "Spike: Uh, Twilight? Rarity says you were supposed to be at the boutique five minutes ago for your second fitting for the coronation gown."
  },
  {
    "input": "Twilight Sparkle: Ugh. How many fittings are there gonna be?",
    "output": "Spike: A lot?"
  },
  {
    "input": "Twilight Sparkle: Anyway, good luck finding your vice headmare. I know you'll pick the right pony for the job.",
    "output": "Trixie: Wow. I heard the whole thing. And all I can say is I am humbled."
  },
  {
    "input": "Twilight Sparkle: Starlight? I just thought I'd check in to see how the search for a vice headmare was going.",
    "output": "Starlight Glimmer: A lot better now."
  },
  {
    "input": "Twilight Sparkle: Okay...",
    "output": "Starlight Glimmer: I really wanted it to be a friend, so I ended up pushing aside some pretty big signs that it wasn't gonna work out."
  },
  {
    "input": "Twilight Sparkle: Not everypony is right for every job, but everypony has something to contribute. The trick is figuring out what.",
    "output": "Starlight Glimmer: What if you and your friend can't figure it out?"
  },
  {
    "input": "Twilight Sparkle: If you have a job to do, you have to decide what's best and be upfront and honest, even if that means you can't work with a friend on it.",
    "output": "Starlight Glimmer: So, I guess that means talking to them at the beginning instead of stringing them along until you get so frustrated you totally lose it and say a bunch of really awful things?"
  },
  {
    "input": "Twilight Sparkle: Pretty much.",
    "output": "Starlight Glimmer: Trixie? I know you're in there."
  },
  {
    "input": "Twilight Sparkle: I'm afraid I am. Star Swirl sent me this enchanted flower, and it isn't doing well. If I figure out its magical properties, maybe we can save it.",
    "output": "Scootaloo: So that's a \"no\" on going with us to the fair?"
  },
  {
    "input": "Twilight Sparkle: Oh, definitely. You could take the wrong train or miss your stop...",
    "output": "Fluttershy: Or get lost in a strange town and end up in a dangerous situation with nopony to help you."
  },
  {
    "input": "Twilight Sparkle: I know it's hard, but sometimes you just can't do what you want.",
    "output": "Scootaloo: I'm pretty sure if you wanted to go to the fair, you could."
  },
  {
    "input": "Twilight Sparkle: Sure, grown-ups can do a lot of things that foals can't. But there's plenty we can't do either. Like right now, I can't find a single reference to this flower!",
    "output": "Fluttershy: None of the birds or insects I've talked to have heard of it either."
  },
  {
    "input": "Twilight Sparkle: I wonder if there's anything in Shadetail Evergreen's Tome of Flora and Fauna?",
    "output": "Fluttershy: That book's pretty out of date, but it might be worth a try."
  },
  {
    "input": "Twilight Sparkle: I think there's a copy in the library filed under \"Discontinued But Still Potentially Useful Ancient Texts\". Unless I put it under \"Hokum With a Slight Chance of Practical Applications\".",
    "output": "Apple Bloom: I guess this flower is the most interestin' thing we're gonna see today."
  },
  {
    "input": "Twilight Sparkle: Well, once we read Shadetail Evergreen's warning that the flower grants wishes, it wasn't a stretch to think they wished themselves to the fair. It's all they were talking about.",
    "output": "Fluttershy: Or maybe, since we told them they were too young to come, they wished to become grown-ups, then came here and caused some kind of trouble that led to a town-wide panic!"
  },
  {
    "input": "Twilight Sparkle: Yeah. Or that.",
    "output": "Apple Bloom: Twilight! Fluttershy! Thank goodness! I know you're not gonna believe it, but it's me, Apple Bloom!"
  },
  {
    "input": "Twilight Sparkle: You all go look for Spur. Fluttershy and I will do our best to keep everypony here safe.",
    "output": "Spur: That's Bloofy?!"
  },
  {
    "input": "Twilight Sparkle: They sure aren't, but young foals pretending to be grown-ups are even less so.",
    "output": "Spur: What do you mean?"
  },
  {
    "input": "Twilight Sparkle: There's only one petal left. But I think the three of you know what to wish for. And I'm pretty sure Star Swirl won't mind.",
    "output": "Cutie Mark Crusaders: We wish we were foals again."
  },
  {
    "input": "Twilight Sparkle: I'm glad you learned something. That's what growing up is. Which is why you probably shouldn't skip any of it.",
    "output": "Sweetie Belle: I know we didn't make the best impression, but we sure would like to visit you and Bloofy some day."
  },
  {
    "input": "Twilight Sparkle: About what?",
    "output": "Spike: Oh, I don't know. It's not every day the princesses that have ruled Equestria for hundreds of moons retire and pass all their responsibilities on to your and your friends."
  },
  {
    "input": "Twilight Sparkle: Oh, that. Actually, I'm feeling pretty good. We've all faced so much and come out okay. I know we're up to the challenge of keeping Equestria safe and happy. There's nothing we can't handle together. Which reminds me...",
    "output": "Spike: Royal advisor? What's that?"
  },
  {
    "input": "Twilight Sparkle: A new position I created for you. You've been at my side for every step of this journey. Knowing I had you to count on gave me the strength I needed to grow and succeed. I wouldn't be here without you.",
    "output": "Spike: Thanks, Twilight. You know I'll always be your right-hoof dragon."
  },
  {
    "input": "Twilight Sparkle: I was hoping you'd say that. Because now that my crown's been fitted, we have some royal errands to run!",
    "output": "Rarity: And you're sure this is where Pinkie told us to get the blackberries for her special coronation dessert?"
  },
  {
    "input": "Twilight Sparkle: Is that before or after the royal marshmallow-eating-contest gown?",
    "output": "Rarity: What?! I haven't made one of those! You must tell me when they add these sorts of things!"
  },
  {
    "input": "Twilight Sparkle: It's okay, Rarity. I was just joking.",
    "output": "Spike: Joking? Day of her coronation? You've come a long way, Twilight."
  },
  {
    "input": "Twilight Sparkle: What was that about?",
    "output": "Rarity: You know designers. Don't like being interrupted when they're on a creative roll. With thread this exquisite, can you blame them?"
  },
  {
    "input": "Twilight Sparkle: You're right. I'll just have to let everypony know that even with Celestia and Luna gone, we'll make sure things stay the same.",
    "output": "Applejack: Twilight! There you are! You mind tellin' your friend here that I don't need an official guard wherever I go? Especially if he ain't gonna help carry apples?"
  },
  {
    "input": "Twilight Sparkle: I appreciate you taking such good care of my friends, but we're fine now.",
    "output": "Applejack: It was the strangest thing. He kept callin' me \"Earth pony\", like I didn't have a name. And watchin' me like he thought I'd steal the silver!"
  },
  {
    "input": "Twilight Sparkle: You sure this is just pre-coronation nerves?",
    "output": "Discord: My aching metatarsals! You know, you forget how convenient snap-travel is."
  },
  {
    "input": "Twilight Sparkle: Except it was all a lie.",
    "output": "Discord: A well-intentioned lie."
  },
  {
    "input": "Twilight Sparkle: You've been setting up challenges for us the whole time, haven't you? None of our successes were actually real.",
    "output": "Discord: Of course they were! You just had an extremely good-looking safety net."
  },
  {
    "input": "Twilight Sparkle: I... I need some time to think first.",
    "output": "Discord: Well, there isn't any time! Look what I overheard them saying!"
  },
  {
    "input": "Twilight Sparkle: How?! Stopping Sombra by himself was hard enough! And that was with lord-of-chaos training wheels!",
    "output": "Princess Celestia: Twilight, it doesn't matter if Discord set up your successes or not. We believe in you and always have."
  },
  {
    "input": "Twilight Sparkle: The ultimate battle for the fate of Equestria is coming!",
    "output": "Cozy Glow: We're not going anywhere until you two stop arguing! Chrysalis, say something nice about Tirek."
  },
  {
    "input": "Twilight Sparkle: We've faced enemies of Equestria before. And we've always succeeded, no matter the odds. That wouldn't be possible without all of you.",
    "output": "Discord: You're welcome!"
  },
  {
    "input": "Twilight Sparkle: So I ask for your help again today in what is our biggest battle yet. All of Equestria is at stake, and I can't do this alone. But I'm not afraid. Because with friendship as our armor and teamwork as our power, nopony can ever bring us down!",
    "output": "Cozy Glow: Oh, come on!"
  },
  {
    "input": "Twilight Sparkle: Cozy Glow?! You're—!",
    "output": "Cozy Glow: About to wipe the floor with you!"
  },
  {
    "input": "Twilight Sparkle: Aah!",
    "output": "Cozy Glow: Wow! It's true! Alicorns really do have more fun!"
  },
  {
    "input": "Twilight Sparkle: NO!",
    "output": "Cozy Glow: That's the problem with you magic-types. You're so reliant on all your special power, you forget to use your brains!"
  },
  {
    "input": "Twilight Sparkle: Keep telling yourself that! Now!",
    "output": "Cozy Glow: Whoaaaa!"
  },
  {
    "input": "Twilight Sparkle: You can attack us and we may fall. But Equestria will still stand, united in friendship. And we won't stop until we defeat you, no matter how many ponies you take down!",
    "output": "Lord Tirek: Didn't you all notice something was wrong in Equestria? We've been busy."
  },
  {
    "input": "Twilight Sparkle: Aah!",
    "output": "Lord Tirek: 'Cause when you have to protect yourself, you don't have time for anypony else."
  },
  {
    "input": "Twilight Sparkle: Huh?",
    "output": "Rarity: Go, Twilight! Get help!"
  },
  {
    "input": "Twilight Sparkle: No! I can't leave you here!",
    "output": "Fluttershy: It's our only chance!"
  },
  {
    "input": "Twilight Sparkle: You've been setting up challenges for us the whole time, haven't you?",
    "output": "Discord: My bad."
  },
  {
    "input": "Twilight Sparkle: The ultimate battle for the fate of Equestria is coming!",
    "output": "Applejack: We'll hold 'em 'til you get back!"
  },
  {
    "input": "Twilight Sparkle: You're here?! I was so worried! Where are the princesses?",
    "output": "Pinkie Pie: They put up a crazy fight so we could escape and find you! Mission accomplished! Now let's save Equestria! Whoo-hoo-hoo-hoo! Yeah!"
  },
  {
    "input": "Twilight Sparkle: They made a terrible mistake. You all did. From the second I got away, I've been searching every book, scroll, and spell for a way to rescue you and stop Chrysalis, Tirek, and Cozy, but I haven't found anything. I failed.",
    "output": "Spike: You'll come up with something. We can't save Equestria without you."
  },
  {
    "input": "Twilight Sparkle: You all escaped without my help. You didn't need me then. So why would anypony need me now?",
    "output": "Rainbow Dash: We know things look bad, but we've been in tough spots before, and we always—"
  },
  {
    "input": "Twilight Sparkle: Look around! Nothing we've ever done has mattered! Sombra? Returned and destroyed the Tree of Harmony! Chrysalis, Tirek, Cozy Glow? Returned and more powerful than ever! The School of Friendship? Shut down! Everypony in Equestria is so blinded by fear, they can't remember what friendship is! Nothing we do makes any difference!",
    "output": "Pinkie Pie: But we're still free and together."
  },
  {
    "input": "Twilight Sparkle: I've already done enough.",
    "output": "Applejack: You want the truth, Twilight? Bad things happen. No matter what you do, there's never gonna be a time when everything's perfect. But that don't mean you quit tryin'!"
  },
  {
    "input": "Twilight Sparkle: What if I make things worse?! Ever since Celestia told me I was taking over, I've been gaining confidence. Then I find out it's all a lie. Equestria's been falling apart around us, and I didn't even notice! What kind of princess does that make me? I'm scared.",
    "output": "Fluttershy: I probably know more about being scared than anypony. But thanks to all of you, I've learned I'm always less scared when I'm with my friends."
  },
  {
    "input": "Twilight Sparkle: But we're on our own, and we have no idea what to do!",
    "output": "Pinkie Pie: That's true pretty much every time something terrible is about to happen."
  },
  {
    "input": "Twilight Sparkle: We don't have the Elements of Harmony anymore. How can you all be so calm about this?",
    "output": "Spike: Because, even if you don't believe you can do this, we do. We believe in you. In us."
  },
  {
    "input": "Twilight Sparkle: Thank you. Sometimes even the Princess of Friendship needs a reminder that there's more to the Magic of Friendship than rainbow lasers.",
    "output": "Spike: Although that part is pretty cool."
  },
  {
    "input": "Twilight Sparkle: We still need a plan.",
    "output": "Princess Cadance: That sounds like the pony I used to foal-sit for. Count us in."
  },
  {
    "input": "Twilight Sparkle: No. You need to stay here and protect Flurry Heart. If we don't... If things don't work out, she's Equestria's last hope. Okay. Three of our worst villains have taken over, powered up by ancient magic. Everypony in Equestria is so scared and divided that the windigos are circling. And it's up to us to fix it all.",
    "output": "Pinkie Pie: What are we gonna do, Twilight?!"
  },
  {
    "input": "Twilight Sparkle: The same thing we do every time, Pinkie. Try to save the world!",
    "output": "Lord Tirek: Every prisoner is safely in their cells. Now we can hunt down the rest of the— Windigos?"
  },
  {
    "input": "Twilight Sparkle: That bell has Discord, Celestia, and Luna's magic inside. If they use it against us—",
    "output": "Fluttershy: Discord's magic is so chaotic, he's the only one who can use it."
  },
  {
    "input": "Twilight Sparkle: You can't beat us if we never give up! As long as I have my friends by my side, I'll put my faith in friendship—",
    "output": "Cozy Glow: Ugh, can we get on with this please?"
  },
  {
    "input": "Twilight Sparkle: We need to get that bell and get Discord and the princesses their magic back. Rainbow Dash, Pinkie, you're with me.",
    "output": "Rainbow Dash: Sweet! I'll grab that bell in ten second—!"
  },
  {
    "input": "Twilight Sparkle: No. We're the distraction. They're gonna get the bell.",
    "output": "Queen Chrysalis: Come out, come out, wherever you are!"
  },
  {
    "input": "Twilight Sparkle: Please! Don't hurt him!",
    "output": "Spike: Don't worry about me! Just save—!"
  },
  {
    "input": "Twilight Sparkle: It's not me!",
    "output": "Lord Tirek: Don't let them escape!"
  },
  {
    "input": "Twilight Sparkle: I don't understand. How are you all here?",
    "output": "Gallus: That's kinda our fault."
  },
  {
    "input": "Twilight Sparkle: ENOUGH! Because of you, I almost lost my way! But everycreature here has reminded me of the true power of friendship! There will always be darkness in the world, but there will also always be those who find the light! The Pillars knew this! That's why they created the Elements of Harmony! The Elements showed me and my friends how strong our friendship could be! Together we worked to bring harmony to Equestria! But there will always be more to do! Which is why we teach others about the Magic of Friendship! Others who will continue our mission after we are gone! Now I truly understand! The Elements were just symbols! The real magic has always been right here! And the more who understand how powerful friendship is, the stronger we will all be! Together!",
    "output": "Cozy Glow: This is bad, isn't it?"
  },
  {
    "input": "Twilight Sparkle: Pinkie! You took Discord's magic from the bell?! How do you feel?",
    "output": "Pinkie Pie: Hmmm... Tingly. Itchy. Also like..."
  },
  {
    "input": "Twilight Sparkle: You know what? I think I am.",
    "output": "Applejack: Thank goodness. First question, your Highness. What do we do with all these creatures?"
  },
  {
    "input": "Twilight Sparkle: Actually, as ruler of Equestria, I'd like to postpone the coronation for a while. At least until the castle's rebuilt. Besides, there's something we need to do first.",
    "output": "Rarity: Post-apocalyptic donuts. Interesting choice."
  },
  {
    "input": "Twilight Sparkle: I know. But there's gonna be plenty of time for all the challenges and struggles and adventures to come. For now, I just want to spend a quiet moment with the six best friends I've ever had.",
    "output": "Applejack: Well, mostly quiet."
  },
  {
    "input": "Twilight Sparkle: All I know is whatever comes next is going to be perfect.",
    "output": "Spike: How do you know that?"
  },
  {
    "input": "Twilight Sparkle: With you guys by my side, how could it not?",
    "output": "Future Spike: I got here as soon as I could, but friendship ambassador is a full time job these days. Making peace between Abyssinians and the Diamond Dogs has not been easy."
  },
  {
    "input": "Twilight Sparkle: I'm just doing a final check, Spike.",
    "output": "Spike: But we did a final check. Of every room. Twice."
  },
  {
    "input": "Twilight Sparkle: Ah-ha! See? An issue of Power Ponies. Now, aren't you glad we triple-checked?",
    "output": "Spike: Thanks, but I already read this one. I don't need to take it to Canterlot."
  },
  {
    "input": "Twilight Sparkle: No-no-no! You love Power Ponies. We're taking it.",
    "output": "Spike: Really, Twilight, we don't have to bring the comic. I'm not even sure how much longer I'll collect them. A lot is changing, and I am getting older."
  },
  {
    "input": "Twilight Sparkle: Just because things change doesn't mean you leave everything you love behind!",
    "output": "Spike: You're not still worried about ruling Equestria, are you?"
  },
  {
    "input": "Twilight Sparkle: No. I know it took some time, but I've never been more ready for anything in my life. Just because I'm ready to sit on the throne in Canterlot, doesn't mean I'm ready to leave Ponyville. When we were all fighting to save Equestria from Tirek, Chrysalis, and Cozy Glow, I was too busy to think about it. But now it's all happening at once.",
    "output": "Spike: What is?"
  },
  {
    "input": "Twilight Sparkle: The coronation. Moving. Leaving our friends.",
    "output": "Spike: I thought we'd all be ruling Equestria together."
  },
  {
    "input": "Twilight Sparkle: Of course we will, but it won't be the same. They all have lives here. We're moving away and they're not, and I can't help but feel like we're leaving them behind. What if we all just drift apart?",
    "output": "Spike: I guess I hadn't thought about it like that. Maybe you should talk to them. I bet they're feeling the same way."
  },
  {
    "input": "Twilight Sparkle: So, you're not worried about how things might change with me living in Canterlot?",
    "output": "Applejack: Of course not. Change is natural, like the seasons. That's just life on the farm."
  },
  {
    "input": "Twilight Sparkle: I guess so.",
    "output": "Applejack: Anyhoo, I really need to get all these boxes packed and sorted. There's a lot more work now that the folks beyond Equestria are comin' to the coronation, too."
  },
  {
    "input": "Twilight Sparkle: But what about after the coronation? Don't you think things are gonna be different?",
    "output": "Pinkie Pie: Well, since I'll be in charge of all the Canterlot galas from now on, I'll have to go there a lot more. So I guess that's different, but I don't think I mind."
  },
  {
    "input": "Twilight Sparkle: No. Of course not.",
    "output": "Fluttershy: Wonderful work, everyone! We couldn't be more ready. Josephine, if you and the rest of the doves leave now, we should all arrive in Canterlot at the same time."
  },
  {
    "input": "Twilight Sparkle: Yeah. Me, neither.",
    "output": "Rainbow Dash: In three, two, one, and..."
  },
  {
    "input": "Twilight Sparkle: I don't think the Power Ponies care, Spike. Just like all of our friends.",
    "output": "Applejack: All right, Twilight. Are you ready? We all wanted to see you off, but there's still a lot to do."
  },
  {
    "input": "Twilight Sparkle: Well, I'll be living in Canterlot alone. Might as well take the train alone, too. Bye, I guess.",
    "output": "Rarity: Oh, you won't be traveling alone, darling. I'll have just enough time on the train to weave the star spider sash for your gown. But we should leave now. There's no time to dawdle if you want the coronation to be perfect."
  },
  {
    "input": "Twilight Sparkle: That's the problem! You're all so worried about making my coronation perfect, but I'm leaving Ponyville and none of you even care!",
    "output": "Luster Dawn: Exactly. You moved away, your friends didn't care, and that was that."
  },
  {
    "input": "Twilight Sparkle: I tried to talk to you all about how I was feeling, but you seemed more worried about what you had to do for the coronation.",
    "output": "Spike: It's true. I was there."
  },
  {
    "input": "Twilight Sparkle: Before I moved to Ponyville, I didn't really know what friendship was. You've all taught me so much. I can't believe it all might be ending. But when I imagine the future, all I can think about is that we won't be together! I'm literally moving away from you, and it's terrifying!",
    "output": "Fluttershy: I'm scared, too."
  },
  {
    "input": "Twilight Sparkle: I know it's weird, but knowing you're all are as upset as I am actually makes me less worried.",
    "output": "Spike: That's nice, but you should be more worried about missing the train to Canterlot!"
  },
  {
    "input": "Twilight Sparkle: Okay. We're on the train. Everything should be fine, right?",
    "output": "Rarity: I'd worked out exactly how much time I needed to weave my star spider sash, and now I'm behind!"
  },
  {
    "input": "Twilight Sparkle: Well, it could always be worse.",
    "output": "Princess Luna: Goodness, Twilight. Are you all right?"
  },
  {
    "input": "Twilight Sparkle: My friends and I had a few hiccups on the way. But everything's fine now.",
    "output": "Princess Celestia: We really are both just so proud of you. If you need a moment, that's all right. It is your coronation."
  },
  {
    "input": "Twilight Sparkle: Sorry.",
    "output": "Princess Luna: Um, Twilight?"
  },
  {
    "input": "Twilight Sparkle: Aah!",
    "output": "Applejack: To Twilight!"
  },
  {
    "input": "Twilight Sparkle: That was something.",
    "output": "Starlight Glimmer: I was just about to say the same thing. I know maybe it wasn't the coronation you planned, but it's good to see all of you laughing."
  },
  {
    "input": "Twilight Sparkle: Awww.",
    "output": "Pinkie Pie: It's a book of memories."
  },
  {
    "input": "Twilight Sparkle: I love it. Thank you so much. But I don't want to only look back. Obviously the coronation wasn't perfect, but that doesn't matter. It's our relationships that really count, and we have to maintain them.",
    "output": "Rarity: But now that we'll be living in different places, I'm not exactly sure how."
  },
  {
    "input": "Twilight Sparkle: I am. I suggest we meet once a moon. In fact, my first royal decree as ruler of Equestria is to establish this Council of Friendship!",
    "output": "Princess Celestia: And what a wonderful decree it is!"
  },
  {
    "input": "Twilight Sparkle: You're leaving?",
    "output": "Princess Luna: We hope you'll come and visit us in Silver Shoals."
  },
  {
    "input": "Twilight Sparkle: Thank you. For everything. Mmmm!",
    "output": "Luster Dawn: So, even though everything changed and you moved away from your friends, you didn't grow apart? And this is the Council of Friendship? That's what you're all doing here?"
  },
  {
    "input": "Twilight Sparkle: This happened while we were gone?",
    "output": "Applejack: Wow! Those are all the places we went when we left to save Equestria!"
  },
  {
    "input": "Twilight Sparkle: Tempest! I invited her to come to Ponyville, but she wanted to spread the word of the Storm King's defeat and share what she learned about friendship.",
    "output": "Applejack: Y'all think that's why the map grew? Friendship quests beyond Equestria?"
  },
  {
    "input": "Twilight Sparkle: We can't do it all alone.",
    "output": "Pinkie Pie: Sure we can! We just need to knock this wall down, get some paint..."
  },
  {
    "input": "Twilight Sparkle: No. I mean, the world is filled with so many different creatures who know nothing about friendship. We need help if we're gonna teach them all about friendship. Lots of help.",
    "output": "Rarity: Perhaps. But where does one go to learn about friendship?"
  },
  {
    "input": "Twilight Sparkle: Here! They can all go here! Because we're gonna open a school!",
    "output": "Princess Celestia: I think a school of friendship is a wonderful idea, Twilight! I'll help in any way I can."
  },
  {
    "input": "Twilight Sparkle: I just have a few questions. What time should school start each day?",
    "output": "Princess Celestia: It really d—"
  },
  {
    "input": "Twilight Sparkle: What's the ideal length for class? Do you test regularly?",
    "output": "Princess Celestia: Oh, well, that's—"
  },
  {
    "input": "Twilight Sparkle: What about class projects?",
    "output": "Princess Celestia: That's a very—"
  },
  {
    "input": "Twilight Sparkle: Assigned seating? Open seating? Or is that... too unstructured?",
    "output": "Princess Celestia: Oh, Twilight. You were my star pupil. If anyone knows how to run a school, it's you."
  },
  {
    "input": "Twilight Sparkle: There's a big difference between attending a school and running one. It's not like there's a rule book to follow.",
    "output": "Princess Celestia: Actually, there is. The EEA guidebook is very specific about how to run a school."
  },
  {
    "input": "Twilight Sparkle: The EEA? I've never heard of that. Should I have heard of that?!",
    "output": "Princess Celestia: Of course not. You've never run a school before. The Equestria Education Association is a board of learned ponies that oversee every school in Equestria."
  },
  {
    "input": "Twilight Sparkle: Okay, Spike, looks like we have a presentation to make.",
    "output": "Spike: After everything we've been through, how hard can that be?"
  },
  {
    "input": "Twilight Sparkle: Uh, hello. My name is—",
    "output": "Neighsay: Princess Twilight Sparkle. I am Chancellor Neighsay. Equestria owes you a great debt. But princess or no, we expect you to do things by... the... book!"
  },
  {
    "input": "Twilight Sparkle: I think you'll find my curriculum meets all your requirements, Chancellor.",
    "output": "Neighsay: And can we trust you to follow through with this plan? Will you leave the school unattended to gallop off on your... \"adventures\"?"
  },
  {
    "input": "Twilight Sparkle: If we want to keep our land safe and create a friendlier tomorrow, we need to teach the Magic of Friendship far and wide.",
    "output": "Neighsay: A school for ponies to learn how to protect themselves."
  },
  {
    "input": "Twilight Sparkle: Uh, more like respecting differences and communicating.",
    "output": "Neighsay: The EEA concurs. Every pony should be prepared to defend our way of life. So, if your work is in order, provisional EEA approval is granted. We will need to observe your school up and running before it can be fully accredited."
  },
  {
    "input": "Twilight Sparkle: Then please, join us for Friends and Family Day. It'll be the perfect time to see our progress!",
    "output": "Rainbow Dash: It's too much. Too much!"
  },
  {
    "input": "Twilight Sparkle: It's going to be fine. Everything about this school just feels right.",
    "output": "Starlight Glimmer: See? If Twilight isn't stressed, you've got nothing to worry about."
  },
  {
    "input": "Twilight Sparkle: The EEA is very clear on how schools should be run. We have a huge responsibility, and I need you all to do this by the book. That means no cannons in class, Pinkie.",
    "output": "Pinkie Pie: Awww. Not even a teeny cannon?"
  },
  {
    "input": "Twilight Sparkle: I know it's not some big adventure against the forces of evil, but this could be the most important thing we've ever done. I can't run a school of friendship without my best friends. Can I count on you?",
    "output": "Rarity: Of course you can, darling."
  },
  {
    "input": "Twilight Sparkle: About that. One thing I forgot to mention. It's not just ponies.",
    "output": "Pinkie Pie: That was unexpected."
  },
  {
    "input": "Twilight Sparkle: Welcome to the School of Friendship! I'm your headmare Twilight Sparkle. Please follow Guidance Counselor Starlight to sign in and get your class assignments. Then we can show you your living quarters.",
    "output": "Sandbar: Whoa, sorry! I'm Sandbar. Are you a student here, too?"
  },
  {
    "input": "Twilight Sparkle: Looks like school's in session!",
    "output": "Silverstream: Is this what boring is? Am I bored?"
  },
  {
    "input": "Twilight Sparkle: I get it. Things are getting off to a rougher start than expected. But that's okay!",
    "output": "Spike: Who are you, and what have you done with Twilight Sparkle?"
  },
  {
    "input": "Twilight Sparkle: Every school in Equestria follows these rules. As long as we do too, we'll be fine.",
    "output": "Starlight Glimmer: Maybe we should... try something new?"
  },
  {
    "input": "Twilight Sparkle: The EEA will be here this afternoon for Friends and Family Day. They need to see a school that follows their guidelines.",
    "output": "Fluttershy: Even if those guidelines aren't working?"
  },
  {
    "input": "Twilight Sparkle: Another morning, another chance to inspire our students!",
    "output": "Sandbar: Hey! Professor Dash's class is this way."
  },
  {
    "input": "Twilight Sparkle: My friends can handle anything. They'll have these problems turned around before we know it.",
    "output": "Neighsay: Problems?"
  },
  {
    "input": "Twilight Sparkle: Chancellor Neighsay! You're here!",
    "output": "Neighsay: Yes. And you seem unprepared. If there are problems..."
  },
  {
    "input": "Twilight Sparkle: Problems? Ha! Of course not! We can't wait to show you around!",
    "output": "Gallus: And that's why griffons breathe fire when we get mad."
  },
  {
    "input": "Twilight Sparkle: Rainbow Dash! Why aren't you in class teaching?",
    "output": "Rainbow Dash: Because my students are gone! Uh, g-gone somewhere else! Doing a loyalty lesson! And-and I was just going to grab, uh... this pencil! Because they need it. Wherever they are. Which I know, 'cause... I'm the teacher!"
  },
  {
    "input": "Twilight Sparkle: I see. Well, Chancellor, we have other classes. We can just—",
    "output": "Neighsay: Let's follow the professor. I'm quite curious about this lesson in loyalty."
  },
  {
    "input": "Twilight Sparkle: Of course, we want to instill a sense of loyalty towards others. We encourage acts of generosity and kindness.",
    "output": "Gallus: Figured we shouldn't be the only ones enjoying the view."
  },
  {
    "input": "Twilight Sparkle: And appreciation for the value of laughter...",
    "output": "Yona: Flying is best!"
  },
  {
    "input": "Twilight Sparkle: ...and to always be honest in any situation.",
    "output": "Neighsay: Honesty is imperative. Princess, are we going in circles?"
  },
  {
    "input": "Twilight Sparkle: Uh, look at the time! We'd better head to the lake for Friends and Family Day. I'm sure all the students and faculty will be there.",
    "output": "Ember: What is that?!"
  },
  {
    "input": "Twilight Sparkle: I-I'm so sorry, Chancellor. We clearly had some students get a little carried away.",
    "output": "Neighsay: Those are students? But you said you were opening this school to protect Equestria! To defend ponies from... dangerous creatures who don't have our best interests at heart!"
  },
  {
    "input": "Twilight Sparkle: My school teaches for all of us to work together through friendship.",
    "output": "Neighsay: And how do you know these creatures won't take what they have learned here and use it against us?"
  },
  {
    "input": "Twilight Sparkle: Friendship isn't just for ponies!",
    "output": "Neighsay: It should be."
  },
  {
    "input": "Twilight Sparkle: Princess Celestia helped me reach out to all the kingdoms! When she hears you closed the school because—!",
    "output": "Neighsay: Because you failed to meet the EEA's standards?"
  },
  {
    "input": "Twilight Sparkle: What?!",
    "output": "Neighsay: Irresponsible teachers, students skipping class, endangering ponies! Your school is a disaster. Perhaps if you had had higher standards for who was admitted, this could have been avoided. Regardless..."
  },
  {
    "input": "Twilight Sparkle: This happened while we were gone?",
    "output": "Applejack: Friendship quests beyond Equestria?"
  },
  {
    "input": "Twilight Sparkle: We're gonna open a school!",
    "output": "Neighsay: We expect you to do things by... the... book!"
  },
  {
    "input": "Twilight Sparkle: We have a huge responsibility, and I need you all to do this by the book.",
    "output": "Smolder: These ponies are the heroes of Equestria?"
  },
  {
    "input": "Twilight Sparkle: A failure vacation! I'm supposed to be the Princess of Friendship! And all I did was make enemies with Equestria's allies, upset my friends, and get my school... ...unaccredited! There is no bright side!",
    "output": "Spike: Okay, then. I'm gonna need backup. Operation Cheer-Up is a go!"
  },
  {
    "input": "Twilight Sparkle: Thanks, Rarity. It's a great dress... for somepony who knows how to run a school!",
    "output": "Pinkie Pie: You didn't tell me this was a pity party! I would've brought ice cream!"
  },
  {
    "input": "Twilight Sparkle: I appreciate you trying to make me feel better, but not everything can be fixed with dresses and cupcakes.",
    "output": "Pinkie Pie: What?!"
  },
  {
    "input": "Twilight Sparkle: Oh...",
    "output": "Starlight Glimmer: I wondered how long you'd take to get tired of pillow-fort pouting."
  },
  {
    "input": "Twilight Sparkle: Everypony's already tried to cheer me up. It won't work.",
    "output": "Starlight Glimmer: I'm not gonna cheer you up. I'm gonna tell you what you did wrong."
  },
  {
    "input": "Twilight Sparkle: What?!",
    "output": "Starlight Glimmer: You gave up too easily."
  },
  {
    "input": "Twilight Sparkle: Neighsay was right. I failed. The school was a disaster.",
    "output": "Starlight Glimmer: So was I when you met me. But you showed me that when you know in your heart something is right, you stand up for it. You did that for me. Why not for this?"
  },
  {
    "input": "Twilight Sparkle: I can't go against the EEA! They're in charge of all the schools in Equestria!",
    "output": "Starlight Glimmer: And you're in charge of all the friendship in Equestria. Why should you let somepony else stop you from doing your job?"
  },
  {
    "input": "Twilight Sparkle: But the EEA rulebook—",
    "output": "Starlight Glimmer: Doesn't matter! You can write your own rules! Because you are doing something new. Something important!"
  },
  {
    "input": "Twilight Sparkle: You're right! Why we're doing this is way more important than how we're doing this! And we are doing this!",
    "output": "Starlight Glimmer: Now, that's the Twilight I know. How can I help?"
  },
  {
    "input": "Twilight Sparkle: Guess what? The School of Friendship is back in business!",
    "output": "Rainbow Dash: What?!"
  },
  {
    "input": "Twilight Sparkle: No, Rainbow Dash is right. I owe you all an apology. I was so focused on doing things the EEA way, I didn't listen to any of you. I'm sorry. I promise, this time, we'll run the school the way friends should – together.",
    "output": "Rarity: So... we'd be allowed to teach however we want to?"
  },
  {
    "input": "Twilight Sparkle: Whatever you need to teach the Elements of Harmony.",
    "output": "Pinkie Pie: Yippeeeee!"
  },
  {
    "input": "Twilight Sparkle: I'll take care of the first part if you five can round up our class.",
    "output": "Rainbow Dash: Totally! Uh... how?"
  },
  {
    "input": "Twilight Sparkle: Sorry.",
    "output": "Seaspray: The students couldn't have done this by themselves. Some creature is hiding them! If the niece of our queen is not found soon, I promise there will be retribution!"
  },
  {
    "input": "Twilight Sparkle: Okay. Let's review what we know.",
    "output": "Spike: Smolder, Ocellus, Silverstream, Yona, and Gallus disappeared together."
  },
  {
    "input": "Twilight Sparkle: Is everycreature alright?",
    "output": "Spike: You're lucky we got here in time!"
  },
  {
    "input": "Twilight Sparkle: Not exactly. We have another option in mind.",
    "output": "Gallus: We're listening."
  },
  {
    "input": "Twilight Sparkle: It's pretty clear you've already started learning friendship without your teachers. But we'd like to show you even more... if you'd come back to school?",
    "output": "Smolder: Not much of a choice."
  },
  {
    "input": "Twilight Sparkle: School is back in session!",
    "output": "Neighsay: Who dared remove my seal?"
  },
  {
    "input": "Twilight Sparkle: I did, Chancellor Neighsay! And I respectfully ask you to step aside, or classes will start late.",
    "output": "Neighsay: Classes won't start at all! The EEA has spoken, and none shall pass!"
  },
  {
    "input": "Twilight Sparkle: I do! It's true that my School of Friendship is EEA-unaccredited...",
    "output": "Spike: Look! She said it without doing the eye thing!"
  },
  {
    "input": "Twilight Sparkle: These students reminded me that every friendship is special, so the way we teach it has to be just as unique. My school is going to do things differently.",
    "output": "Neighsay: Allowing all of these creatures to attend your school, changing the rules for them – it simply won't work!"
  },
  {
    "input": "Twilight Sparkle: I promise you, Chancellor. My school will help protect Equestria.",
    "output": "Neighsay: Or destroy it!"
  },
  {
    "input": "Twilight Sparkle: ...with some help from my friends.",
    "output": "Meadow Song: Puh-leeeez put your hooves together for your next performer, Maud Pie!"
  },
  {
    "input": "Twilight Sparkle: Sorry, I've got a curriculum to make up.",
    "output": "Applejack: Nope."
  },
  {
    "input": "Twilight Sparkle: How in the world did you figure that out, Spike?",
    "output": "Spike: I'm not Dragon Charades champion for nothin'!"
  },
  {
    "input": "Twilight Sparkle: I can't imagine Fluttershy would ever be mean to her animal friends. This sounds serious. Spike, tell everyone it's time to head back to Saddle Row!",
    "output": "Fluttershy: I wouldn't think it was possible to make something so dowdy even more matronly, but here you are. It's like a scream in the void, empty and ultimately meaningless. I would srsly help you right now, but, like, I don't wanna, you know?"
  },
  {
    "input": "Twilight Sparkle: You weren't kidding. This is worse than we thought! She's being horrible to everypony!",
    "output": "Applejack: Uh, are you sure that's even Fluttershy?"
  },
  {
    "input": "Twilight Sparkle: Fluttershy, I understand why you think you have to act this way for these customers, but there's gotta be a better way.",
    "output": "Fluttershy: Goodness! You are so right. Please, step this way so that we may discuss your concerns."
  },
  {
    "input": "Twilight Sparkle: I knew you'd come to your senses!",
    "output": "Fluttershy: Indeed."
  },
  {
    "input": "Twilight Sparkle: Well, things might have seemed all right when you left, but they're definitely not all right now.",
    "output": "Applejack: She's actin' worse than the worst Manehattanite I ever saw!"
  },
  {
    "input": "Twilight Sparkle: But, Fluttershy, why did you think you needed to be somepony else to run the shop?",
    "output": "Fluttershy: I guess acting like the ponies of Saddle Row gave me the confidence to interact with them."
  },
  {
    "input": "Twilight Sparkle: I wouldn't sell yourself short. Those salespony characters all came from you!",
    "output": "Rainbow Dash: Yeah! I think you totally have what it takes."
  },
  {
    "input": "Twilight Sparkle: That's what happens when you're summoned by the Map.",
    "output": "Sweetie Belle: Somepony needs our help?"
  },
  {
    "input": "Twilight Sparkle: Actually, where you're going isn't even in Equestria.",
    "output": "Sweetie Belle: Wow! That's almost... off the table!"
  },
  {
    "input": "Twilight Sparkle: Mount Aris, the home of the Hippogriffs! And that's where you're headed!",
    "output": "Cutie Mark Crusaders: Whoa...!"
  },
  {
    "input": "Twilight Sparkle: I know that. But I'm not so sure the ponies who care about you want you going off so far on your own. Besides, there's some school business I need to take care of on Mount Aris. This permission slip is for Silverstream. It's very important that her mother and father sign it, or else no field trips.",
    "output": "Scootaloo: Sounds like somepony just wants a vacation."
  },
  {
    "input": "Twilight Sparkle: Okay, yes, I have been wanting to visit Mount Aris ever since the Hippogriffs moved back. But it's purely research. Silverstream's brother is gonna meet us there and take us to their houses.",
    "output": "Apple Bloom: Wow! They have more than one house?"
  },
  {
    "input": "Twilight Sparkle: I guess so. The social structure of the Hippogriffs and seaponies is a bit of a mystery.",
    "output": "\"All Aboard\": All aboard! Last stop – the new Mount Aris Station!"
  },
  {
    "input": "Twilight Sparkle: Wait, what? She told you she defeated him? By herself?",
    "output": "Apple Bloom: Uh, maybe she didn't say that exactly. But it makes for a better story."
  },
  {
    "input": "Twilight Sparkle: I don't know. But Hippogriffs don't have cutie marks. So it might not have anything to do with that at all.",
    "output": "Apple Bloom: Huh. Still, the Map called us, so it must be a kind of problem that only we can solve."
  },
  {
    "input": "Twilight Sparkle: The Map doesn't really work like that. But I'm sure you and whoever needs help will find each other.",
    "output": "Terramar: Excuse me! Miss Sparkle? Over here! Sorry I'm late. I'm Silverstream's brother Terramar."
  },
  {
    "input": "Twilight Sparkle: But others got used to living under the water and stayed in Seaquestria.",
    "output": "Terramar: And me? Well, I kind of go back and forth with this. It's a tiny piece of the magic pearl. It was split up among our kingdoms."
  },
  {
    "input": "Twilight Sparkle: Well, I'm pretty eager to see the Hippogriff village. You know, to... get this form signed. And... research! So...",
    "output": "Apple Bloom: Hey, Terramar? Does anygriff you know up there have a problem they need help with?"
  },
  {
    "input": "Twilight Sparkle: Whoa! This looks amazing! Last time I was here, it was a ghost town!",
    "output": "Terramar: Yeah. Queen Novo thought it was important to return our village to its former glory."
  },
  {
    "input": "Twilight Sparkle: Absolutely! And to have you sign a form for Silverstream.",
    "output": "Sky Beak: Glad to! But first, let's show the princess some real Mount Aris hospitality! To the refreshment tent for a stein of salmon juice!"
  },
  {
    "input": "Twilight Sparkle: Eh. Research. See you later! And good luck! I know you'll find your mission!",
    "output": "Sweetie Belle: Well, your dad's certainly... outgoing, isn't he?"
  },
  {
    "input": "Twilight Sparkle: Hey, everypony! This festival is fantastic! Look what I won at the ring toss booth! Ahem. But of course, I'm really here on business. Sky Beak's already signed the form. Now I just need your mom's signature. Is she around?",
    "output": "Apple Bloom: Um... she's a seapony. In Seaquestria."
  },
  {
    "input": "Twilight Sparkle: That's what Silverstream meant by \"houses\"!",
    "output": "Terramar: Mm-hmm. If you'd like to meet my mom, we're just heading down there now."
  },
  {
    "input": "Twilight Sparkle: Well, she is one of our most hardworking students. In fact, I brought this form for you to sign so that—",
    "output": "Ocean Flow: Both my children are so smart. Would you like to see their baby pictures?"
  },
  {
    "input": "Twilight Sparkle: That sounds adorable! I'd love to! And you know, to find out about aquatic pony early development and, uh...",
    "output": "Cutie Mark Crusaders: Research."
  },
  {
    "input": "Twilight Sparkle: Why not? Could be another trophy in my future! Be back soon!",
    "output": "Scootaloo: All right! Let's add some positives to the Seaquestria side!"
  },
  {
    "input": "Twilight Sparkle: Uh, what's going on? Where's Terramar?",
    "output": "Apple Bloom: Uh, well... he... he kinda left. He wanted to be by himself."
  },
  {
    "input": "Twilight Sparkle: Well, of course not. Why would you think that?",
    "output": "Scootaloo''' and '''Sweetie Belle: Because it was our fault."
  },
  {
    "input": "Twilight Sparkle: Whoever said that he had to choose?",
    "output": "Apple Bloom: Well, he did."
  },
  {
    "input": "Twilight Sparkle: Hmmm... Maybe Terramar's making it harder than it has to be.",
    "output": "Ocean Flow: Yoo-hoo! Princess! We're having a seashell-crafting circle. Care to join us?"
  },
  {
    "input": "Twilight Sparkle: Actually, we're right in the middle of—",
    "output": "Sky Beak: There you are! The flag-folding ceremony's about to begin!"
  },
  {
    "input": "Twilight Sparkle: Thank you, really. I've had a great time in both places today, but... Wow. This must be how Terramar feels all the time.",
    "output": "Ocean Flow: Oh! Hello, Sky Beak."
  },
  {
    "input": "Twilight Sparkle: Congratulations! Your first map mission is a success!",
    "output": "Sweetie Belle: Guess that means we're officially done here. I hope you come visit your sister in Equestria."
  },
  {
    "input": "Twilight Sparkle: Princess Celestia, I have an idea for your ones-versary.",
    "output": "Princess Celestia: My... \"ones-versary\"?"
  },
  {
    "input": "Twilight Sparkle: The one-thousand, one-hundred, eleventh year anniversary of when you first raised the sun.",
    "output": "Spike: Good thing Pinkie Pie reminded us, or we would have forgot to celebrate."
  },
  {
    "input": "Twilight Sparkle: To commemorate your first sunrise, I've written a play. We'd like to perform it at my School of Friendship, if you don't mind.",
    "output": "Princess Celestia: Mind? Oh! Of course not! Oh! I think a play is a fantastic idea!"
  },
  {
    "input": "Twilight Sparkle: I didn't know you used to act!",
    "output": "Princess Celestia: Oh, not me. I was always too busy with my magic lessons to be part of any plays myself. But still, it's something I always wished I could experience."
  },
  {
    "input": "Twilight Sparkle: And you still can! Princess Celestia, we would be honored if you would be the star of our play!",
    "output": "Spike: We would?!"
  },
  {
    "input": "Twilight Sparkle: If you'll excuse us for a second... Don't you see, Spike? It's perfect! Princess Celestia has always wanted to be in a play, and this one's about her!",
    "output": "Spike: I guess, but how are we supposed to give her directions? She's the ruler of Equestria!"
  },
  {
    "input": "Twilight Sparkle: She's also our friend. Celestia's always kind to everypony. So if we have a chance to finally do something for her, we should.",
    "output": "Spike: Hmmm..."
  },
  {
    "input": "Twilight Sparkle: Come on. How many times has Celestia helped us? Guided us? Been a warm, calming voice over our shoulder?",
    "output": "Princess Celestia: Twilight."
  },
  {
    "input": "Twilight Sparkle: Experience? Pssh! You'll be playing yourself. And we'll all help you. Please? It'd mean so much to the students if you were in our show.",
    "output": "Princess Celestia: Well, if you're sure..."
  },
  {
    "input": "Twilight Sparkle: Wonderful news, everypony!",
    "output": "Applejack: Yeehaw! We get to put on our show?"
  },
  {
    "input": "Twilight Sparkle: Even better. Princess Celestia is gonna be our star!",
    "output": "Spike: Yeah, that's how I felt, too."
  },
  {
    "input": "Twilight Sparkle: Well, she was a little nervous at first, but I told her not to worry. With us helping, it will all go smooth as—",
    "output": "Rarity: Silk! I must find the silk! If Celestia's going to be in our play, we have to take everything up to the next level! None of these old ideas will do!"
  },
  {
    "input": "Twilight Sparkle: I'm a princess. You talk to me.",
    "output": "Starlight Glimmer: That's different. You're not a \"princess\" princess."
  },
  {
    "input": "Twilight Sparkle: Uh, thanks. Celestia wants to experience the special friendship that theater ponies have. To give her that, you just need to be yourselves.",
    "output": "Fluttershy: You... You really think so?"
  },
  {
    "input": "Twilight Sparkle: Page one, act one, scene one. Action!",
    "output": "Fluttershy: Once upon a time, before Celestia, Equestria was suffering terrible hardship. Raising the sun every morning was so hard, it took five great sorcerers plus Star Swirl the Bearded to do it."
  },
  {
    "input": "Twilight Sparkle: Even I can't believe how good my play is! The sets, the props, the outfits – they're all great!",
    "output": "Spike: And... here comes the best part."
  },
  {
    "input": "Twilight Sparkle: Um, that's your cue, Celestia.",
    "output": "Princess Celestia: Oh! Uh, right! Of course! Heh. It is time for a new day in Equestria."
  },
  {
    "input": "Twilight Sparkle: And your delivery was... great! But maybe you should try it a tiny bit louder for the ponies in the back row.",
    "output": "Princess Celestia: Oh, yes, yes. My Royal Canterlot Voice. Thank you for the reminder, Twilight. It is time for a new day in Equestria!"
  },
  {
    "input": "Twilight Sparkle: No, no! You're doing... fine! Why don't we try it one more time? Just like you're talking to me.",
    "output": "Princess Celestia: It is time for a new day in Equestria-aaa."
  },
  {
    "input": "Twilight Sparkle: A bit more energy.",
    "output": "Princess Celestia: It's time for a new day in Equestria! Uh, how was that?"
  },
  {
    "input": "Twilight Sparkle: Great! Wow! It's hard to believe you've never done this before! Let's move onto the dance number!",
    "output": "Spike: Again! Step, buck, leap, touch! Again! Step, buck, leap, touch! Got it? Movin' on! Five, six, seven, eight!"
  },
  {
    "input": "Twilight Sparkle: What are we gonna do?! If I tell Celestia she's terrible, it'll hurt her feelings, and I'll be a bad friend. But if I keep her in the show, she'll be the laughingstock of Equestria, and I'll be a worse friend.",
    "output": "Applejack: Ya need to tell Celestia the truth, Twilight."
  },
  {
    "input": "Twilight Sparkle: Any other suggestions?",
    "output": "Spike: Why don't we just cancel the show?"
  },
  {
    "input": "Twilight Sparkle: Real suggestions?",
    "output": "Spike: No, think about it. Right now, most of Equestria doesn't even know we're doing a ones-versary play. If we shut it down..."
  },
  {
    "input": "Twilight Sparkle: You... did?",
    "output": "Rainbow Dash: Yeah! You should've seen how excited they got when they found out Celestia was in it! They said they'd tell their friends, and then their friends would tell their friends! Everypony in Equestria's gonna see this thing! Uh... did I miss something?"
  },
  {
    "input": "Twilight Sparkle: Just the bright light of hope being snuffed. But that's okay. If we can't cancel the show, I know what I have to do.",
    "output": "Applejack: Be honest with Celestia and give the lead role to somepony else?"
  },
  {
    "input": "Twilight Sparkle: Not a chance!",
    "output": "Applejack: Twilight, you know truth is a huge part of friendship."
  },
  {
    "input": "Twilight Sparkle: And so is making another pony's dreams come true. Look, I promised Celestia that this time, she could be a part of the play instead of just watching it. And I plan to keep that promise.",
    "output": "Fluttershy: But how?"
  },
  {
    "input": "Twilight Sparkle: No-no-no-no-no-no-no. More like a special workshop with other actors. To... take your performance from good to flawless.",
    "output": "Princess Celestia: Thank you so much, Twilight! This is what I always knew theater must be about – that special stage pony bond of shared trust and honesty."
  },
  {
    "input": "Twilight Sparkle: Princess Celestia, meet Method Mare performers On Stage and Raspberry Beret!",
    "output": "On Stage: Avec pleasure, your Majesty!"
  },
  {
    "input": "Twilight Sparkle: How's it going over here?",
    "output": "Rainbow Dash: That sun will never rise again."
  },
  {
    "input": "Twilight Sparkle: Please give me something to be happy about.",
    "output": "On Stage: Let's try visualization! And... you're skiing!"
  },
  {
    "input": "Twilight Sparkle: Do I wanna know?",
    "output": "Pinkie Pie: Wait for it..."
  },
  {
    "input": "Twilight Sparkle: What are they doing now?",
    "output": "Spike: The simplest acting exercise they could think of – a game of charades."
  },
  {
    "input": "Twilight Sparkle: Yeah!",
    "output": "Spike: Now, that's the best acting we've seen all day."
  },
  {
    "input": "Twilight Sparkle: Okay! I tried and tried and tried! But we have to face facts. We can't make Celestia an actress. So there's only one thing to do!",
    "output": "Applejack: Tell her the truth finally?"
  },
  {
    "input": "Twilight Sparkle: I've rewritten the script to give Celestia a more artistic part with no lines.",
    "output": "Pinkie Pie: And to make sure the show's a hit, I've whipped up the biggest, bestest, flashiest fake sun ever!"
  },
  {
    "input": "Twilight Sparkle: Uh, Pinkie? That looks unsafe.",
    "output": "Pinkie Pie: Why would untested magic fireworks that I bought in a back alley from Trixie at midnight be unsafe?"
  },
  {
    "input": "Twilight Sparkle: I can't take it anymore! It was supposed to be a simple play! Just one simple play! And then everything goes wrong, from the stage to the props, right down to the worst! Lead! Actress! In Equestria!",
    "output": "Princess Celestia: Twilight, if you honestly thought I was a bad actress, why didn't you tell me?"
  },
  {
    "input": "Twilight Sparkle: I-I'm so sorry! I didn't mean to insult your acting! It's just, I-I got so stressed! But... that's no excuse for what I said. You have every right to be upset with me.",
    "output": "Princess Celestia: I'm not upset because you insulted my acting."
  },
  {
    "input": "Twilight Sparkle: You're not?",
    "output": "Princess Celestia: I'm upset because, in all the time we've known each other, I thought I taught you about the importance of friendship, trust, and honesty!"
  },
  {
    "input": "Twilight Sparkle: Celestia, wait!",
    "output": "Pinkie Pie: No!"
  },
  {
    "input": "Twilight Sparkle: Princess Celestia! Please wait! Can we talk?",
    "output": "Princess Celestia: I'm afraid I haven't much to say, Twilight."
  },
  {
    "input": "Twilight Sparkle: All right then. Just listen. You've guided me since I was a filly. You've given me knowledge and advice and friendship. Just once, I wanted to be able to give something back to you. I know what I did was wrong. I should've told you the truth. But I promised you could be in our play. I had to make it work. Nothing would make me feel worse than knowing I disappointed you.",
    "output": "Princess Celestia: You really mean that?"
  },
  {
    "input": "Twilight Sparkle: Of course! I look up to you more than any pony I've ever met! I hate to let you down. Like I did.",
    "output": "Princess Celestia: You had good intentions, Twilight. But you know that the truth is always better than a well-meant lie. Didn't Applejack remind you?"
  },
  {
    "input": "Twilight Sparkle: About a hundred times. And now, because I didn't listen to her, I've ruined your whole ones-versary.",
    "output": "Princess Celestia: Well... I don't know about that. Isn't there an old saying? \"The show must go on\"? There may be a way for us to save the play yet."
  },
  {
    "input": "Twilight Sparkle: But how? I mean, if I'm being completely honest... you're not an actress.",
    "output": "Princess Celestia: No. But I am a princess."
  },
  {
    "input": "Twilight Sparkle: Oh, no! Hecklers! What should we do?",
    "output": "Princess Celestia: Spike! Improvise!"
  },
  {
    "input": "Twilight Sparkle: Ah! In all the commotion, we forgot we don't have a sun! What do we do?!",
    "output": "Princess Celestia: We play charades."
  },
  {
    "input": "Twilight Sparkle: Thank you for saving our play, Princess Celestia.",
    "output": "Princess Celestia: You're welcome, Twilight. But from now on, none of you will have to call me \"Princess\" anymore."
  },
  {
    "input": "Twilight Sparkle: Y-You... what?!",
    "output": "Princess Celestia: Gotcha! Maybe I'm not such a bad actress after all."
  },
  {
    "input": "Twilight Sparkle: You sure are. And it must be a special one. Nopony outside of Ponyville has ever been called before.",
    "output": "Spike: If you need some pointers, let me know. I've been on my fair share of missions."
  },
  {
    "input": "Twilight Sparkle: You've been on one, Spike.",
    "output": "Spike: And that's my fair share."
  },
  {
    "input": "Twilight Sparkle: And the Friendship School Teacher of the Month is... Fluttershy!",
    "output": "Applejack: Again?"
  },
  {
    "input": "Twilight Sparkle: Section one-forty-seven, paragraph two states that teamwork is a key part of friendship. And section two-two-nine, paragraph nine says outdoor activity reinforces learning. Add that together, and what do you get?",
    "output": "Pinkie Pie: Ooh, ooh! Okay, let me see. One-forty-seven, two-twenty-nine, carry the two... Three hundred and eighty-seven?"
  },
  {
    "input": "Twilight Sparkle: Mm-mm. A teamwork field trip. Leading it is a Teacher of the Month-type job, so I thought I'd ask—",
    "output": "Applejack: I'm your pony, Twilight! Sweet Apple Acres has taught me a thing or two about workin' together."
  },
  {
    "input": "Twilight Sparkle: Of course! Who better to model the importance of working as a team?",
    "output": "Pinkie Pie: Um, Rarity? Fluttershy? Me? Spike? This flowerpot?"
  },
  {
    "input": "Twilight Sparkle: Both of you are teamwork experts. If the students see the two of you teaching together, they'll learn even more. I know you've been competitive in the past, but I'm sure you'd never let that get in the way of friendship education.",
    "output": "Applejack: Of course!"
  },
  {
    "input": "Twilight Sparkle: All right, class. Today you'll learn how important working together is for building a strong friendship.",
    "output": "Applejack: Hey, y'all! Ready to get out there and do some learnin' the Apple family way?"
  },
  {
    "input": "Twilight Sparkle: And what teamwork activity do you two have planned for today?",
    "output": "Silverstream: No... way. We get to do both?!"
  },
  {
    "input": "Twilight Sparkle: I bet that's exactly what your teachers had in mind. Why don't you start with shed building first?",
    "output": "Applejack: Heh. Don't mind if I do! Everycreature, follow the leader!"
  },
  {
    "input": "Twilight Sparkle: I'll check in later to see how it's going. Remember to work together!",
    "output": "Applejack: Now take a good, deep breath. What do you smell?"
  },
  {
    "input": "Twilight Sparkle: How's the canoeing... going?",
    "output": "Smolder: About as good as the apple shed building."
  },
  {
    "input": "Twilight Sparkle: I can't believe this! You're not teaching teamwork! You're competing with each other! I thought you were past that!",
    "output": "Rainbow Dash: We are! Mostly."
  },
  {
    "input": "Twilight Sparkle: The Teacher of the Month wouldn't care about being the Teacher of the Month! I know Fluttershy would be thrilled to see another pony win. That's it! I'm taking over this field trip!",
    "output": "Applejack: H-Hold up, Twilight. Don't count Rainbow Dash for the award just yet. You shoulda seen her fire up those students to build a shed."
  },
  {
    "input": "Twilight Sparkle: Hmmm... Maybe you two have learned something, after all.",
    "output": "Applejack: Does that mean you'll give us another chance at the Teacher of the—"
  },
  {
    "input": "Twilight Sparkle: Well...",
    "output": "Rainbow Dash: Come on, Twilight. We get it. No more arguing. Right, Applejack?"
  },
  {
    "input": "Twilight Sparkle: Fine. But I'm picking the next activity you two lead. A nature walk. Nopony could possibly argue over that. Right?",
    "output": "Applejack''' and '''Rainbow Dash: Right!"
  },
  {
    "input": "Twilight Sparkle: Huh? How was the field trip? What did you all learn?",
    "output": "Rainbow Dash''' and '''Applejack: Uhhhh..."
  },
  {
    "input": "Twilight Sparkle: Really...?",
    "output": "Sandbar: It took us a while to get it."
  },
  {
    "input": "Twilight Sparkle: You were actually just competing the entire time, weren't you?",
    "output": "Applejack: To tell you the truth... yeah."
  },
  {
    "input": "Twilight Sparkle: I can't believe you're still asleep!",
    "output": "Spike: Just five more minutes..."
  },
  {
    "input": "Twilight Sparkle: It's nearly noon, and you promised to help me with my lecture for class today!",
    "output": "Spike: Noon? Whoa! I slept like a rock! Which reminds me – all that sleep probably cleared up my stone scale!"
  },
  {
    "input": "Twilight Sparkle: Spike, what are you doing?",
    "output": "Spike: Hiding from my hideous face!"
  },
  {
    "input": "Twilight Sparkle: I'm sure it feels terrible, but it's just a breakout. It's not the end of the world.",
    "output": "Spike: That's easy for you to say. Your face isn't covered in itchy red spots!"
  },
  {
    "input": "Twilight Sparkle: I used to get terrible breakouts any time I had a final exam with Celestia. Who probably never had a blemish her whole life.",
    "output": "Spike: Well, I'm not in magic school."
  },
  {
    "input": "Twilight Sparkle: No, but these things can be stress-related. And you did spend yesterday with Rarity.",
    "output": "Spike: What could possibly be stressful about that?"
  },
  {
    "input": "Twilight Sparkle: You could try Zecora. She makes a cream that—",
    "output": "Spike: Works wonders. I've heard. But I'm not leaving the castle until my face is back to its adorable self."
  },
  {
    "input": "Twilight Sparkle: My lecture!",
    "output": "Spike: I don't know what happened! I just had a sudden case of—"
  },
  {
    "input": "Twilight Sparkle: It's okay. I'm sure I can rewrite the lecture from my notes. I have a lot.",
    "output": "Spike: I can help you with—"
  },
  {
    "input": "Twilight Sparkle: Maybe you should leave the castle after all. And go somewhere less... flammable?",
    "output": "Spike: Hey there, not handsome."
  },
  {
    "input": "Twilight Sparkle: Spike, what are you doing?",
    "output": "Spike: If my stone scales didn't itch so much and we weren't in immediate danger, this would be really embarrassing!"
  },
  {
    "input": "Twilight Sparkle: Well, I was headed to Zecora's to get some cream for your scales. I had no idea you were—",
    "output": "Spike: About to be eaten by a giant predator attracted to my molt smell?!"
  },
  {
    "input": "Twilight Sparkle: Molt smell?",
    "output": "Rarity: Twilight!"
  },
  {
    "input": "Twilight Sparkle: Was that Rarity?",
    "output": "Spike: And Zecora! I tried to save them, but it's all I can do to stop scratching long enough to dive out of the way when that bird attacks!"
  },
  {
    "input": "Twilight Sparkle: Spike?! How did you get wings?!",
    "output": "Spike: I don't know! But they're pretty aweso– Whoa!"
  },
  {
    "input": "Twilight Sparkle: Do you think you can fly up and distract him while I work on freeing Zecora and Rarity?",
    "output": "Spike: Hey, giant chicken! If you like dragons so much, come and get me!"
  },
  {
    "input": "Twilight Sparkle: Spike!",
    "output": "Zecora: I know that the molt produced surprising things. But I'm glad that the last was a new pair of wings!"
  },
  {
    "input": "Twilight Sparkle: This is amazing! I didn't know if you'd ever get wings. I'm so happy for you. Does it have something to do with this molt you were talking about?",
    "output": "Spike: It's what's been going on with me. The breakout, the fire burps. The molt is when dragons get older and start to change. I wish I could stop it, but I can't. I-I should go."
  },
  {
    "input": "Twilight Sparkle: Go? What are you talking about?",
    "output": "Spike: In the Dragon Lands, families make molters leave home. It's called the molt effect."
  },
  {
    "input": "Twilight Sparkle: Well, this isn't the Dragon Lands, and molt effect or no, I don't want you going anywhere.",
    "output": "Spike: But I'm growing up. What if something even worse happens?"
  },
  {
    "input": "Twilight Sparkle: You're supposed to grow up, but you'll always be you. And whatever happens, we'll get through it together.",
    "output": "Spike: Woo-hoo! Yeah! Woo-hoo! Look at me! Let's go home!"
  },
  {
    "input": "Twilight Sparkle: Uh, I don't need to carry you anymore, do I? You have wings.",
    "output": "Spike: They are new, and I don't want to overdo it."
  },
  {
    "input": "Twilight Sparkle: Back in the days of Chancellor Puddinghead... Uh, Spike?",
    "output": "Spike: Huh? Sorry, Twilight. Still getting used to my new wings. They're pretty great, huh?"
  },
  {
    "input": "Twilight Sparkle: Yes, Spike. As I was saying... Huh? What are you three doing here?",
    "output": "Apple Bloom: We wanna go to your school!"
  },
  {
    "input": "Twilight Sparkle: But why?",
    "output": "Sweetie Belle: We wanna learn friendship!"
  },
  {
    "input": "Twilight Sparkle: I see. Why don't you three come with me? Spike, you're in charge.",
    "output": "Spike: Yes!"
  },
  {
    "input": "Twilight Sparkle: No, thanks, Starlight. I've got this.",
    "output": "Starlight Glimmer: Great. Well, I'll just... go dust my office for the seventieth time."
  },
  {
    "input": "Twilight Sparkle: I'm sorry to have to tell you this, but... you can't be my students.",
    "output": "Sweetie Belle: Why not?"
  },
  {
    "input": "Twilight Sparkle: Yes, but we teach friendship lessons here. You already know all about helping ponies in need and being there for each other.",
    "output": "Sweetie Belle: Can't you just give us a chance?"
  },
  {
    "input": "Twilight Sparkle: You need Cheerilee's classes, not mine. Hurry up. You don't want late marks on your permanent record.",
    "output": "Students: O dragon! My dragon!"
  },
  {
    "input": "Twilight Sparkle: Spike?! What did you do?",
    "output": "Scootaloo: Well, I'm not giving up! I know we can prove we belong in this school!"
  },
  {
    "input": "Twilight Sparkle: Ahem. I'd like to see you three in my office!",
    "output": "Scootaloo: I know we wanted to be invited inside, but it kinda went different in my head."
  },
  {
    "input": "Twilight Sparkle: I can't believe you'd do something like this!",
    "output": "Apple Bloom: Like what?"
  },
  {
    "input": "Twilight Sparkle: You are Cozy Glow's tutors, aren't you?",
    "output": "Scootaloo: We've been working with her for days!"
  },
  {
    "input": "Twilight Sparkle: That's what she told me. So you've been setting her up to fail?",
    "output": "Sweetie Belle''' and '''Scootaloo: What?!"
  },
  {
    "input": "Twilight Sparkle: I know you're upset that I won't let you come to my school, but to teach Cozy all the wrong things out of spite... That's just cruel!",
    "output": "Sweetie Belle: But we taught her all the right things!"
  },
  {
    "input": "Twilight Sparkle: Then how do you explain these friendship test answers? \"What are the six Elements of Harmony?\" Five turtlenecks and a cheese grater? \"Who is the Princess of Friendship?\" Your mom?",
    "output": "Apple Bloom: I... I don't understand."
  },
  {
    "input": "Twilight Sparkle: Me neither. I never thought you three would pull such a mean prank. I'm afraid I'm gonna have to ask you to stay away from my school. And my students.",
    "output": "Cozy Glow: Oh, no!"
  },
  {
    "input": "Twilight Sparkle: I know that. Now. Which is why I wanted to talk to you.",
    "output": "Sweetie Belle: Wait. So we're not in trouble?"
  },
  {
    "input": "Twilight Sparkle: Thank you, Cozy Glow. Honesty is one of the pillars of friendship. But you already know that. Which is why I'd like to give you these.",
    "output": "Applejack: They're honorary diplomas, makin' y'all official graduates of this here school."
  },
  {
    "input": "Twilight Sparkle: And if you're interested, I think Starlight has a place for you at my school after all.",
    "output": "Cutie Mark Crusaders: Woo-hoo!"
  },
  {
    "input": "Twilight Sparkle: I've been planning this retreat for weeks, and we're already ten minutes behind! Where is that photographer?!",
    "output": "Photographer: ...No-no-no-no-no-no-no!"
  },
  {
    "input": "Twilight Sparkle: Hmm. At least our retreat isn't too far behind schedule. Get ready for fun!",
    "output": "Rainbow Dash: Are we talking fun fun, or learning pretending to be fun?"
  },
  {
    "input": "Twilight Sparkle: Both! We've all been so busy teaching, we've hardly had a chance to hang out with each other. And I may have scheduled some friendship activities as well!",
    "output": "Pinkie Pie: Count me in! We can do friendship trust falls and pony pyramids! Oh! And hide and seek! Quick! Find me!"
  },
  {
    "input": "Twilight Sparkle: Right next to the Elements that brought us all together in the first place – the Tree of Harmony!",
    "output": "Queen Chrysalis: Listen to your queen! We must retrieve the Elements of Harmony!"
  },
  {
    "input": "Twilight Sparkle: Right. Roses. Fun. Now, let’s try and stay on schedule.",
    "output": "Rarity: Applejack, darling, anything in that wagon for mane maintenance?"
  },
  {
    "input": "Twilight Sparkle: Pinkie! If we keep stopping to have fun, we're never gonna get to the fun things I've got planned!",
    "output": "Pinkie Pie: Good point! Last one to the Tree of Harmony is a parasprite! Whoo-hoo!"
  },
  {
    "input": "Twilight Sparkle: Oh, fantastic. First Pinkie races ahead of us, and now Fluttershy's lost somewhere behind us. My retreat is off to a great start!",
    "output": "Rarity: It's not like Fluttershy to disappear like this."
  },
  {
    "input": "Twilight Sparkle: I'll find Pinkie Pie.",
    "output": "Mean Pinkie Pie: Bored. Bored. Bored."
  },
  {
    "input": "Twilight Sparkle: Pinkie! There you are! What are you doing?",
    "output": "Mean Pinkie Pie: You call that a pop?! Ugh!"
  },
  {
    "input": "Twilight Sparkle: I thought you were racing to the retreat.",
    "output": "Mean Pinkie Pie: Please. Why would I waste my time on a boring, lame, no-fun retreat?"
  },
  {
    "input": "Twilight Sparkle: What? Rainbow Dash! I think something's wrong with Pinkie!",
    "output": "Mean Rainbow Dash: Not my problem."
  },
  {
    "input": "Twilight Sparkle: Oh, great. You upset Fluttershy, too?",
    "output": "Pinkie Pie: You know what, Twilight? Maybe if you weren't so worried about schedules, you'd realize you're the one ruining the retreat for your friends!"
  },
  {
    "input": "Twilight Sparkle: Well, if my friends don't care about the retreat I planned for them... maybe they should've stayed home!",
    "output": "Fluttershy: Can't we all just get along?!"
  },
  {
    "input": "Twilight Sparkle: Of course I care about Fluttershy!",
    "output": "Pinkie Pie: Then you've got a super weird way of showing it!"
  },
  {
    "input": "Twilight Sparkle: Well, I'm sorry, Pinkie! If I knew you thought this was a \"boring, lame, no-fun retreat\", I wouldn't have invited you in the first place!",
    "output": "Pinkie Pie: I never said that!"
  },
  {
    "input": "Twilight Sparkle: Everypony, quiet! Listen. We know each other really well — the great stuff and how to get on each other's nerves, too. I wanted a fun trip with my friends. But instead, I got carried away with plans and ruined everything. If you want to forget it all and head home, I won't be offended. I just want us to stop fighting.",
    "output": "Applejack: Hey, sorry if I got carried away with all that campin' stuff."
  },
  {
    "input": "Twilight Sparkle: So... does that mean you still want to have the retreat?",
    "output": "All except Twilight Sparkle and Fluttershy: Yes!"
  },
  {
    "input": "Twilight Sparkle: Let's get to that Tree. I have the whole campsite set up and ready.",
    "output": "Mean Pinkie Pie: What's this garbage?"
  },
  {
    "input": "Twilight Sparkle: Are you kidding me?",
    "output": "Pinkie Pie: This was... the worst... day... ever!"
  },
  {
    "input": "Twilight Sparkle: Who can tell me what these are?",
    "output": "Sandbar: Whoa..."
  },
  {
    "input": "Twilight Sparkle: You're right, Ocellus. This is the Amulet of Aurora, the Talisman of Mirage, the Helm of Yksler, the Crown of Grover, Knuckerbocker's Shell, and Clover the Clever's Cloak.",
    "output": "Spike: And the gems are real! Eh, not that I... tasted them."
  },
  {
    "input": "Twilight Sparkle: Princess Celestia gifted these to our school, since they each represent one of the cultures our students come from. And we'll learn all about them in a Spell-venger Hunt!",
    "output": "Smolder: Is that a pony thing?"
  },
  {
    "input": "Twilight Sparkle: It's a magical scavenger hunt. Each of you will work in pairs to try to find where in the school these artifacts are hidden.",
    "output": "Spike: The team that finds the most wins a private tour of the Canterlot Archives with Princess Celestia."
  },
  {
    "input": "Twilight Sparkle: What? They'll make a great team.",
    "output": "Yona: Um, why pony glowing?"
  },
  {
    "input": "Twilight Sparkle: Wait. You all were called on this friendship quest, too?",
    "output": "Fluttershy: It must be a really important one."
  },
  {
    "input": "Twilight Sparkle: Don't worry, everypony. I already have a seventy-point plan in place for this very situation.",
    "output": "Starlight Glimmer: You want me to be headmare?!"
  },
  {
    "input": "Twilight Sparkle: You're the perfect choice! You're a good leader and an expert in friendship. I trust you to run this school exactly as I would.",
    "output": "Starlight Glimmer: Uh, that's a pretty big responsibility, Twilight."
  },
  {
    "input": "Twilight Sparkle: The curriculum, rules for the Spell-venger Hunt, dining hall menus for the next six months...",
    "output": "Spike: Six months?! You're not really gonna be gone that long, are you?"
  },
  {
    "input": "Twilight Sparkle: ...and Spike. Anything that isn't covered in my files, he'll be able to help you with.",
    "output": "Starlight Glimmer: Then why not put him in charge?"
  },
  {
    "input": "Twilight Sparkle: I knew I could count on you.",
    "output": "Starlight Glimmer: Great. What could possibly go wrong?"
  },
  {
    "input": "Twilight Sparkle: Discord! I can't believe you tricked us into going on a friendship quest that wasn't real!",
    "output": "Discord: Oh, back so soon?"
  },
  {
    "input": "Twilight Sparkle: Thanks for taking care of the school, Starlight.",
    "output": "Starlight Glimmer: It was a challenge. Heh. But I think things turned out just the way you'd have handled them."
  },
  {
    "input": "Twilight Sparkle: It's also about putting aside differences to come together, like the Earth ponies, Pegasi, and unicorns did on the first holiday.",
    "output": "Ocellus: Oh! Is that why you put their Fire of Friendship on top of the tree? To help us remember their unity?"
  },
  {
    "input": "Twilight Sparkle: And for those of you traveling outside Equestria...",
    "output": "Rainbow Dash: Yeah, shouldn't you guys be getting ready to go? If you miss that train, it's a really long walk."
  },
  {
    "input": "Twilight Sparkle: Go pack up, and we'll take you to the station.",
    "output": "Spike: It's that new bowtie I wanted, isn't it?"
  },
  {
    "input": "Twilight Sparkle: You'll have to wait and see.",
    "output": "Spike: I'm waiting! But in the meantime, I'm shaking!"
  },
  {
    "input": "Twilight Sparkle: Everything's ruined – that's what's happened!",
    "output": "Rainbow Dash: And I don't think it was an accident. Somepony was up here!"
  },
  {
    "input": "Twilight Sparkle: Outside!",
    "output": "Spike: That's the students' quarters!"
  },
  {
    "input": "Twilight Sparkle: Hello? Is anypony there?",
    "output": "Rainbow Dash: I'll check the back door!"
  },
  {
    "input": "Twilight Sparkle: Has anycreature come in here?",
    "output": "Smolder: Well, yeah. All of us did. To pack? Like you told us to?"
  },
  {
    "input": "Twilight Sparkle: But whoever did it had to have come in here! We saw them!",
    "output": "Ocellus: Whoever did what?"
  },
  {
    "input": "Twilight Sparkle: Come on, Spike. Looks like we have to— Spike, you can open your eyes.",
    "output": "Spike: What? Oh!"
  },
  {
    "input": "Twilight Sparkle: But since nocreature took responsibility for this mess, you're all gonna have to help clean it up before you can go home.",
    "output": "Smolder: Why do I have to stay?!"
  },
  {
    "input": "Twilight Sparkle: While you're cleaning, we'll bring you into my office one at a time. Since honesty is one of the Elements of Harmony, we want to give you each a chance to tell us the truth.",
    "output": "Rainbow Dash: And once we find out who did it, just you wait! We're gonna...! We'll...! What are we gonna do exactly?"
  },
  {
    "input": "Twilight Sparkle: The guilty party won't be going home over Hearth's Warming break. She or he will stay here for some one-on-one friendship lessons.",
    "output": "Silverstream: But what if none of us confesses?"
  },
  {
    "input": "Twilight Sparkle: All right, let's get to the bottom of this. Who wants to be interviewed first?",
    "output": "Gallus: Eh. I'll go. Beats mop duty."
  },
  {
    "input": "Twilight Sparkle: Ocellus? Your turn.",
    "output": "Silverstream: What happened?"
  },
  {
    "input": "Twilight Sparkle: You don't have to. We already know.",
    "output": "Rainbow Dash: We kinda guessed it was you. But we wanted to give you the chance to tell the truth."
  },
  {
    "input": "Twilight Sparkle: I'm proud that you did, and I'm glad to see you've been paying attention in Professor Applejack's honesty classes. But you're still going to have to make amends and stay over break for extra friendship lessons by yourself.",
    "output": "Silverstream: I'll stay with him."
  },
  {
    "input": "Twilight Sparkle: After we finish cleaning up.",
    "output": "Sandbar: Hey, this reminds me of another story! \"The Time I Almost Spilled Grape Juice on the White Couch\"!"
  },
  {
    "input": "Twilight Sparkle: \"I hope you find these postcards enjoyable, and I look forward to seeing you again, though I can't say when my journey will be complete. Your friend, Star Swirl.\"",
    "output": "Rarity: It must be gratifying to have your idol writing to you about the friendship lessons he's learning."
  },
  {
    "input": "Twilight Sparkle: I'm not sure I'll ever get used to it. Of course, if he really wants to learn about friendship, he could just come to our school.",
    "output": "Cozy Glow: Professor Sparkle? The mailpony just came with, uh, a few things."
  },
  {
    "input": "Twilight Sparkle: It's not that. It's this!",
    "output": "Rarity: \"Why waste your time at a friendship school that's just a school? Learn everything they teach and more at Friendship University\"?!"
  },
  {
    "input": "Twilight Sparkle: Who would open another friendship school?",
    "output": "Rarity: Oh, pfft! I'm sure it's nothing to worry about. You're the Princess of Friendship. What could this other school possibly offer?"
  },
  {
    "input": "Twilight Sparkle: There's more ponies in here than at our whole school. Who is running this place?",
    "output": "Flim: Welcome, friends! You are about to embark on a journey of amazing magnitude! One that will change your lives forever!"
  },
  {
    "input": "Twilight Sparkle: Accredited?",
    "output": "Flam: It means officially recognized or authorized."
  },
  {
    "input": "Twilight Sparkle: Chancellor Neighsay?!",
    "output": "Chancellor Neighsay: The Equestria Educational Association has taken an interest in institutions that teach friendship in a pony-first environment. Surely you didn't think your school has a monopoly on the concept?"
  },
  {
    "input": "Twilight Sparkle: How could they use friendship as a weapon?!",
    "output": "Chancellor Neighsay: You tell me. It's your book. Meantime, this university appears to be a promising option for ponies who'd prefer to stick to the EEA book on the subject."
  },
  {
    "input": "Twilight Sparkle: You can't be serious. They're obviously up to something. It's Flim and Flam!",
    "output": "Flim: Well, that certainly wasn't friendly."
  },
  {
    "input": "Twilight Sparkle: I— No! What?! I-I am not!",
    "output": "Audience Pony: I did think the Princess of Friendship would be friendlier."
  },
  {
    "input": "Twilight Sparkle: I'm sorry, but approval from the EEA won't convince me that this school is what you promise.",
    "output": "Flim: And what would it take to convince you?"
  },
  {
    "input": "Twilight Sparkle: Well, somepony whose opinion I respect, for one.",
    "output": "Flim: Really? Somepony like... this?"
  },
  {
    "input": "Twilight Sparkle: Star Swirl? What are you doing here?",
    "output": "Star Swirl the Bearded: Why, studying friendship at Flim and Flam's wonderful school!"
  },
  {
    "input": "Twilight Sparkle: I... I don't understand. Why would you come here and not my school?",
    "output": "Star Swirl the Bearded: My travels brought me to Las Pegasus. I didn't come for the school, but Flim and Flam convinced me to try it out."
  },
  {
    "input": "Twilight Sparkle: You can't trust Flim and Flam! They tried to con the Apples out of their farm! They sold fake health tonic! They run a resort in Las Pegasus!",
    "output": "Flam: Technically, our resort is a legitimate business."
  },
  {
    "input": "Twilight Sparkle: I wish I could believe that.",
    "output": "Star Swirl the Bearded: Besides, what's untrustworthy about opening a school of friendship? They don't even charge for classes."
  },
  {
    "input": "Twilight Sparkle: I don't know. But I know they're up to something. And until I find out, I'm begging you, come to my school instead.",
    "output": "Chancellor Neighsay: I understand feeling threatened by competition, but my word, Princess. I wonder if the ill manners of the creatures at your school aren't contagious. I think I will take my leave before I become infected."
  },
  {
    "input": "Twilight Sparkle: You don't think they're running an actual friendship school, do you?",
    "output": "Rarity: Darling, of course not. Which is why we have to investigate!"
  },
  {
    "input": "Twilight Sparkle: But we can't go poking around the school. Everypony'll think I'm still just \"threatened by the competition\".",
    "output": "Rarity: Only if we do it as ourselves."
  },
  {
    "input": "Twilight Sparkle: I don't know, Rarity.",
    "output": "Rarity: Ah-ah. What did I say about using our real names?"
  },
  {
    "input": "Twilight Sparkle: Sorry, \"Plainity\". But I'm pretty sure this isn't enough of a disguise.",
    "output": "\"Polo Play\": Hey, strangers! Are you two new here?"
  },
  {
    "input": "Twilight Sparkle: My name's Eyepatch. I have an eye patch.",
    "output": "Rarity: Perfect! Now, how do we start our investigation?"
  },
  {
    "input": "Twilight Sparkle: I think we should split up. You enroll in some classes and find out what they're actually teaching. I'll look around and see what I can find, assuming I'm not recognized.",
    "output": "Flam: Welcome, newest students! Let's dive right in, shall we? One of the most important elements of friendship is being thoughtful. True or false?"
  },
  {
    "input": "Twilight Sparkle: \"The Element of Laughter and its applications.\" Okay, that seems pretty genuine. \"When to support your friends' decisions and when to talk sense.\" Huh. That's actually kind of interesting. Aha! \"Friendship University's true goal... is to help friends become better friends\"? Where is the proof that it's all a scam?",
    "output": "Flam: There isn't any!"
  },
  {
    "input": "Twilight Sparkle: No, I didn't!",
    "output": "Flam: Well, then we agree that everypony will recognize the Princess of Friendship in this photo of you sneaking into our office."
  },
  {
    "input": "Twilight Sparkle: I'm not envious! I know these two are up to something. I'm just trying to find out what.",
    "output": "Star Swirl the Bearded: The only pony I see who is up to something is the pony in this picture, and it is not the princess I know."
  },
  {
    "input": "Twilight Sparkle: You could say that. Flim and Flam took a picture of me sneaking into their office.",
    "output": "Rarity: Were we wearing our eye patch?"
  },
  {
    "input": "Twilight Sparkle: If I don't stop investigating, they're going to tell everypony that I'm trying to sabotage their school because I'm jealous.",
    "output": "Rarity: But-But-But that's ridiculous!"
  },
  {
    "input": "Twilight Sparkle: I don't know. Maybe I am just upset that Star Swirl came here instead of my school. Flim and Flam may have turned over a new leaf. We should probably just go home.",
    "output": "Rarity: Twilight, you are not the kind of pony to let your emotions cloud your judgment. If you think Flim and Flam are up to no good, you can't give up, even if their lessons really are impressive."
  },
  {
    "input": "Twilight Sparkle: Wait, what?!",
    "output": "Rarity: Which reminds me. Can you get a message to Spike? I want to return those sewing machines. I need the bits if I'm going to keep advancing here. Tuition's free, but the worksheets sure aren't."
  },
  {
    "input": "Twilight Sparkle: Flim and Flam are charging for these?",
    "output": "Rarity: Well, they have to cover expenses, and Flam insists that everything extra goes to improving the school and—"
  },
  {
    "input": "Twilight Sparkle: Let's find out.",
    "output": "Star Swirl the Bearded: These lessons are so valuable. Are you sure I can't give you more?"
  },
  {
    "input": "Twilight Sparkle: My reputation isn't worth much if I won't risk it for what I think is right. Besides, I have a plan.",
    "output": "Flim: Well, brother of mine, we've got almost all the bits we need to expand our resort. If we add another level of classes and worksheets, we'll be there."
  },
  {
    "input": "Twilight Sparkle: But shouldn't it go closer to the pudding hot tub here?",
    "output": "Flim: Fair point, but— What?!"
  },
  {
    "input": "Twilight Sparkle: I knew your school was a scam!",
    "output": "Flim: Well, well, well, if it isn't the Princess of Jealousy. I guess we'll be going to the papers after all."
  },
  {
    "input": "Twilight Sparkle: And I suppose I'll just lead your students into this secret room of bits and resort expansion plans!",
    "output": "Flam: Uhhhh... l-let's not get hasty. You have something on us. We have something on you. Let's just call it even."
  },
  {
    "input": "Twilight Sparkle: I don't think so. You can destroy my reputation if you want, but using your students' bits to expand your resort is wrong, even if the lessons you teach are good ones.",
    "output": "Flam: Of course they're good. We copied them from your book."
  },
  {
    "input": "Twilight Sparkle: Fine. If you really want to call it even, give back the bits and stop charging for my lessons. Then you can teach them as much as you like.",
    "output": "Flim''' and '''Flam: Nah!"
  },
  {
    "input": "Twilight Sparkle: \"Of course, if I ever go to a school again, I'll make sure it's yours. In friendship, Star Swirl.\"",
    "output": "Rarity: I still don't understand how Flim and Flam could have gotten a copy of your book."
  },
  {
    "input": "Twilight Sparkle: You both are. Because together, you perfectly demonstrate my lesson on compromise in friendship. Rainbow Dash and Rarity have very different interests that keep them busy. But being friends is so important to them, they always manage to make time for each other.",
    "output": "Rarity: Our day of fun was hard to plan, what with Rainbow Dash's extremely time-consuming and erratically scheduled Wonderbolts practice."
  },
  {
    "input": "Twilight Sparkle: Thanks for stopping by! Enjoy your day of fun!",
    "output": "Silverstream: Ooh! Ooh-ooh-ooh-ooh! What amazing stuff are you gonna do together?!"
  },
  {
    "input": "Twilight Sparkle: Even though Rainbow Dash and Rarity enjoy doing different things, there are plenty of reasons why they're friends.",
    "output": "Yona: Uh, like what?"
  },
  {
    "input": "Twilight Sparkle: Just go about your day of fun as you normally would. You won't even know we're here!",
    "output": "Rainbow Dash: Game on!"
  },
  {
    "input": "Twilight Sparkle: Uhhh, see? They did something Rainbow Dash likes, so now it's time for something Rarity likes. Compromise!",
    "output": "Rarity: Hmmm... I'm genuinely not sure. Are they too in style?"
  },
  {
    "input": "Twilight Sparkle: Rainbow Dash and Rarity are just, uh, showcasing an aspect of friendship called \"banter\", the playful and friendly exchange of remarks. It's all in good fun.",
    "output": "Rarity: Ooh, I cannot wait! Collecting gemstones is my favorite!"
  },
  {
    "input": "Twilight Sparkle: See, everycreature? That didn't take long. Now they're having a great time together.",
    "output": "Rarity: Ooh! Magnifique! This will be perfect for the emerald-encrusted romper I've been working on!"
  },
  {
    "input": "Twilight Sparkle: Uh-oh.",
    "output": "Rarity: That... is... it! This \"day of fun\" is officially over!"
  },
  {
    "input": "Twilight Sparkle: Surely, you don't mean that. You're just having a little disagreement. Sometimes that happens between pals. But no matter what, they can always get past the problem and stay good friends.",
    "output": "Rainbow Dash: I don't think we can. You don't care about any of the things I like! It's always about you and your boring fashions!"
  },
  {
    "input": "Twilight Sparkle: No! It's goooone!",
    "output": "Rainbow Dash: What's gone?"
  },
  {
    "input": "Twilight Sparkle: The Amulet of Aurora!",
    "output": "Rarity: One of the magical items you've been keeping for Princess Celestia?"
  },
  {
    "input": "Twilight Sparkle: That amulet can reverse the tides and summon tsunamis! If it falls into the wrong hooves, Equestria will be in grave danger!",
    "output": "Rainbow Dash: Don't worry, Twilight! I know tons about searching for lost treasure!"
  },
  {
    "input": "Twilight Sparkle: Thank you! I'll feel so much better knowing you two are looking for it together!",
    "output": "Starlight Glimmer: While we work on a locator spell. It's the perfect solution!"
  },
  {
    "input": "Twilight Sparkle: Not exactly.",
    "output": "Rarity: You mean, this was a setup to make us get along?"
  },
  {
    "input": "Twilight Sparkle: See? Good friends always work through their differences.",
    "output": "Starlight Glimmer: Even if it takes a little help."
  },
  {
    "input": "Twilight Sparkle: It's called a yovidaphone. It's from Yakyakistan, where it's actually quite popular.",
    "output": "Rainbow Dash: Is it supposed to sound like that?"
  },
  {
    "input": "Twilight Sparkle: Not exactly. It's known to produce a fairly complicated, melodically rich, and harmonious tone.",
    "output": "Rainbow Dash: Are you sure we're talking about the same thing?"
  },
  {
    "input": "Twilight Sparkle: Oh, I don't think that's necessary, Pinkie.",
    "output": "Rainbow Dash: Please. Don't."
  },
  {
    "input": "Twilight Sparkle: Well, I, for one, am glad you're having so much fun with your new hobby.",
    "output": "Pinkie Pie: Uh-huh. Sure."
  },
  {
    "input": "Twilight Sparkle: And it's great that you're learning a new skill, and... and you're just waiting for me to finish talking so you can start playing again, aren't ya?",
    "output": "Pinkie Pie: No! But if you're done... And a-one, and a-two, and a-I know what to do!"
  },
  {
    "input": "Twilight Sparkle: Okay, so maybe she isn't good yet. But she's our friend, and we should be supportive.",
    "output": "Applejack: She just started playin'. She's bound to get better. Right?"
  },
  {
    "input": "Twilight Sparkle: You're absolutely right, Spike. Sometimes it is nice to get out of the library and be in the sun.",
    "output": "Spike: Especially when you take the library with you."
  },
  {
    "input": "Twilight Sparkle: Is it really that bad?",
    "output": "Rainbow Dash: Does this answer your question?"
  },
  {
    "input": "Twilight Sparkle: Uh, a trophy?",
    "output": "Rainbow Dash: For second place. Second! Place! All because of Pinkie's playing!"
  },
  {
    "input": "Twilight Sparkle: Okay, maybe we can just pretend she's really good, and then I'll find a spell that will—",
    "output": "Applejack: Oh, no, no, no! We're not goin' through that again! Remember how well it worked out when you weren't honest with Celestia about her actin' ability?"
  },
  {
    "input": "Twilight Sparkle: You're right. We'll just have to tell Pinkie Pie she's not very good at the yovidaphone.",
    "output": "Rarity: Well, there's no time like the present."
  },
  {
    "input": "Twilight Sparkle: Pinkie, we all support you, but we're afraid you're just not good at the yovidaphone, and none of us want you to waste your time on something you can't do well.",
    "output": "Pinkie Pie: Oh. Why didn't you just say so?"
  },
  {
    "input": "Twilight Sparkle: Another beautiful day in Ponyville.",
    "output": "Spike: Uh, Twilight, when was the last time you saw Pinkie Pie?"
  },
  {
    "input": "Twilight Sparkle: Hmmm, not since we told her to stop playing the yovidaphone. I'm still surprised with how well she took it.",
    "output": "Spike: I don't think she took it as well as you think she took it."
  },
  {
    "input": "Twilight Sparkle: That's not good.",
    "output": "Rainbow Dash: There you are! We've been looking all over for you!"
  },
  {
    "input": "Twilight Sparkle: I saw.",
    "output": "Spike: There's gotta be something we can do."
  },
  {
    "input": "Twilight Sparkle: I'm sure there is, Spike. We just have to figure out what.",
    "output": "Rainbow Dash: I don't get it. So she's no good at playing the yovidaphone. What's the big deal? There are so many other things she's really good at doing."
  },
  {
    "input": "Twilight Sparkle: And that's exactly what we'll show her! I bet if we get her to do the stuff she likes and is good at doing, she'll cheer right back up and forget all about the yovidaphone.",
    "output": "Applejack: Hoo-whee! That's a great idea!"
  },
  {
    "input": "Twilight Sparkle: So, I'm guessing nopony had any success?",
    "output": "Applejack: My party cannon idea was a real dud."
  },
  {
    "input": "Twilight Sparkle: Well, not to worry. I came up with the perfect solution. Instead of trying to remind her what she's good at, we'll remind her what she's best at. And that's being our friend. We're gonna throw her a Pinkie Pie Appreciation Party!",
    "output": "Fluttershy: That's a wonderful idea! If anypony needs to know how much she's appreciated, it's Pinkie Pie."
  },
  {
    "input": "Twilight Sparkle: Then I hereby officially declare today Pinkie Pie Appreciation Day!",
    "output": "Rarity: Now this is perfection!"
  },
  {
    "input": "Twilight Sparkle: No need. Gummy's on it. In fact, there he is now!",
    "output": "Applejack: Uh, Gummy? You were supposed to bring Pinkie Pie. What happened?"
  },
  {
    "input": "Twilight Sparkle: Fluttershy, can you understand what he's saying?",
    "output": "Fluttershy: I could... if he was talking."
  },
  {
    "input": "Twilight Sparkle: Maybe we should just go and get her.",
    "output": "Applejack: What in tarnation is goin' on here?!"
  },
  {
    "input": "Twilight Sparkle: Um, Maud? Can I ask you a question?",
    "output": "Maud Pie: You just did."
  },
  {
    "input": "Twilight Sparkle: Okay, let's try this a different way. Why did you pack up all of Pinkie's things?",
    "output": "Maud Pie: She asked me to."
  },
  {
    "input": "Twilight Sparkle: Maud, I don't understand. Why would Pinkie leave Ponyville?",
    "output": "Rainbow Dash: Yeah! Why would she want to go live with the yaks?"
  },
  {
    "input": "Twilight Sparkle: We can't just march up there and tell Pinkie what to do.",
    "output": "Fluttershy: But... we didn't even get a chance to say goodbye!"
  },
  {
    "input": "Twilight Sparkle: Well, we may not be able to go to Yakyakistan and force her to come home, but we could go say goodbye... and if we happen to mention how much her friendship means to us, and how much we'd miss her if she were gone forever, and then she decided to come back home on her own...",
    "output": "Rainbow Dash: Then what are we waiting around here for?! Let's get going to Yakyakistan!"
  },
  {
    "input": "Twilight Sparkle: We're almost there.",
    "output": "Applejack: Pinkie's gotta be around here somewhere."
  },
  {
    "input": "Twilight Sparkle: The music of the yovidaphone.",
    "output": "Rainbow Dash: Are you sure? Because that actually sounds kinda... good."
  },
  {
    "input": "Twilight Sparkle: Oh, I'm sure. Come on.",
    "output": "Rainbow Dash: Huh. Not what I expected."
  },
  {
    "input": "Twilight Sparkle: Pardon me!",
    "output": "Applejack: Excuse us."
  },
  {
    "input": "Twilight Sparkle: Maybe we can help with that.",
    "output": "Pinkie Pie: Oh. Hey. What are you guys doing here?"
  },
  {
    "input": "Twilight Sparkle: But we just wanted to remind you how much you mean to us, and how much we'd miss you if you decided to move here for—",
    "output": "Pinkie Pie: Fine. I'll move back to Ponyville."
  },
  {
    "input": "Twilight Sparkle: Pinkie, what's wrong?",
    "output": "Pinkie Pie: That's what's wrong. I thought coming here and listening to real yovidaphone playing would make me happy."
  },
  {
    "input": "Twilight Sparkle: Playing it makes you so happy.",
    "output": "Pinkie Pie: It sure does. I mean... it did."
  },
  {
    "input": "Twilight Sparkle: Then you should never stop.",
    "output": "Rarity: So say we all!"
  },
  {
    "input": "Twilight Sparkle: And we were wrong.",
    "output": "Fluttershy: Playing makes you happy."
  },
  {
    "input": "Twilight Sparkle: And a-one...",
    "output": "Applejack''' and '''Rarity: And a-two..."
  },
  {
    "input": "Twilight Sparkle: Trixie, that was an amazing show!",
    "output": "Princess Cadance: Flurry Heart and I loved it! I'm so glad we decided to come. You two have a real chemistry."
  },
  {
    "input": "Twilight Sparkle: Of course it was! There's nothing better than a bond with another pony. You can share all kinds of things.",
    "output": "Twilight Sparkle''' and '''Princess Cadance: Sunshine, sunshine, ladybugs awake! Clap your hooves and do a little shake!"
  },
  {
    "input": "Twilight Sparkle: Wow! They do look pretty amazing... uh, -ly unamazing. Trying so hard to look amazing is what I mean.",
    "output": "Pinkie Pie: Nice save, Twilight!"
  },
  {
    "input": "Twilight Sparkle: Sorry. I was just... um...",
    "output": "Rainbow Dash: Please tell me you got that stuff so you could rip it up and throw it off a cliff."
  },
  {
    "input": "Twilight Sparkle: They were doing an autograph session before practice.",
    "output": "Rainbow Dash: Seriously?! You haven't seen Scoot, have you?"
  },
  {
    "input": "Twilight Sparkle: Actually...",
    "output": "Rainbow Dash: I can't believe Scootaloo ditched me to watch them practice! Why can't she see how dangerous they are?!"
  },
  {
    "input": "Twilight Sparkle: That's kind of the whole draw. It's exciting.",
    "output": "Rainbow Dash: But it's like the harder I try to convince Scoot they're dangerous, the more she likes them!"
  },
  {
    "input": "Twilight Sparkle: You can't control her actions. Only yours. Teach her what's safe and what isn't, like a good role model. Then hope she makes the right decisions.",
    "output": "Rainbow Dash: But what if she chooses them over me? She's gonna get hurt!"
  },
  {
    "input": "Twilight Sparkle: I think I know somepony else who might get hurt if that happens.",
    "output": "Rainbow Dash: Um, maybe you're right. But this isn't about me. I'm just worried about Scoot."
  },
  {
    "input": "Twilight Sparkle: That was awfully specific.",
    "output": "Lightning Dust: That's 'cause it's what she'll be doing in the show tonight. Half off for princesses! Bring your friends!"
  },
  {
    "input": "Twilight Sparkle: Scootaloo, are you sure that's what you really wanna do?",
    "output": "Scootaloo: Absolutely. And there's nothing you can do to stop me!"
  },
  {
    "input": "Twilight Sparkle: Of course, Professor Fossil! We'd be honored to have a Pillar of Equestria on our staff!",
    "output": "Professor Fossil: Oh, thank Celestia."
  },
  {
    "input": "Twilight Sparkle: So, join me in welcoming Professor Rockhoof to our faculty!",
    "output": "Rockhoof: Thank you! Thank you, all! I know I'm new to your world, but there's one thing I learned when I saved my village from a rushing river of hot lava. There's nothing you can't do with hard work. And a shovel!"
  },
  {
    "input": "Twilight Sparkle: So, um... everycreature dismissed. We'll... see you in class!",
    "output": "Smolder: You think that new pony is gonna be the weirdest teacher at school or just one of the weirdest?"
  },
  {
    "input": "Twilight Sparkle: From what Professor Fossil said, it sounds like Rockhoof just hasn't settled into modern times yet. Our school is the perfect place for that. Plus, we get a new teacher.",
    "output": "Applejack: This may be the fastest friendship problem you ever solved."
  },
  {
    "input": "Twilight Sparkle: Uh, Professor Rockhoof?",
    "output": "Rockhoof: Nope! Guess again! Uh, oops."
  },
  {
    "input": "Twilight Sparkle: Our school is about finding your own special way to teach.",
    "output": "Applejack: And we can already tell you're a... smash with the class."
  },
  {
    "input": "Twilight Sparkle: But maybe you could do a little less smashing in the classroom?",
    "output": "Rockhoof: Sorry about that. I did get a bit carried away. The students were so interested in my tale."
  },
  {
    "input": "Twilight Sparkle: I know it's a big change. But I think you're gonna fit in just—",
    "output": "Rockhoof: Fire!"
  },
  {
    "input": "Twilight Sparkle: Rockhoof, wait!",
    "output": "Rockhoof: No time! The building's ablaze! We have to get everypony out!"
  },
  {
    "input": "Twilight Sparkle: What are you doing?!",
    "output": "Rockhoof: Savin' the school!"
  },
  {
    "input": "Twilight Sparkle: They do it all the time. That's what we were trying to tell you.",
    "output": "Applejack: We know you're used to bein' a hero, Rockhoof. Only what we need here is a teacher."
  },
  {
    "input": "Twilight Sparkle: So apparently, finding Rockhoof a new job is a lot harder than we thought. Has anypony had any luck?",
    "output": "Applejack: I-I thought you were gonna try him out at the post office."
  },
  {
    "input": "Twilight Sparkle: We did.",
    "output": "Rockhoof: Do you know where I can find Cranky Doodle Donkey?! I need to deliver his medicine! He has a rash in a very embarrassing place!"
  },
  {
    "input": "Twilight Sparkle: Great idea! Rockhoof's old friends would be happy to help. And I bet he'd love to visit them.",
    "output": "Rockhoof: Even Canterlot looks different from the old days."
  },
  {
    "input": "Twilight Sparkle: Princess Celestia was happy to find a new drill sergeant for her guard!",
    "output": "Rockhoof: Uh... that's great. She really put you in a job that big so soon?"
  },
  {
    "input": "Twilight Sparkle: Your work is beautiful.",
    "output": "Mistmane: Oh, thank you. I've never worked with crystal before, but in my heart, I know I'm where I belong."
  },
  {
    "input": "Twilight Sparkle: Somnambula's a motivational speaker. Bet they didn't even have those back in your time.",
    "output": "Rockhoof: Because we didn't need them. Ponies knew what to do with their lives."
  },
  {
    "input": "Twilight Sparkle: Rockhoof? Where are you going?",
    "output": "Rockhoof: I'm not sure. Maybe I just don't belong in this modern world."
  },
  {
    "input": "Twilight Sparkle: Hmm. I might know just the thing.",
    "output": "Rockhoof: I'm honored to serve in the Hippogriff Navy, General Seaspray! I promise I'll prove my worth."
  },
  {
    "input": "Twilight Sparkle: Maybe they just like cruises?",
    "output": "Hippogriff Sailor: General! The fog's too thick to see our way out of the harbor!"
  },
  {
    "input": "Twilight Sparkle: Oh, no. Stars can move slowly over time. They must look different now than over a thousand years ago.",
    "output": "Seaspray: It was an honor serving with you, Rockhoof. But it seems our paths lie in different directions."
  },
  {
    "input": "Twilight Sparkle: Hey, mistakes happen. We'll think of something else for you to do.",
    "output": "Rockhoof: Oh, there's no need, lass. I already know what I want to do next."
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "Rockhoof: Yes!"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "Rockhoof: Aye!"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "Rockhoof: Aye!"
  },
  {
    "input": "Twilight Sparkle: Rockhoof wants me to cast a spell to turn him into a statue! The answer is no!",
    "output": "Rockhoof: Well, it should be \"aye\", because I wouldn't even be here to be turned into a statue if Twilight hadn't cast a spell in the first place!"
  },
  {
    "input": "Twilight Sparkle: The answer is still no! Why would you want to be turned into stone?",
    "output": "Rockhoof: Because I'm a relic of a bygone age. I belong in a museum. Safe. Preserved. Untouched. I don't belong in this time. It's up to you to make that right."
  },
  {
    "input": "Twilight Sparkle: But there has to be a better way!",
    "output": "Rockhoof: Twilight, please understand. I want to be remembered as the hero I was, not the disappointment I've become."
  },
  {
    "input": "Twilight Sparkle: But you're not! Rockhoof, wait! Spike, can you teach my class today?",
    "output": "Spike: Uh, you're not really going to turn him to stone, are you?"
  },
  {
    "input": "Twilight Sparkle: Only because it's temporary. As soon as I think of a new solution, we'll wake Rockhoof up. I know he has more to offer the world as a pony than a statue.",
    "output": "Sandbar: Did you hear Rockhoof caught all the bees in the Everfree Forest and gave 'em to Zecora as a gift?"
  },
  {
    "input": "Twilight Sparkle: Okay, I have the spell. But will you please reconsider? Rockhoof?",
    "output": "Rockhoof: The ursa major tried to grab me by the gullet! But I ducked her claws!"
  },
  {
    "input": "Twilight Sparkle: Wait. You said there wasn't anything in this time you were good at. What about telling stories?",
    "output": "Rockhoof: It was just a tall tale."
  },
  {
    "input": "Twilight Sparkle: One that captured the hearts and imagination of everycreature here.",
    "output": "Yona: Plus, pony story super fun!"
  },
  {
    "input": "Twilight Sparkle: As the Princess of Friendship, I'd like to appoint you as Equestria's official keeper of tales!",
    "output": "Spike: Can you do that?"
  },
  {
    "input": "Twilight Sparkle: Eh.",
    "output": "Rockhoof: I, uh... That's very kind of you. But I still think these old bones are more suited to a museum display."
  },
  {
    "input": "Twilight Sparkle: You are a living record of our history. Your stories can inspire and teach generations to come. If you're a statue, that's all lost.",
    "output": "Rockhoof: But will I ever really belong in your world?"
  },
  {
    "input": "Twilight Sparkle: The Tree of Harmony remains one of the most powerful sources of magic known to ponydom. And though it has been at the \"root\" of magic and friendship from the moment it was planted, its ways are mysterious. Almost as if it has a mind of its own.",
    "output": "Smolder: Mind? It's a tree."
  },
  {
    "input": "Twilight Sparkle: A tree that grew a castle.",
    "output": "Silverstream: Was that before or after Discord made chocolate rain?"
  },
  {
    "input": "Twilight Sparkle: Remember! Study groups are both fun and effective!",
    "output": "Sandbar: So, who wants to study together?"
  },
  {
    "input": "Twilight Sparkle: I can't believe you two are going on a friendship quest! This is amazing!",
    "output": "Applejack: What do you mean, Twilight? We've been on one together before."
  },
  {
    "input": "Twilight Sparkle: Exactly! This is the first time the map has teamed up the same ponies for a second quest!",
    "output": "Fluttershy: That is special."
  },
  {
    "input": "Twilight Sparkle: I hope so, 'cause it looks like this one might be a little tricky. You're going to the Peaks of Peril.",
    "output": "Fluttershy: The Peaks of... P-P-Peril?!"
  },
  {
    "input": "Twilight Sparkle: Only what Rockhoof told me. Back in his day, nopony knew much about the Peaks of Peril except for the legend on this ancient shield. It says a group called the Kirin used to live there, known for their kindness and truth-speaking.",
    "output": "Applejack: Now we know why the Map called us."
  },
  {
    "input": "Twilight Sparkle: Unfortunately, other creatures also lived there. The Nirik, fearsome beasts of pure fire.",
    "output": "Fluttershy: Maybe you should go instead of me, Twilight."
  },
  {
    "input": "Twilight Sparkle: Sorry, Fluttershy. Flanks don't lie.",
    "output": "Applejack: Aw, I'm sure the two of us'll get that friendship problem solved, no matter what kind o' creature has it."
  },
  {
    "input": "Twilight Sparkle: Woo-hoo-hoo!",
    "output": "Spike: Whoa! Ta-da!"
  },
  {
    "input": "Twilight Sparkle: Okay, Spike. Now let's try a flip. Remember – two flaps, then straight up!",
    "output": "Spike: Got it!"
  },
  {
    "input": "Twilight Sparkle: You're doing great, Spike. Now let's see the big finish!",
    "output": "Spike: Whoa-oa-oa-oa!"
  },
  {
    "input": "Twilight Sparkle: Maybe I should get Rainbow Dash. She's the one who taught me advanced flying techniques.",
    "output": "Spike: No, thanks. If I'm gonna mess up, I'd rather do it in front of you. I just don't understand why none of your advice is helping."
  },
  {
    "input": "Twilight Sparkle: Spike, I've been thinking about our flying lesson.",
    "output": "Spike: Uh-huh..."
  },
  {
    "input": "Twilight Sparkle: I can't believe I overlooked something as simple as feathers. It's no wonder you were having trouble. I wish I had more \"dragonish\" knowledge to give you. Do you think being raised by ponies has affected you in other ways? Spike?",
    "output": "Spike: Did you say something, Twilight? Sorry. I'm just finishing up this \"thank-you\" throw pillow for Smolder. And you know how I get when I'm in the embroidery zone."
  },
  {
    "input": "Twilight Sparkle: I'm glad Spike brought you here, Sludge. I understand you made quite the impression in town.",
    "output": "Pinkie Pie: Literally! There's a hole and everything!"
  },
  {
    "input": "Twilight Sparkle: I know you had your reservations, but it's good to see you feeling better.",
    "output": "Sludge: T-Thanks, I guess."
  },
  {
    "input": "Twilight Sparkle: We try our best, but sometimes I worry that maybe Spike is...",
    "output": "Spike: Missing something deep down and dragonish."
  },
  {
    "input": "Twilight Sparkle: So you crashed in Ponyville on purpose?",
    "output": "Sludge: Well, the crash part wasn't on purpose, but heading here was. I've been searching everywhere for you, kid."
  },
  {
    "input": "Twilight Sparkle: Also, the Hippogriffs returned to Mount Aris after we helped them defeat the Storm King.",
    "output": "Sludge: Oh, well, have you heard of the Land of the... Scale Collectors?"
  },
  {
    "input": "Twilight Sparkle: Uh-uh.",
    "output": "Sludge: Because that's where your mother's trail finally led."
  },
  {
    "input": "Twilight Sparkle: Hey, Spike! How are things going with Sludge?",
    "output": "Spike: Honestly, I thought having him around would make me feel more dragonish. But I kind of feel less."
  },
  {
    "input": "Twilight Sparkle: Oh, I'm sorry. I wish I could help.",
    "output": "Sludge: Awww, shucks. I guess I shouldn't have said anything about you being more pony than dragon. I just wish we had more in common."
  },
  {
    "input": "Twilight Sparkle: Maybe you two can come up with ways to turn up Spike's, uh, dragonishness.",
    "output": "Spike: You think that's something we can do?"
  },
  {
    "input": "Twilight Sparkle: Oh! I'm so sorry! I didn't mean to barge in on ya!",
    "output": "Sludge: Ah, don't worry about it. Mi castle es su castle."
  },
  {
    "input": "Twilight Sparkle: Oh! Spike! I'm so sorry. My morning is not going well. What is all this? Why'd you leave the castle so early?",
    "output": "Spike: I didn't leave. I spent the night outdoors to get in touch with my dragon side."
  },
  {
    "input": "Twilight Sparkle: Outdoors?",
    "output": "Spike: Yeah! And Sludge asked me to bring him the best breakfast Ponyville has to offer so he can show me how a real dragon would eat it. See you later!"
  },
  {
    "input": "Twilight Sparkle: ...And that's why I thought we could use the map to—",
    "output": "Spike: Hey, gang! Dad was just showing me how a real dragon would act in a throne room."
  },
  {
    "input": "Twilight Sparkle: I'm glad you're not spending the night outside again.",
    "output": "Spike: Oh, I am. I'm just looking for a good bedtime story to read to my dad first."
  },
  {
    "input": "Twilight Sparkle: It's nice that you have somepony to show you dragon culture. But are you sure that's what Sludge is doing?",
    "output": "Spike: What do you mean?"
  },
  {
    "input": "Twilight Sparkle: Well, taking over your room, making a mess of things...",
    "output": "Spike: That is dragon culture."
  },
  {
    "input": "Twilight Sparkle: You never acted like that.",
    "output": "Spike: That's because you raised me. Now I finally have a chance to see how I'm supposed to be."
  },
  {
    "input": "Twilight Sparkle: I don't think you're supposed to be any different than who you are.",
    "output": "Spike: Maybe you just don't like that I have a real parent now."
  },
  {
    "input": "Twilight Sparkle: That's not true! I'm glad Sludge is here. I-I just wish he wasn't such a—",
    "output": "Spike: Dragon? Of all ponies, I can't believe you would have a problem with that."
  },
  {
    "input": "Twilight Sparkle: Oh. Hi. Where's your father?",
    "output": "Spike: He's gone. Turns out he wasn't what a real dragon should be after all. He also wasn't my real dad."
  },
  {
    "input": "Twilight Sparkle: Oh, Spike. I'm so sorry.",
    "output": "Spike: I'm the one who's sorry. You were just worried about me, and I lost my temper. Sludge was just a great big phony."
  },
  {
    "input": "Twilight Sparkle: I have to say, I'm not surprised. There's no way a dragon like that was related to you. But if you still want to search for your real family, I'd understand if you spent more time in the Dragon Lands.",
    "output": "Spike: I don't think so. I already know who my real family is."
  },
  {
    "input": "Twilight Sparkle: Aww! It's me, right?",
    "output": "Spike: Mm-hmm! Besides, there's no way I'm living without pillows."
  },
  {
    "input": "Twilight Sparkle: The mail's here already? What time is it?! I'm late for my class's field trip to Cloudsdale!",
    "output": "Cozy Glow: Don't worry. I asked Professor Rainbow Dash to cover for you."
  },
  {
    "input": "Twilight Sparkle: And she said yes?",
    "output": "Cozy Glow: Uh-huh. I told her how busy you are and how much her loyalty meant to you. I also color-coded your teaching schedule by friendship element and catalogued all the magical artifacts in the school. I hope that's okay."
  },
  {
    "input": "Twilight Sparkle: Okay? Cozy, that's amazing! You're like my right-hoof pony! I don't know what I'd do without you.",
    "output": "Cozy Glow: It's like you taught me. Helping is what friendship's all about."
  },
  {
    "input": "Twilight Sparkle: Exactly. And hopefully my class is learning that on their field trip right now.",
    "output": "Cozy Glow: I heard they might do some sightseeing first."
  },
  {
    "input": "Twilight Sparkle: Slow down. What happened?",
    "output": "Starlight Glimmer: I cast a spell for our field trip to Cloudsdale, but my magic just failed."
  },
  {
    "input": "Twilight Sparkle: I didn't drop that book.",
    "output": "Starlight Glimmer: Maybe you did your spell wrong?"
  },
  {
    "input": "Twilight Sparkle: This doesn't make any sense. Magic can't just disappear. Something has to be causing this.",
    "output": "Cozy Glow: Um, didn't we learn in class about a creature that eats magic? Ter, Tee... Tir-something?"
  },
  {
    "input": "Twilight Sparkle: Spike, what's wrong?",
    "output": "Spike: Thanks. I've never had a letter get stuck before. It's from Princess Celestia! We've all been called to an emergency meeting in Canterlot! Look!"
  },
  {
    "input": "Twilight Sparkle: Pretty sure I know what it's about.",
    "output": "Princess Celestia: Throughout our city, ponies have been reporting tales of their magic failing. Spells going wrong. Potions not working."
  },
  {
    "input": "Twilight Sparkle: We experienced it first-hoof.",
    "output": "Princess Cadance: It's the same in my kingdom. The Crystal Heart seems safe for now, but I worry if this continues."
  },
  {
    "input": "Twilight Sparkle: Has anypony checked on Tirek?",
    "output": "Pinkie Pie: You mean the big, red, scary centaur who eats magic? Why would we wa— Ohhhh. Riiiiight."
  },
  {
    "input": "Twilight Sparkle: We'll go.",
    "output": "Rarity: Oh, no-no-no-no-no-no. Not without us, you wo— Wait. Did you say \"we\"?"
  },
  {
    "input": "Twilight Sparkle: I've finally learned that it's okay to count on your friends for help. Um, you do want to come, right?",
    "output": "Rainbow Dash: Uh, duh!"
  },
  {
    "input": "Twilight Sparkle: Okay. I left you my lesson plan, all my student files, and my annotated syllabus notes. If anything goes wrong, get Celestia.",
    "output": "Starlight Glimmer: Got it!"
  },
  {
    "input": "Twilight Sparkle: Maybe I should just close the school and send my students home.",
    "output": "Starlight Glimmer: Would you go save Equestria already?"
  },
  {
    "input": "Twilight Sparkle: Plus, she'll have you to help her.",
    "output": "Cozy Glow: Oh, golly, yes! I promise I'll be the best assistant ever! Come on. We can start working on your substitute headmare plans right now, if you like."
  },
  {
    "input": "Twilight Sparkle: See? Nothing to worry about. Tell me there's nothing to worry about.",
    "output": "Cozy Glow: Good morning, friendship students! I know we're all sad Professor Sparkle is away. But don't worry, because she left me in charge to do things just the way she would."
  },
  {
    "input": "Twilight Sparkle: Have you tried using your tail to shoo them away?",
    "output": "Rarity: Bite your tongue! It's for decorative purposes only!"
  },
  {
    "input": "Twilight Sparkle: I think we have all the magic we need right here. Not that I don't want to get it back. Heh. Let's go!",
    "output": "\"Citrine Spark\": Cozy Glow baked our class cupcakes today!"
  },
  {
    "input": "Twilight Sparkle: This is the only door to Tartarus. The good news is the seal isn't broken, so we know Tirek didn't escape.",
    "output": "Applejack: Let me guess. You got bad news, too?"
  },
  {
    "input": "Twilight Sparkle: Last time I was here, I had to use magic to get in. And according to Star Swirl, all unicorn magic was gone by yesterday's sunset.",
    "output": "Rainbow Dash: Maybe he was wrong."
  },
  {
    "input": "Twilight Sparkle: The Key of Unfettered Entrance! Where did you find this, Spike?",
    "output": "Spike: In your bag. Cozy Glow must've packed it for you."
  },
  {
    "input": "Twilight Sparkle: She really did think of everything.",
    "output": "Fluttershy: Um, what does it do?"
  },
  {
    "input": "Twilight Sparkle: I guess it only works once.",
    "output": "Applejack: Cockatrice!"
  },
  {
    "input": "Twilight Sparkle: Star Swirl said that would happen on the second day.",
    "output": "Spike: I know it should make me feel safer, but it just makes me sad. We gotta fix this!"
  },
  {
    "input": "Twilight Sparkle: We want answers, Tirek. Magic is disappearing from Equestria.",
    "output": "Lord Tirek: I know. What a waste of such... ...mmmm, delicious power."
  },
  {
    "input": "Twilight Sparkle: Where is Equestria's magic going, Tirek? What's making it disappear?",
    "output": "Lord Tirek: If you let me out, I'm sure it will jog my memory. What do you say? I scratch your back, you scratch mine?"
  },
  {
    "input": "Twilight Sparkle: We'll go.",
    "output": "Gallus: I thought Starlight Glimmer was gonna be temporary headmare."
  },
  {
    "input": "Twilight Sparkle: Cozy Glow is behind all of this?!",
    "output": "Lord Tirek: I'm not usually a fan of ponies, but draining your precious world of magic so she could trap the six of you was inspiring!"
  },
  {
    "input": "Twilight Sparkle: I knew we shouldn't have left!",
    "output": "Applejack: But Starlight's in charge at the school. If anypony can stop Cozy Glow, it's her."
  },
  {
    "input": "Twilight Sparkle: We have to get out of here. Her students can't handle Cozy on their own.",
    "output": "Rainbow Dash: Then I guess we'll just have to bust our way out!"
  },
  {
    "input": "Twilight Sparkle: Unless... These creatures might be losing their magical powers, but there's still a magic that makes up what they are. Maybe we can borrow some of that.",
    "output": "Cozy Glow: Uh, excuse me? Um, Chancellor Neighsay?"
  },
  {
    "input": "Twilight Sparkle: We need to try everything if we want to get out of here.",
    "output": "Pinkie Pie: I don't know. Tartarus isn't so bad. I could hang out here for a while!"
  },
  {
    "input": "Twilight Sparkle: Have you even thought about what losing magic would mean?",
    "output": "Lord Tirek: It means the six of you will be trapped here! Like me!"
  },
  {
    "input": "Twilight Sparkle: Exactly. It means you're trapped here. Forever. With us.",
    "output": "Lord Tirek: Uhhhh... I hadn't thought of it like that."
  },
  {
    "input": "Twilight Sparkle: Dash and Applejack nearly have Cerberus tired out. If Rarity pitches in, I think they can get him to sit still long enough to try what I have in mind.",
    "output": "Fluttershy: I'm sure I can get the other monsters to help. Besides, I would never call them monsters."
  },
  {
    "input": "Twilight Sparkle: All right. Is everypony ready?",
    "output": "Rarity: Sit! Good! I can't say for how much longer."
  },
  {
    "input": "Twilight Sparkle: Come on! I don't know how long I can hold it!",
    "output": "Rainbow Dash: Good boy!"
  },
  {
    "input": "Twilight Sparkle: I couldn't have done it without all your help.",
    "output": "Rarity: I'm not sure we did!"
  },
  {
    "input": "Twilight Sparkle: No!",
    "output": "Applejack: Tirek said all of Equestria's magic would be gone at sunset."
  },
  {
    "input": "Twilight Sparkle: Without magic, there's no way we'll get back to the school in time!",
    "output": "Fluttershy: What does that mean?"
  },
  {
    "input": "Twilight Sparkle: It means... we've failed!",
    "output": "Cozy Glow: After everything Twilight's done for you, why would you want to destroy her school?"
  },
  {
    "input": "Twilight Sparkle: But I still don't understand why.",
    "output": "Cozy Glow: Why?! Because friendship is power! You might be the Princess of Friendship, but as headmare of this school, I can collect even more friends than you!"
  },
  {
    "input": "Twilight Sparkle: You're the one who doesn't get it, Cozy. Friendship is powerful, but power isn't why you make friends. I'm sorry I couldn't teach you that.",
    "output": "Gallus: Well, you taught us."
  },
  {
    "input": "Twilight Sparkle: What's going on?",
    "output": "Silverstream: Hi, Headmare Twilight! We're just practicing for graduation!"
  },
  {
    "input": "Twilight Sparkle: Graduation?",
    "output": "Gallus: Now that we've saved Equestria, we figure we're done with school."
  },
  {
    "input": "Twilight Sparkle: Saving Equestria is nice, but I'm afraid it'll take more than one semester to learn all there is to know about friendship.",
    "output": "Spike: Told ya."
  },
  {
    "input": "Twilight Sparkle: If it were easy to learn, we wouldn't need a school.",
    "output": "Apple Bloom: We held her off as long as we could!"
  },
  {
    "input": "Twilight Sparkle: Everything worked out just fine.",
    "output": "Princess Celestia: As for Cozy Glow, I can assure you — where she's going, she won't be causing any more trouble."
  }
]